{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US FDA adds warning about rare heart inflammation to Pfizer, Moderna Covid vaccines - The Indian Express", "description": "As of June 11, more than 1,200 cases of myocarditis or pericarditis have been reported to the U.S. Vaccine Adverse Event Reporting System (VAERS), out of about 300 million mRNA vaccine doses administered.", "url": "https://indianexpress.com/article/world/us-fda-adds-warning-about-rare-heart-inflammation-to-pfizer-moderna-covid-vaccines-7376528/", "urlToImage": "https://images.indianexpress.com/2021/06/Pfizer-moderna.jpg", "publishedAt": "2021-06-26T03:25:08Z", "content": "The U.S. drug regulator on Friday added a warning to the literature that accompanies Pfizer Inc /BioNTech and Moderna COVID vaccine shots to indicate the rare risk of heart inflammation after its use… [+1214 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Just Give Us The Vaccines\", WHO Pleads, As Poor Countries Lack Doses - NDTV", "description": "Rich countries are opening up societies and vaccinating young people who are not at great risk from COVID-19, while the poorest countries cruelly lack doses, the World Health Organization said on Friday, condemning a global failure.", "url": "https://www.ndtv.com/world-news/coronavirus-just-give-us-the-vaccines-who-pleads-as-poor-countries-lack-doses-2472722", "urlToImage": "https://c.ndtvimg.com/2021-06/6cb3frfo_tedros-adhanom-ghebreyesus-650_625x300_26_June_21.jpeg", "publishedAt": "2021-06-26T02:02:53Z", "content": "\"Our world is failing, as the global community we are failing,\" Tedros Adhanom Ghebreyesus said.\r\nRich countries are opening up societies and vaccinating young people who are not at great risk from C… [+1989 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Tick ​​season is coming, say UW Health experts - Health Bollyinside - BollyInside", "description": "MADISON, Wis. – As the warm weather is making its way through Wisconsin, the tick population is growing and experts are predicting a bad tick season.", "url": "https://www.bollyinside.com/news/tick-​​season-is-coming-say-uw-health-experts", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/03/Health-bollyins-ide-23.jpg", "publishedAt": "2021-06-25T23:46:53Z", "content": "MADISON, Wis. As the warm weather is making its way through Wisconsin, the tick population is growing and experts are predicting a bad tick season. However, the University of Wisconsin Health is offe… [+2255 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Health News Roundup: U.S. administers 321.2 million doses of COVID-19 vaccines - CDC; Mexico's coronavirus death toll rises to 232,346 and more - Devdiscourse", "description": "At least 20 cases in Maharashtra state have been found linked to the new Delta Plus variant that India designated a variant of concern on Tuesday, according to the health ministry.  Canada says COVID-19 Delta variant could cause greater than expected surge  C…", "url": "https://www.devdiscourse.com/article/health/1627987-health-news-roundup-us-administers-3212-million-doses-of-covid-19-vaccines---cdc-mexicos-coronavirus-death-toll-rises-to-2", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_06_2021_08_09_51_6516878.jpg?width=920&format=jpeg", "publishedAt": "2021-06-25T20:56:12Z", "content": "Following is a summary of current health news briefs.\r\nVaccine-linked heart condition tends to resolve quickly; Delta variant fuses cells to infect more efficiently\r\nThe following is a roundup of som… [+4160 chars]"}, {"source": {"id": null, "name": "Eastafricanewspost.com"}, "author": "Zera Pearson", "title": "Increasing circular and delta outbreaks, surveillance and immunization - East Africa News Post", "description": "Cases associated with kappa and delta variants are increasing in Italy, particularly outbreaks due to delta variant. This is what we read in today's", "url": "https://www.eastafricanewspost.com/increasing-circular-and-delta-outbreaks-surveillance-and-immunization/", "urlToImage": "https://news.google.com/canale_saluteebenessere/img/banner/banner_300x100_europe_assistance.gif", "publishedAt": "2021-06-25T19:09:15Z", "content": "Cases associated with kappa and delta variants are increasing in Italy, particularly outbreaks due to delta variant. This is what we read in today’s Ministry of Health publication with an update of t… [+1136 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Andrea Michelson", "title": "Cannabis use may be linked to increasing suicidal thoughts in young women, study finds - Business Insider India", "description": "A new study by the US National Institutes of Health has linked cannabis use and suicidality in young people. Young adults who used weed were more likely to", "url": "https://www.businessinsider.in/science/health/news/cannabis-use-may-be-linked-to-increasing-suicidal-thoughts-in-young-women-study-finds/articleshow/83854655.cms", "urlToImage": "https://www.businessinsider.in/photo/83854655/cannabis-use-may-be-linked-to-increasing-suicidal-thoughts-in-young-women-study-finds.jpg?imgsize=157212", "publishedAt": "2021-06-25T18:51:00Z", "content": "A new study from the National Institutes of Health suggests there may be a link between cannabis use and rising rates of suicidal ideation, planning, and attempts among young people.\r\nBoth casual and… [+3490 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Immune Cells Are Kept in Line by Hard-working Enzyme - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. During a new study, researchers at La Jolla Institute for Immunology (LJI) shed light on a process in immune cells that may explain why some people develop cardiovascular diseases.", "url": "https://www.latestly.com/agency-news/science-news-immune-cells-are-kept-in-line-by-hard-working-enzyme-2584581.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/87656refuhlihuwhite_wJVZAAM_3pbFAsV_NrXGRDf_Y7frTxs.jpg", "publishedAt": "2021-06-25T18:45:06Z", "content": "Washington [US], June 25 (ANI): During a new study, researchers at La Jolla Institute for Immunology (LJI) shed light on a process in immune cells that may explain why some people develop cardiovascu… [+4266 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Is one vaccine dose enough if you've had COVID? What the science says - Nature.com", "description": "Research shows that a previous coronavirus infection plus one dose of vaccine provides powerful protection — but concerns linger.", "url": "https://www.nature.com/articles/d41586-021-01609-4", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-01609-4/d41586-021-01609-4_19256926.jpg", "publishedAt": "2021-06-25T18:43:25Z", "content": "A worker prepares a dose of COVID-19 vaccine. Governments are advising that only one dose of vaccine be given to those with a history of coronavirus infection.Credit: Chaiwat Subprasom/SOPA Images/Li… [+8403 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Southern California: USC researchers share discoveries on Alzheimer’s disease and discuss strategies to fight the illness - India Education Diary", "description": "Acontroversial new drug for Alzheimer’s disease is raising tough questions: Who should take it? Who will pay for it? And how will we know how well it works? But that’s not the only Alzheimer’s news during Alzheimer’s and Brain Awareness Month.Recent", "url": "https://indiaeducationdiary.in/university-of-southern-california-usc-researchers-share-discoveries-on-alzheimers-disease-and-discuss-strategies-to-fight-the-illness/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Southern-California.jpg", "publishedAt": "2021-06-25T17:54:40Z", "content": "Acontroversial new drug for Alzheimers disease is raising tough questions: Who should take it? Who will pay for it? And how will we know how well it works? But thats not the only Alzheimers news duri… [+4344 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Ians", "title": "Coronavirus Can Find Alternate Way To Infect Cells, Evade Vaccines - OTV News", "description": "<p>New York: A single mutation gives SARS-CoV-2, the virus that causes Covid-19, the ability to enter cells through another route, opening up the possibility of evading Covid antibodies or vaccines, finds a study.</p>\r\n\r\n<p>Early in the Covid-19 pandemic, sci…", "url": "https://odishatv.in/news/covid-19/coronavirus-can-find-alternate-way-to-infect-cells-evade-vaccines-66141", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_0/IMAGE_1620465246.jpg", "publishedAt": "2021-06-25T17:08:53Z", "content": "New York: A single mutation gives SARS-CoV-2, the virus that causes Covid-19, the ability to enter cells through another route, opening up the possibility of evading Covid antibodies or vaccines, fin… [+2680 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Third wave of coronavirus unlikely to be as severe as second wave: Study - Economic Times", "description": "Considering the four hypotheses for the emergence of a third wave, the study said, infection-induced immunity may decay over time, permitting re-infection of those previously exposed, even if the circulating virus remains unchanged.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/third-wave-of-coronavirus-unlikely-to-be-as-severe-as-second-wave-study/articleshow/83848504.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83848618,width-1070,height-580,imgsize-33678,overlay-economictimes/photo.jpg", "publishedAt": "2021-06-25T17:02:00Z", "content": "A third wave of COVID-19 -- if it occurs -- is unlikely to be as severe as the second wave given the extent of spread of coronavirus infections that has already taken place in the country, according … [+4799 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Shivakaminathan", "title": "How artificial sweeteners can harm your gut - DTNext", "description": "Commonly used artificial sweeteners can cause previously healthy gut bacteria to become diseased and invade the gut wall, potentially leading to serious health issues, according to a new research.", "url": "http://www.dtnext.in/Lifestyle/Wellbeing/2021/06/25221102/1303089/How-artificial-sweeteners-can-harm-your-gut.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Jun/202106252211024036_How-artificial-sweeteners-can-harm-your-gut_SECVPF.gif", "publishedAt": "2021-06-25T17:00:00Z", "content": "Commonly used artificial sweeteners can cause previously healthy gut bacteria to become diseased and invade the gut wall, potentially leading to serious health issues, according to a new research.\r\nL… [+2121 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Over-the-counter antacids may improve glucose levels in people with diabetes - News-Medical.Net", "description": "Antacids improved blood sugar control in people with diabetes but had no effect on reducing the risk of diabetes in the general population, according to a new meta-analysis published in the Endocrine Society's Journal of Clinical Endocrinology & Metabolism.", "url": "https://www.news-medical.net/news/20210625/Over-the-counter-antacids-may-improve-glucose-levels-in-people-with-diabetes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Blood_glucose-620x480.jpg", "publishedAt": "2021-06-25T16:45:00Z", "content": "Antacids improved blood sugar control in people with diabetes but had no effect on reducing the risk of diabetes in the general population, according to a new meta-analysis published in the Endocrine… [+2364 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "High Intake of Chocolate in the Morning Could Help Burn Body Fat, Reduce Blood Glucose Levels | Medicine, Nutrition - Sci-News.com", "description": "A new study suggests that having chocolate in the morning or in the evening/night results in differential effects on hunger and appetite, lipid oxidation, fasting glucose, microbiota, and sleep and temperature rhythms.", "url": "http://www.sci-news.com/medicine/morning-chocolate-body-fat-blood-glucose-09797.html", "urlToImage": "http://cdn.sci-news.com/images/2021/06/image_9797f-Chocolate.jpg", "publishedAt": "2021-06-25T15:57:36Z", "content": "A new study, led by Brigham and Womens Hospital scientists, suggests that having chocolate in the morning or in the evening/night results in differential effects on hunger and appetite, lipid oxidati… [+3343 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Chinese vaccines not as efficient against Delta variant: Researcher - WION", "description": "After WHO scientists warning that the Delta variant of COVID-19 is becoming globally dominant, a Chinese disease control researcher claims that antibodies triggered by the two Chinese vaccines — Sinovac and Sinopharm — are less effective against it.", "url": "https://www.wionews.com/world/chinese-vaccines-not-as-efficient-against-delta-variant-researcher-393967", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/12/25/175696-sinovac-covid-vaccine.jpg", "publishedAt": "2021-06-25T15:03:42Z", "content": "After WHO scientist's warning that the Delta variant of COVID-19 is becoming globally dominant, a Chinese disease control researcher claims that antibodies triggered by the two Chinese vaccines  Sino… [+1422 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Sputnik V safest among COVID-19 vaccines, no deaths: Argentina health ministry - CNBCTV18", "description": "Post-vaccination events included fever, headaches and pain in jabbed area only. Argentina has so far administered 2.8 million doses of Russian vaccine so far.", "url": "https://www.cnbctv18.com/healthcare/sputnik-v-safest-among-covid-19-vaccines-no-deaths-argentina-health-ministry-9782371.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/03/vaccine_sputnikv2-1019x573.jpg", "publishedAt": "2021-06-25T14:42:54Z", "content": "MiniPost-vaccination events included fever, headaches and pain in jabbed area only. Argentina has so far administered 2.8 million doses of Russian vaccine so far."}, {"source": {"id": null, "name": "India TV News"}, "author": "India TV News Desk", "title": "Coronavirus epidemic hit East Asia 20,000 years ago: Study - India TV News", "description": "A coronavirus epidemic broke out in the East Asia region more than 20,000 years ago, similar to the current Covid-19 pandemic, an international study of human genomes has discovered.", "url": "https://www.indiatvnews.com/science/coronavirus-epidemic-hit-east-asia-20000-years-ago-study-714618", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/06/coronavirus-1624621090.jpeg", "publishedAt": "2021-06-25T14:31:52Z", "content": "In a new study, researchers have discovered that a coronavirus epidemic broke out in the East Asia region more than 20,000 years ago, similar to the current Covid-19 pandemic.\r\nThe study found that t… [+2834 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Surprising health benefits and facts about Vitamin C you should know about - Times of India", "description": "VitaminC is a water-soluble vitamin linked to impressive health benefits. From being involved in the repair of tissues and the enzymatic production of certain neurotransmitters. Most importantly, it plays a very critical role in regulating the functioning of …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/surprising-health-benefits-and-facts-about-vitamin-c-you-should-know-about/photostory/83836463.cms", "urlToImage": "https://static.toiimg.com/photo/83836767.cms", "publishedAt": "2021-06-25T14:30:00Z", "content": "VitaminC is a water-soluble vitamin linked to impressive health benefits. From being involved in the repair of tissues and the enzymatic production of certain neurotransmitters. Most importantly, it … [+261 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Continued surveillance can help tweak vaccines for COVID-19 variants - Down To Earth Magazine", "description": "Need to seamlessly connect vaccine development pipelines to variant identification and testing so that time can be saved while updating vaccines for newer variants, experts say", "url": "https://www.downtoearth.org.in/news/health/continued-surveillance-can-help-tweak-vaccines-for-covid-19-variants-77651", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2021-06-25/0.11858300_1624625335_vaccine.jpg", "publishedAt": "2021-06-25T14:21:58Z", "content": "Need to seamlessly connect vaccine development pipelines to variant identification and testing so that time can be saved while updating vaccines for newer variants, experts sayAs variants of SARS-CoV… [+4678 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "WHO warns against taking painkillers before Covid-19 vaccine - Morung Express", "description": "BRUSSELS, JUNE 25 (IANS): Taking painkillers before a Covid-19 shot to prevent potential side effects is not advised, as it may impact the vaccines' efficacy, said the World Health Organization (WHO), the media reported.", "url": "https://www.morungexpress.com/", "urlToImage": "https://www.morungexpress.com/uploads/2021/06/86604443_1624629677_world-health-organization-1210736.jpg", "publishedAt": "2021-06-25T14:02:12Z", "content": "BRUSSELS, JUNE 25 (IANS): Taking painkillers before a Covid-19 shot to prevent potential side effects is not advised, as it may impact the vaccines' efficacy, said the World Health Organization (WHO)… [+1619 chars]"}, {"source": {"id": null, "name": "Businesswireindia.com"}, "author": null, "title": "MGM Healthcare Chennai Successfully Performs India's First Liver Transplant with Hypo-Thermic Oxygenated Perfusion - Business Wire India", "description": "MGM Healthcare Chennai Successfully Performs India", "url": "https://www.businesswireindia.com/mgm-healthcare-chennai-successfully-performs-indias-first-liver-transplant-with-hypo-thermic-oxygenated-perfusion-73700.html", "urlToImage": "https://www.businesswireindia.com/images/favicon.ico", "publishedAt": "2021-06-25T12:59:02Z", "content": "Chennai, Tamil Nadu, India:\r\n  MGM Healthcare, a multi-specialty quaternary care hospital in the heart of the Chennai, today announced that it had successfully conducted a Cadaveric Liver Transplanta… [+6213 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Glasgow: No Increased Risk Of Dementia In Veterans - India Education Diary", "description": "The number of Scottish veterans who develop dementia in later life is no greater than in the wider community, according to new research.The study, led by the University of Glasgow, funded by Forces in Mind Trust and published in Psychological Medicin", "url": "https://indiaeducationdiary.in/university-of-glasgow-no-increased-risk-of-dementia-in-veterans/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-8-1.jpg", "publishedAt": "2021-06-25T12:50:43Z", "content": "The number of Scottish veterans who develop dementia in later life is no greater than in the wider community, according to new research.\r\nThe study, led by the University of Glasgow, funded by Forces… [+2851 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Alexandra Thompson", "title": "'Always ready': Men with erectile dysfunction having more sex during pandemic, study suggests - Yahoo India News", "description": "'With their partners at home, they wanted to always be ready.'", "url": "https://in.news.yahoo.com/men-erectile-dysfunction-more-sex-pandemic-120025359.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/BF2L_iaj5WNIPqcYg2C6PA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMw/https://s.yimg.com/os/creatr-uploaded-images/2021-06/b98065f0-d5a2-11eb-9eff-2386bffefc3a", "publishedAt": "2021-06-25T12:00:25Z", "content": "Men with erectile dysfunction may be having more sex amid the pandemic. (Stock, Getty Images)\r\nThe stress of the pandemic undoubtedly put many off getting frisky.\r\nA very specific group of people may… [+2419 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "UK 'miracle man' tests COVID-19 positive for 10 months, hospitalised 7 times - DNA India", "description": "Dave Smith, a retired driving instructor from Bristol in the UK, said he tested positive 43 times that is over 305 days, was hospitalised seven times.", "url": "https://www.dnaindia.com/world/report-uk-miracle-man-tests-covid-19-positive-for-10-months-hospitalised-seven-times-2897387", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2021/06/25/981793-anti-body-cocktail-reuters.jpg", "publishedAt": "2021-06-25T11:47:00Z", "content": null}, {"source": {"id": null, "name": "Business Standard"}, "author": "BS Web Team", "title": "Second wave of coronavirus not yet over in India, says health ministry - Business Standard", "description": "Addressing a briefing on the coronavirus situation in the country, health ministry officials said around 48 Delta plus variant cases were detected from 45,000 samples sequenced so far in India", "url": "https://www.business-standard.com/article/current-affairs/second-wave-of-coronavirus-not-yet-over-in-india-says-health-ministry-121062501059_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/21/full/1621539012-8087.jpg", "publishedAt": "2021-06-25T11:47:00Z", "content": "Second coronavirus wave is not yet over in India as there are still 75 districts with more than 10 per cent prevalence of virus, 92 districts with 5-10 per cent prevalence, the government said on Fri… [+2413 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Dr. Catherine Schuster-Bruce", "title": "The US hasn't vaccinated enough people to stop a Delta variant spike of infections, one of the leading US publ - Business Insider India", "description": "A top US public-health expert has warned COVID-19 cases in the US could spike within weeks.The US hadn't vaccinated enough people to stop the spread of the", "url": "https://www.businessinsider.in/science/health/news/the-us-hasnt-vaccinated-enough-people-to-stop-a-delta-variant-spike-of-infections-one-of-the-leading-us-public-health-experts-has-warned/articleshow/83840976.cms", "urlToImage": "https://www.businessinsider.in/photo/83840976/the-us-hasnt-vaccinated-enough-people-to-stop-a-delta-variant-spike-of-infections-one-of-the-leading-us-public-health-experts-has-warned.jpg?imgsize=1563259", "publishedAt": "2021-06-25T11:32:00Z", "content": "A top US public-health doctor has warned that the nation hasn't vaccinated enough people to stop a spike in cases from the Delta coronavirus virus.\r\nDr. Ashish Jha, dean at the Brown School of Public… [+2088 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Arushi Bidhuri", "title": "Sweet Tip To Reduce Blood Sugar Levels Post Menopause: Start Your Day With Chocolates - TheHealthSite", "description": "A new study has found that consuming milk chocolate in a specific window may help the body burn fat and lower blood sugar levels in postmenopausal women.", "url": "https://www.thehealthsite.com/diseases-conditions/diseases-conditions-womens-health/sweet-tip-to-reduce-blood-sugar-levels-post-menopause-start-your-day-with-chocolates-822033/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2021/06/chocolate-655x353.jpg", "publishedAt": "2021-06-25T10:45:46Z", "content": "Postmenopause refers to the period following menopause in a woman’s life. Many of the annoying symptoms that a woman may have had prior to menopause begin to fade at this time. When a woman has gone … [+2990 chars]"}, {"source": {"id": null, "name": "Times of Oman"}, "author": "Bitwize - http://bitwize.com.lb", "title": "COVID-19 vaccine safe for pregnant women after 1st trimester | Times of Oman - Times of Oman", "description": "The COVID-19 vaccine target group will include women who have completed 3 months of pregnancy", "url": "https://timesofoman.com/article/103229-covid-19-vaccine-safe-for-pregnant-women-after-1st-trimester", "urlToImage": "https://shabiba.eu-central-1.linodeobjects.com/2021/06/1624617387-1624617387-yhzgtzhmdlyu.jpg", "publishedAt": "2021-06-25T10:36:00Z", "content": "Muscat: The COVID-19 vaccine target group will include women who have completed 3 months of pregnancy.\r\nThe Ministry of Health has issued guidelines that must be followed while taking the vaccine for… [+864 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha", "title": "Coffee consumption, irrespective of its type, prevents chronic liver disease: Study - Medical Dialogues", "description": "UK: Coffee is the most consumed and popular beverage around the world. Different types of coffee...", "url": "https://medicaldialogues.in/gastroenterology/news/coffee-consumption-irrespective-of-its-type-prevents-chronic-liver-disease-study-78997", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/06/124023-coffee-1.jpg", "publishedAt": "2021-06-25T10:30:36Z", "content": "UK: Coffee is the most consumed and popular beverage around the world. Different types of coffee include decaffeinated, instant, and ground coffee. A recent study published in the journal BMC Public … [+2739 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Hina Zahid", "title": "Low Omega-3 index, a strong predictor of early death, study shows - Medical Dialogues", "description": "Omega-3 Index is a powerful tool as a risk factor and should be considered just as important as the...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/low-omega-3-index-a-strong-predictor-of-early-death-study-shows-79045", "urlToImage": "https://medicaldialogues.in/h-upload/2020/07/15/131702-omega-3.jpg", "publishedAt": "2021-06-25T09:47:40Z", "content": "Omega-3 Index is a powerful tool as a risk factor and should be considered just as important as the other established risk factors, and maybe even more so.USA: A low Omega-3 Index is just as powerful… [+4111 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Bindu Shajan Perappadan", "title": "No immediate threat due to Delta plus variant, says expert - The Hindu", "description": "Delta plus is not rising faster than Delta, says Anurag Agrawal, Director, Institute of Genomics and Integrative Biology (CSIR)", "url": "https://www.thehindu.com/news/national/no-immediate-threat-due-to-delta-plus-variant-says-csir-expert/article34963167.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/scyq4r/article34980977.ece/ALTERNATES/LANDSCAPE_615/AnuragAgrawaljpg", "publishedAt": "2021-06-25T09:20:24Z", "content": "In an exclusive interview, Anurag Agrawal, Director, Institute of Genomics and Integrative Biology (CSIR), Delhi, speaks on the Delta variant being a global concern, impact of mutation on efficacy of… [+5694 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Laxman Chaurasiya", "title": "Post covid is making children victims of this 'painful disease,' know what are the symptoms - News Track English", "description": "New Delhi: The second corona wave is beginning to weaken and experts now say the third wave is expected between August and September. In such a situation, there is a danger to the children. Before that, however, a new disease is being observed among children …", "url": "https://english.newstracklive.com/news/what-is-mis-c-disease-which-is-infecting-post-covid-19-children-mc23-nu764-ta322-1167305-1.html", "urlToImage": "https://media.newstracklive.com/uploads/national-news//Jun/25/big_thumb/kjsdg_60d58e57d368b.JPG", "publishedAt": "2021-06-25T08:27:30Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Three tests you can do at home to measure fitness level - The Indian Express", "description": "It is important to ensure that while your fat weight decreases, your lean body weight increases", "url": "https://indianexpress.com/article/lifestyle/fitness/weight-loss-fitness-level-test-rujuta-diwekar-7372346/", "urlToImage": "https://images.indianexpress.com/2021/06/Weight-loss_1200.jpg", "publishedAt": "2021-06-25T07:50:51Z", "content": "Amid rising cases of obesity, weight loss has become one of our primary concerns. While many of us may be trying to follow fad diets and exercise, we may not be getting the desired results. And even … [+1995 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Aliss Higham", "title": "Delta variant symptoms: How to tell the difference between COVID-19 and hay fever - Express", "description": "THE Delta variant has ripped through the UK in recent weeks, and is now the dominant strain throughout the country. How can you tell the difference between COVID-19 and hay fever?", "url": "https://www.express.co.uk/life-style/health/1453942/Delta-variant-symptoms-difference-between-Covid-19-hay-fever-EVG", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1453942.jpg", "publishedAt": "2021-06-25T07:20:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Burgess Langshaw Power, University of Waterloo; Juan Moreno-Cruz, University of Waterloo, and Neil Craik, University of Waterloo", "title": "Solar geoengineering could limit global warming, but Canada should study risks and benefits first - Yahoo India News", "description": "Waterloo (Canada), Jun 25 (The Conversation) The Swedish Space Corporation recently cancelled a field test of a high altitude balloon, intended to better...", "url": "https://in.news.yahoo.com/solar-geoengineering-could-limit-global-063056560.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2021-06-25T06:30:56Z", "content": "Waterloo (Canada), Jun 25 (The Conversation) The Swedish Space Corporation recently cancelled a field test of a high altitude balloon, intended to better understand solar geoengineering techniques th… [+7613 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "17mn in US went undiagnosed for Covid-19 before testing was ramped up - Daijiworld.com", "description": "Washington, Jun 25 (IANS): Nearly 17 million Americans went undiagnosed for Covid-19 in the US by mid-July 2020, according to a new study by the National Institutes of Health.\r\nThe study suggests that the prevalence of Covid-19 in the US during spring and sum…", "url": "https://daijiworld.com/news/newsDisplay?newsID=846860", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2021-06-25T06:09:16Z", "content": "Washington, Jun 25 (IANS): Nearly 17 million Americans went undiagnosed for Covid-19 in the US by mid-July 2020, according to a new study by the National Institutes of Health.\r\nThe study suggests tha… [+2170 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Monash develops quick, cheap test to detect jaundice in infants - India Education Diary", "description": "A fast, cheap paper test that can detect jaundice in newborns is on the verge of bedside validation and commercialisation, and distribution to health practitioners across the world.The joint-development by Monash University’s Faculty of Engineering,", "url": "https://indiaeducationdiary.in/monash-develops-quick-cheap-test-to-detect-jaundice-in-infants/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2021-06-25T04:40:47Z", "content": "A fast, cheap paper test that can detect jaundice in newborns is on the verge of bedside validation and commercialisation, and distribution to health practitioners across the world.\r\nThe joint-develo… [+4155 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Here are the health benefits of Connecticut-grown sugar kelp - Hindustan Times", "description": "We know seaweeds are healthy but this concrete data on the nutritional science and the health benefits of sugar kelp could encourage people to consume seaweed | Health", "url": "https://www.hindustantimes.com/lifestyle/health/here-are-the-health-benefits-of-connecticut-grown-sugar-kelp-101624594367750.html", "urlToImage": "https://images.hindustantimes.com/img/2021/06/25/1600x900/pjimage_(10)_1624594837263_1624594847901.jpg", "publishedAt": "2021-06-25T04:22:27Z", "content": "Researchers at the University of Connecticut have reported significant findings supporting the nutritional benefits of Connecticut-grown sugar kelp. They found brown sugar kelp (Saccharina latissima)… [+3599 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha", "title": "Elastography useful for breast cancer screening in microcalcification cases: Study - Medical Dialogues", "description": "Istanbul, Turkey: Shear-wave elastography (SWE) is a useful method for characterizing suspicious...", "url": "https://medicaldialogues.in/radiology/news/elastography-useful-for-breast-cancer-screening-in-microcalcification-cases-study-78962", "urlToImage": "https://medicaldialogues.in/h-upload/2020/08/13/133064-breast-screening.jpg", "publishedAt": "2021-06-25T03:45:00Z", "content": "Istanbul, Turkey: Shear-wave elastography (SWE) is a useful method for characterizing suspicious microcalcifications (MCs) in women undergoing breast cancer screening, finds a recent study. This woul… [+2343 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Komal Gautham", "title": "Chennai: Post Covid, one in four patients reports symptoms - Times of India", "description": "One in four recovered Covid-19 patients in the city has reported at least one of the following symptoms, weight loss, hairloss, body ache, joint pain,", "url": "https://timesofindia.indiatimes.com/city/chennai/chennai-post-covid-one-in-four-patients-reports-symptoms/articleshow/83829343.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-83829356,width-1070,height-580,imgsize-340250,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-06-25T02:54:00Z", "content": "Chennai: Post Covid, one in four patients reports symptoms"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Masks are here to stay, says UW health sciences professor - Health Bollyinside - BollyInside", "description": "MADISON, Wis. – Masks might not be mandatory in most places anymore, but experts predict masks will be a staple in society going forward.  According to", "url": "https://www.bollyinside.com/news/masks-are-here-to-stay-says-uw-health-sciences-professor", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/05/1622299036_Health-bollyins-ide-100.jpg", "publishedAt": "2021-06-25T02:47:21Z", "content": "MADISON, Wis. Masks might not be mandatory in most places anymore, but experts predict masks will be a staple in society going forward.  According to Ajay Sethi, associate professor of population hea… [+1619 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Parents of children with complex medical conditions more likely to have mental health issues - ANI News", "description": "Washington [US], June 25 (ANI): Parents of children with the most complex medical conditions are more likely to report poor or fair mental health and struggle to find community help, according to a study conducted by researchers at the University of Rochester…", "url": "https://www.aninews.in/news/lifestyle/parenting/parents-of-children-with-complex-medical-conditions-more-likely-to-have-mental-health-issues20210625080640", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/dsvbadvbasvdbavsd-thumbnail-154x87-70.jpg", "publishedAt": "2021-06-25T02:36:00Z", "content": "ANI | Updated: Jun 25, 2021 08:06 IST\r\nWashington [US], June 25 (ANI): Parents of children with the most complex medical conditions are more likely to report poor or fair mental health and struggle t… [+5111 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Joel P. Joseph", "title": "Papers That Scientists Could Not Replicate Were Cited More, Study Says - The Wire Science", "description": "Many scientists remain fixated on the 'prestige' of journals in which papers are published, to the detriment of science.", "url": "https://science.thewire.in/the-sciences/scientific-papers-replication-failure-citations-journal-impact-factor-prestige/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/06/24192259/tim-mossholder-kbuE-6cpITs-unsplash-scaled.jpg", "publishedAt": "2021-06-25T02:29:06Z", "content": "Photo: Tim Mossholder/Unsplash\r\nBengaluru: Scientists cited studies that were not reproducible and therefore were likelier to be false more than those that were, according to a new study published on… [+9213 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Lifestyle News | Adolescent Marijuana, Alcohol Use Didn't Decline Much During Coronavirus Pandemic: Survey - LatestLY", "description": "Get latest articles and stories on Lifestyle at LatestLY. According to a new survey of 12th graders in the United States, adolescent marijuana usage and binge drinking did not significantly change during the COVID-19 pandemic, despite record decreases in the …", "url": "https://www.latestly.com/agency-news/lifestyle-news-adolescent-marijuana-alcohol-use-didnt-decline-much-during-coronavirus-pandemic-survey-2581652.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/dedvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdfvdf_RL4Wyem.jpg", "publishedAt": "2021-06-25T00:14:05Z", "content": "Washington [US] June 25 (ANI): According to a new survey of 12th graders in the United States, adolescent marijuana usage and binge drinking did not significantly change during the COVID-19 pandemic,… [+5689 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Is aspirin really effective on acne and scars? - Times of India", "description": "Aspirin, which is acetylsalicylic acid (ASA) is a widely known medicine commonly used to relieve pain, fever or inflammation. Since it’s also affluent in preventing the blood clots and strokes, aspirin is also used in the heart attack treatment. But apart fro…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/is-aspirin-really-effective-on-acne-and-scars/photostory/83808922.cms", "urlToImage": "https://static.toiimg.com/photo/83811301.cms", "publishedAt": "2021-06-24T22:30:00Z", "content": "The inflammatory acne exhibits symptoms like red, pussy, swollen blisters while the non inflammatory acne shows minor pimples, blackheads or white heads.\r\nA study proved that aspirin was found compet… [+348 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Raw food diet: What is it, foods to eat and surprising health benefits - Times of India", "description": "When it comes to eating healthy, raw food diet should be your go-to plan. A raw food diet consists mainly of unprocessed whole foods, plant-based, and organic foods that are a source of high nutritional value.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/raw-food-diet-health-benefits-what-is-it-foods-to-eat-and-surprising-health-benefits/photostory/83808730.cms", "urlToImage": "https://static.toiimg.com/photo/83808743.cms", "publishedAt": "2021-06-24T18:30:00Z", "content": "While raw food may not seem so appealing, there are plenty of suitable options you can choose from. Here's a list of raw foods that are edible and healthy at the same time.\r\n- Vegetables such as onio… [+288 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Is Covid's impact on the brain as alarming as it sounds? - Mint", "description": "The UK has been running an incredible project called UK Biobank involving half a million adults ranging in age from 40 to 69", "url": "https://www.livemint.com/science/news/is-covid-s-impact-on-the-brain-as-alarming-as-it-sounds-11624558029276.html", "urlToImage": "https://images.livemint.com/img/2021/06/24/600x338/braincells-kUKH--621x414@LiveMint_1624558420261.jpg", "publishedAt": "2021-06-24T18:14:20Z", "content": "Recent research from the U.K. on the health effects of Covid-19 found that even mild cases could cause significant changes to the brain. Sam Fazeli, a Bloomberg Opinion contributor who covers the pha… [+5538 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "India TV Entertainment Desk", "title": "Which sunscreen is the best for you? know different types of sunscreens available in the market - India TV News", "description": "SPF known as Sun Protection Factor is an indicator of how effectively it can protect the skin from harmful of the sun rays. We need to buy a good sunscreen with a good amount of SPF. There are various types of sunscreens available in the market. Know which su…", "url": "https://www.indiatvnews.com/lifestyle/beauty-which-sunscreen-is-the-best-for-you-know-different-types-of-sunscreens-available-in-the-market-714430", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/06/pjimage-5-1624558133.jpg", "publishedAt": "2021-06-24T18:09:19Z", "content": "SPF known as Sun Protection Factor is an indicator of how effectively it can protect the skin from harmful of the sun rays. We need to buy a good sunscreen with a good amount of SPF. There are variou… [+2955 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Kalyan Ray", "title": "Kerala doctors find 7 cases of rare neuro disorder among Covishield recipients - Deccan Herald", "description": "Doctors in Kerala have detected seven cases of Guillain-Barre syndrome – a rare neurological disorder – within a month among 12 lakh people who received the Covishield vaccine, prompting them to alert others to watch out for GBS among the vaccine recipients.", "url": "https://www.deccanherald.com/national/kerala-doctors-find-7-cases-of-rare-neuro-disorder-among-covishield-recipients-1001092.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/06/24/pti06092021000224a-1-1001092-1624550096.jpg", "publishedAt": "2021-06-24T15:54:56Z", "content": "Doctors in Kerala have detected seven cases of Guillain-Barre syndrome  a rare neurological disorder within a month among 12 lakh people who received the Covishield vaccine, prompting them to alert o… [+2926 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Aanchal Nigam", "title": "COVID-19: Scientists develop 'universal vaccine' for coronaviruses, shows efficacy in mice - Republic World", "description": "A  “universal vaccine” for COVID-19 has been developed by US scientists that protected mice against SARS-CoV-2 along with at least five other emerging strains.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/covid-19-scientists-develop-universal-vaccine-for-coronaviruses-shows-efficacy-in-mice.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/xqmutkscjmidmoqo_1624544588.jpeg", "publishedAt": "2021-06-24T15:08:00Z", "content": "A  universal vaccine for COVID-19 has been developed by US scientists that protected mice against SARS-CoV-2 along with at least five other emerging strains. Researchers at the University of North Ca… [+2278 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Francesco Guarascio", "title": "Exclusive-WHO estimates COVID-19 boosters needed yearly for most vulnerable - Reuters", "description": "The World Health Organization (WHO) forecasts that people most vulnerable to COVID-19, such as the elderly, will need to get an annual vaccine booster to be protected against variants, an internal document seen by Reuters shows.", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/exclusive-who-estimates-covid-19-boosters-needed-yearly-most-vulnerable-2021-06-24/", "urlToImage": "https://www.reuters.com/resizer/UJesay3FjkxvE8aOOoSEkxOkKpI=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/ZRKEZSPJCNLLTM7K2R4FXVSIRI.jpg", "publishedAt": "2021-06-24T14:51:00Z", "content": "A logo is pictured outside a building of the World Health Organization (WHO) during an executive board meeting on update on the coronavirus disease (COVID-19) outbreak, in Geneva, Switzerland, April … [+4069 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Megan Hernbroth", "title": "A runny nose and headaches are some of the top Delta variant symptoms reported - Business Insider India", "description": "Hello, Welcome to Insider Healthcare. I'm Megan Hernbroth, and I regularly cover startups and venture capital here on the healthcare team. Today in healthcare", "url": "https://www.businessinsider.in/science/health/news/a-runny-nose-and-headaches-are-some-of-the-top-delta-variant-symptoms-reported/articleshow/83810950.cms", "urlToImage": "https://www.businessinsider.in/photo/83810950/a-runny-nose-and-headaches-are-some-of-the-top-delta-variant-symptoms-reported.jpg?imgsize=357619", "publishedAt": "2021-06-24T12:41:00Z", "content": "Hello,\r\nWelcome to Insider Healthcare\r\n. I'm Megan Hernbroth, and I regularly cover startups and venture capital here on the healthcare\r\n team. Today in healthcare news:\r\nIf you're new to this newsle… [+1554 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "My COVID Story: This COVID positive mom shares things she is doing to keep her child worry-free - Times of India", "description": "When Smita Padmanabhan tested COVID positive, her biggest worry was her 6-year-old daughter. Having not stayed away", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/my-covid-story-this-covid-positive-mom-shares-things-she-is-doing-to-keep-her-child-worry-free/articleshow/83809331.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-83809325,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-112583/83809325.jpg", "publishedAt": "2021-06-24T12:22:00Z", "content": "When Smita Padmanabhan tested COVID positive, her biggest worry was her 6-year-old daughter. Having not stayed away from her for long, she was worried about her. But then she charted a plan to stay c… [+2423 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Signs of brain inflammation found in people who died of COVID-19: Study - THE WEEK", "description": "Scientists have found signs of inflammation and neurodegeneration in the brains of individuals who died of COVID-19, similar to what is observed in people who die of conditions such as Alzheimer's and Parkinson's disease. The findings by researchers at the St…", "url": "https://www.theweek.in/news/sci-tech/2021/06/24/signs-of-brain-inflammation-found-in-people-who-died-of-covid-19.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/world/images/2021/1/15/covid-burial-israel.ap.jpg", "publishedAt": "2021-06-24T10:53:18Z", "content": "Scientists have found signs of inflammation and neurodegeneration in the brains of individuals who died of COVID-19, similar to what is observed in people who die of conditions such as Alzheimer's an… [+3129 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "ANI", "title": "Allocation of COVID-19 vaccines to States/UTs done in completely transparent manner, says Centre - Yahoo India News", "description": "New Delhi [India], June 24 (ANI): The allocation of COVID-19 vaccines to States and Union territories has been done in a completely transparent manner, the...", "url": "https://in.news.yahoo.com/allocation-covid-19-vaccines-states-103446964.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/t_bomxIGkiLP8YJD0TMxjA--~B/aD00NTA7dz02MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/aniin.com/1973354cf789a034368365cf226006c4", "publishedAt": "2021-06-24T10:34:46Z", "content": "New Delhi [India], June 24 (ANI): The allocation of COVID-19 vaccines to States and Union territories has been done in a completely transparent manner, the Union Health Ministry said on Thursday.\r\nTh… [+2445 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Groundbreaking roadmap to HIV eradication via stem cell therapy found by research - Times Now", "description": "A recent groundbreaking study found the stem cells' ability to restore immunity and repair gut damage caused by HIV.", "url": "https://www.timesnownews.com/health/article/groundbreaking-roadmap-to-hiv-eradication-via-stem-cell-therapy-found-by-research/775342", "urlToImage": "https://imgk.timesnownews.com/story/iStock-942163364_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-06-24T10:06:57Z", "content": "Washington: In a groundbreaking study, a team of the University of California- Davis Health researchers have uncovered the stem cells' ability to restore immunity and repair gut damage caused by HIV.… [+3750 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sumedha Tripathi", "title": "Here's Everything You Need To Know About Peter Pan Syndrome - India Times", "description": "Recently, a special court in Mumbai granted bail to a 23-year-old accused of sexually assaulting a minor who was 14 years old and romantically involved with the man.  But why did the court do so? During the hearing, the accused mentioned to the court how he h…", "url": "https://www.indiatimes.com/trending/social-relevance/peter-pan-syndrome-explained-543457.html", "urlToImage": "https://im.indiatimes.in/content/2021/Jun/Peter-Pan-Syndrome-1024x552-1_60d43b2f20b57.jpg", "publishedAt": "2021-06-24T08:50:49Z", "content": "Recently, a special court in Mumbai granted bail to a 23-year-old accused of sexually assaulting a minor who was 14 years old and romantically involved with the man.  But why did the court do so? \r\nD… [+2549 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Single dose of Pfizer, AstraZeneca Covid vaccine offers 60 per cent protection: Lancet study - Economic Times", "description": "The protective effect of a single dose of vaccination is evident from 4 weeks to at least 7 weeks after vaccination, which provides some evidence to support extension of the interval between doses beyond three weeks, the researchers said.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/single-dose-of-pfizer-astrazeneca-covid-vaccine-offers-60-per-cent-protection-lancet-study/articleshow/83804988.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83805012,width-1070,height-580,imgsize-35670,overlay-economictimes/photo.jpg", "publishedAt": "2021-06-24T08:38:00Z", "content": "A single dose of or Covid-19 vaccine offers around 60 per cent protection against infection from SARS-CoV-2 in adults aged 65 years and above, according to a study published in The Lancet Infectious … [+3559 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Bharath Manjesh", "title": "India Coronavirus Dispatch: Interest in Ivermectin remains strong - Business Standard", "description": "Tickets issued for Covid violations soar in Delhi, 76% of parents polled in a survey don't want to send kids to schools, and more-news relevant to India's fight against the pandemic", "url": "https://www.business-standard.com/article/current-affairs/india-coronavirus-dispatch-interest-in-ivermectin-remains-strong-121062400730_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-06/23/full/1624412296-791.jpg", "publishedAt": "2021-06-24T08:24:00Z", "content": "Over 54,069 fresh cases reported\r\nIndia reported 54,069 fresh coronavirus infections on Thursday, taking the cumulative caseload to about 30.1 million, according to central health ministry data. The … [+4338 chars]"}, {"source": {"id": null, "name": "Goachronicle.com"}, "author": "GC NewsDesk", "title": "US evaluates Coronavirus vaccinations during pregnancies - National Institutes of Health - Goa Chronicle - Goa Chronicle", "description": "Washington: US medical authorities have launched a new study to evaluate the responses of pregnant women and those who have just delivered their babies to the coronavirus vaccines, the National Instit", "url": "https://goachronicle.com/us-evaluates-coronavirus-vaccinations-during-pregnancies-national-institutes-of-health/", "urlToImage": "https://goachronicle.com/wp-content/uploads/2021/06/US-evaluates-Coronavirus-vaccinations-during-pregnancies-National-Institutes-of-Health.jpg", "publishedAt": "2021-06-24T07:15:28Z", "content": "Washington: US medical authorities have launched a new study to evaluate the responses of pregnant women and those who have just delivered their babies to the coronavirus vaccines, the National Insti… [+850 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Everything you need to know about supplements - Times of India", "description": "Food supplements, as the name suggests are added tablets whose purpose is to provide nutrients to the body that are otherwise lacking due to improper diet.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/everything-you-need-to-know-about-supplements/photostory/83779941.cms", "urlToImage": "https://static.toiimg.com/photo/83779959.cms", "publishedAt": "2021-06-24T07:00:00Z", "content": "Food supplements, as the name suggests are added tablets whose purpose is to provide nutrients to the body that are otherwise lacking due to improper diet. It is important to note that a diet should … [+716 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US begins study on Covid vax during pregnancy, postpartum - Daijiworld.com", "description": "Washington, Jun 24 (IANS): US researchers have started a new observational study to evaluate the immune responses generated by Covid-19 vaccines administered to pregnant or postpartum women, the National Institutes of Health (NIH) announced.\r\nIn its announcem…", "url": "https://daijiworld.com/news/newsDisplay?newsID=846521", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2021-06-24T06:28:06Z", "content": "Washington, Jun 24 (IANS): US researchers have started a new observational study to evaluate the immune responses generated by Covid-19 vaccines administered to pregnant or postpartum women, the Nati… [+1589 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New research: Low-cost method for finding new variants of coronavirus - The Indian Express", "description": "Since the onset of the pandemic, thousands of viral genomes have been sequenced to reconstruct the evolution and global spread of the coronavirus.", "url": "https://indianexpress.com/article/explained/explained-low-cost-method-for-finding-new-variants-of-coronavirus-7372921/", "urlToImage": "https://images.indianexpress.com/2021/06/variant.jpg", "publishedAt": "2021-06-24T06:09:56Z", "content": "Researchers at Karolinska Institutet have developed a technology for cost-effective surveillance of the global spread of new SARS-CoV-2 variants. The technique is presented in the journal Nature Comm… [+1386 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US researchers flag more deadly mutation in Gamma Covid variant - Daijiworld.com", "description": "New York, Jun 24 (IANS): A mutation in the Gamma variant (P1) of coronavirus disease is linked to increased mortality, a Harvard T.H. Chan School of Public Health and MIT researchers said on Wednesday.\r\nThe mutation also carries greater transmissibility, high…", "url": "https://daijiworld.com/news/newsDisplay?newsID=846506", "urlToImage": "https://www.daijiworld.in/images3/asha_24612_gamma.jpg", "publishedAt": "2021-06-24T05:42:35Z", "content": "New York, Jun 24 (IANS): A mutation in the Gamma variant (P1) of coronavirus disease is linked to increased mortality, a Harvard T.H. Chan School of Public Health and MIT researchers said on Wednesda… [+2090 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Dieting impacts a person's energy balance by altering gut microbiome: Study - Hindustan Times", "description": "\"For the first time, we were able to show that a very low-calorie diet produces major changes in the composition of the gut microbiome and that these changes have an impact on the host's energy balance,\" said Prof. Dr Joachim Spranger, one of the study's lead…", "url": "https://www.hindustantimes.com/lifestyle/health/dieting-impacts-a-person-s-energy-balance-by-altering-gut-microbiome-study-101624511233723.html", "urlToImage": "https://images.hindustantimes.com/img/2021/06/24/1600x900/dmitry-dreyer-K4ERT_IYazw-unsplash_1624511425177_1624511441008.jpg", "publishedAt": "2021-06-24T05:11:10Z", "content": "Researchers from Charite -- Universitatsmedizin Berlin and the University of California in San Francisco were able to show for the first time that a very low-calorie diet significantly alters the com… [+5058 chars]"}]}