{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Amid supply crunch, Maharashtra, Rajasthan look to import Covid-19 vaccines - Hindustan Times", "description": "Maharashtra is in talks with RDIF, that helped finance Sputnik V, to purchase vaccine doses.", "url": "https://www.hindustantimes.com/india-news/amid-supply-crunch-maharashtra-rajasthan-look-to-import-covid-19-vaccines-101620604653550.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/09/1600x900/2021-05-07T184748Z_1_LYNXMPEH46160_RTROPTP_3_HEALTH-CORONAVIRUS-BRAZIL-SPUTNIK_1620604711986_1620604726802.JPG", "publishedAt": "2021-05-10T00:01:18Z", "content": "As supplies of Covid-19 vaccines in India face constraints after vaccination was opened to all above 18, the governments of Maharashtra and Rajasthan are planning to import vaccines to meet the gap b… [+3278 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "R Sukumar", "title": "Covid-19: What you need to know today - Hindustan Times", "description": "Delhi was short of tests, medicines, oxygen, hospital beds, and ventilators. People wanted help with remdesivir and plasma. Both were being prescribed indiscriminately by doctors.", "url": "https://www.hindustantimes.com/india-news/covid19what-you-need-to-know-today-101620594650261.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/09/1600x900/7.AFP_9743GX_1617186417528_1620595189160.jpg", "publishedAt": "2021-05-09T21:30:14Z", "content": "Ive mostly worked from office since March 2020, apart from a few weeks last April (and, of course, apart from Wednesdays when I work on the best weekend section across newspapers in India, HT Wknd, a… [+4816 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Kalpana Pathak", "title": "India Inc’s wait to vaccinate staff gets longer - Hindustan Times", "description": "In March, many companies announced immunisation plans for staff and their dependents. But nearly three months on, there is little progress.", "url": "https://www.hindustantimes.com/business/indiaincs-wait-to-vaccinate-staff-gets-longer-101620594132421.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/09/1600x900/Vaccine_1620594167907_1620594174360.jpg", "publishedAt": "2021-05-09T21:04:57Z", "content": "Prashant V, 42, a senior executive with an infrastructure services company in Mumbai, has been spending at least 30 minutes a day on the CoWin portal. So far, his pursuit of a vaccination slot has no… [+2644 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "How genomic surveillance can be an early warning system where coronavirus variants emerge - Japan Today", "description": "Genomic surveillance programs have let scientists track the coronavirus over the course of the pandemic. By testing patient samples, researchers are able to diagnose COVID-19. But they’re also able to use genetic changes in the virus to recreate its travel ro…", "url": "https://japantoday.com/category/features/health/where-coronavirus-variants-emerge-surges-follow-–-new-research-suggests-how-genomic-surveillance-can-be-an-early-warning-system", "urlToImage": null, "publishedAt": "2021-05-09T20:10:00Z", "content": "Genomic surveillance programs have let scientists track the coronavirus over the course of the pandemic. By testing patient samples, researchers are able to diagnose COVID-19. But theyre also able to… [+6716 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Agencies", "title": "US CDC acknowledges Covid is airborne, says virus can spread beyond 6 feet through aerosolised particles - Millennium Post", "description": "Washington: The US Center for Disease Control and Prevention (CDC) reported that the principal mode...", "url": "http://www.millenniumpost.in/big-stories/us-cdc-acknowledges-covid-is-airborne-says-virus-can-spread-beyond-6-feet-through-aerosolised-particles-439727", "urlToImage": "http://www.millenniumpost.in/h-upload/2021/05/09/564311-38528skhdscdp78cyz6wyhg4d15ktmnupbsj9592231.jpg", "publishedAt": "2021-05-09T19:46:51Z", "content": "Washington: The US Center for Disease Control and Prevention (CDC) reported that the principal mode by which people are infected with COVID-19 is through very fine droplets and aerosolised particles … [+2243 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Ivermectin use can end Covid-19 pandemic: Study - Daily Pioneer", "description": "Ivermectin use can end the Covid-19 pandemic as the medicine significantly reduces the risk of contracting the deadly respiratory disease when used regularly, according to a peer-reviewed research published in the American Journal of Therapeutics.\n\nIvermectin…", "url": "https://www.dailypioneer.com/2021/india/ivermectin-use-can-end-covid-19-pandemic--study.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2021-05-09T18:44:26Z", "content": "Ivermectin use can end the Covid-19 pandemic as the medicine significantly reduces the risk of contracting the deadly respiratory disease when used regularly, according to a peer-reviewed research pu… [+2502 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Covid-19: A new study says Ibuprofen safe, doesn't raise death risk - Free Press Journal", "description": "Non-steroidal anti-inflammatory drugs (NSAIDs), such as ibuprofen, is safe and does not lead to higher rates of death or severe disease in patients hospitalised with Covid-19, according to a new observational study of more than 72,000 people in the UK.", "url": "https://www.freepressjournal.in/health/covid-19-a-new-study-says-ibuprofen-safe-doesnt-raise-death-risk", "urlToImage": "https://images.assettype.com/freepressjournal%2F2021-05%2F7765654f-2c25-4305-8fa0-8883555241a9%2Fdrug.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-09T18:39:00Z", "content": "For the study, the team collected data on the medication patients had been prescribed, were currently taking, or had taken within 14 days prior to being admitted to hospital, as well as demographic i… [+408 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Samdani MN", "title": "Lupus patients vulnerable to Covid-19, caution experts - Times of India", "description": "Amaravati: Health experts have urged lupus patients to stay cautious about their health as they are more prone to contracting Covid-19.", "url": "https://timesofindia.indiatimes.com/city/vijayawada/lupus-patients-vulnerable-to-covid-19-caution-experts/articleshow/82505360.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82505359,width-1070,height-580,imgsize-91595,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-09T17:48:00Z", "content": "Lupus patients vulnerable to Covid-19, caution experts"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fungal infections: Mucormycosis, candidiasis, aspergillosis common among Covid patients - The Indian Express", "description": "Doctors are consciously limiting early use of steroids in patients to reduce the chances of secondary infections, and advise patients not to start steroids at home.", "url": "https://indianexpress.com/article/cities/mumbai/fungal-infections-mucormycosis-candidiasis-aspergillosis-common-among-covid-patients-7308667/", "urlToImage": "https://images.indianexpress.com/2021/05/covid-25.jpg", "publishedAt": "2021-05-09T17:47:53Z", "content": "NOT JUST mucormycosis, but other fungal infections such as candidiasis and aspergillosis have become increasingly common among intensive care units and Covid-recovered patients. Doctors are conscious… [+3055 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study reveals smartphone breathalyzer alcohol testing devices vary widely in accuracy - Devdiscourse", "description": "The latest generation of personal alcohol breath testing devices pair with smartphones. While some of these devices were found to be relatively accurate, others may mislead users into thinking that they are fit to drive, according to a new study from the Pere…", "url": "https://www.devdiscourse.com/article/lifestyle/1566506-study-reveals-smartphone-breathalyzer-alcohol-testing-devices-vary-widely-in-accuracy", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/09_05_2021_16_58_52_8165525.jpg?width=920&format=jpeg", "publishedAt": "2021-05-09T16:59:02Z", "content": "The latest generation of personal alcohol breath testing devices pair with smartphones. While some of these devices were found to be relatively accurate, others may mislead users into thinking that t… [+3921 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Issues Advisory To Manage Black Fungus Infection In Covid Patients - NDTV", "description": "Mucormycosis, a fungal infection being found in COVID-19 patients with uncontrolled diabetes and prolonged intensive care unit (ICU) stay, may turn fatal if uncared for, the Centre said on Sunday.", "url": "https://www.ndtv.com/india-news/centre-issues-advisory-to-manage-black-fungus-infection-in-covid-19-patients-2438406", "urlToImage": "https://c.ndtvimg.com/2021-05/d4o138m8_coronavirus-india-afp-650_650x400_06_May_21.jpg", "publishedAt": "2021-05-09T16:49:04Z", "content": "The evidence-based advisory for screening, diagnosis and management of the disease was released by ICMR\r\nNew Delhi: Mucormycosis, a fungal infection being found in COVID-19 patients with uncontrolled… [+2293 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "World News | As India's Covid Cases Surge, Bangladesh Lacks Jabs, Faces Virus Variants - LatestLY", "description": "Get latest articles and stories on World at LatestLY.   India's surge in coronavirus cases is having a serious effect on neighbouring Bangladesh, with health experts warning of imminent vaccine shortages just as the country should be stepping up jabs and as m…", "url": "https://www.latestly.com/agency-news/world-news-as-indias-covid-cases-surge-bangladesh-lacks-jabs-faces-virus-variants-2470612.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg", "publishedAt": "2021-05-09T16:46:08Z", "content": "Dhaka, May 9 (AP) India's surge in coronavirus cases is having a serious effect on neighbouring Bangladesh, with health experts warning of imminent vaccine shortages just as the country should be ste… [+3283 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sruthijith KK", "title": "Indian biotech startup reports early cancer detection breakthrough - Mint", "description": "A team of Indian scientists says it has achieved a stunning breakthrough in early cancer diagnosis with a discovery rooted in a contentious segment of cellular biology that, if validated by additional trials, holds vast market potential in a branch of therape…", "url": "https://www.livemint.com/science/health/biotech-startup-reports-early-cancer-detection-breakthrough-11620326077485.html", "urlToImage": "https://images.livemint.com/img/2021/05/06/600x338/8cc64c7e-ae4b-11eb-a936-0e5204611abd_1620326076776_1620327129579.jpg", "publishedAt": "2021-05-09T15:27:07Z", "content": "A team of Indian scientists says it has achieved a stunning breakthrough in early cancer diagnosis with a discovery rooted in a contentious segment of cellular biology that, if validated by additiona… [+13723 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Covid-19 jabs wont raise immunity in organ transplant patients: Study - Business Standard", "description": "Patients, who had organ transplants, remain vulnerable to Covid-19 infections even after a second vaccine dose, finds a study", "url": "https://www.business-standard.com/article/current-affairs/covid-19-jabs-won-t-raise-immunity-in-organ-transplant-patients-study-121050900615_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/22/full/1619063894-9039.jpg", "publishedAt": "2021-05-09T14:38:00Z", "content": "Patients, who had organ transplants, remain vulnerable to Covid-19 infections even after a second vaccine dose, finds a study that urges people who are immunocompromised to strictly adhere to wearing… [+3425 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Does COVID trigger heart attacks? Top cardiologist has all your doubts cleared - The Federal", "description": "The deadly second, according to Trehan, is fatally affecting young people as low as 33 years old with no earlier signs of heart disease.", "url": "https://thefederal.com/news/does-covid-trigger-heart-attacks-top-cardiologist-explains/", "urlToImage": "https://thefederal.com/file/2020/11/COVID-19.png", "publishedAt": "2021-05-09T14:13:39Z", "content": "After a hectic day at the office, Dinesh Acharya,  just 25, took a shower,  had supper, and hit the bed by 11 pm. At 3 am, he woke up with breathing trouble and was rushed to a Mumbai hospital where … [+3988 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "India TV News Desk", "title": "Will there be a third wave of coronavirus? AIIMS Director Dr. Randeep Guleria answers | Exclusive - India TV News", "description": "AIIMS Director Dr. Randeep Guleria on Sunday said that any epidemic usually make its impact in three waves out of which it is believed that the second wave proves to be the most dangerous one.", "url": "https://www.indiatvnews.com/news/india/will-there-be-a-third-wave-of-coronavirus-aiims-director-dr-randeep-guleria-latest-news-703530", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/05/randeep-guleria-rep2-1620564017.jpg", "publishedAt": "2021-05-09T12:52:50Z", "content": "Image Source : FILE PHOTOIt is believed that every endemic has three waves, says AIIMS Director Randeep Guleria.\r\nAIIMS Director Dr. Randeep Guleria on Sunday said that any epidemic usually make its … [+2072 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "COVID-19 patients are at risk of developing blood clots: Experts - Times Now", "description": "With COVID-19 cases spiking across the country, a common complication that recently started gaining prominence is thrombosis, commonly known as clotting of blood.", "url": "https://www.timesnownews.com/health/article/covid-19-patients-are-at-risk-of-developing-blood-clots-experts/754559", "urlToImage": "https://imgk.timesnownews.com/story/covidtestpti1_1.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-09T12:00:01Z", "content": "<ul><li>Thrombosis is commonly known as blood clot and can be of different types</li></ul>\r\n<ul><li>Thrombosis is one of the complications arising among COVID-19 patients</li></ul>\r\n<ul><li>Here is w… [+2615 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "CDC limits reviews of vaccinated individuals infected with Covid-19, spurring concerns - Hindustan Times", "description": "At the start of May, the CDC shifted from monitoring all cases reported to be infected after being vaccinated to only those that result in hospitalisation or death", "url": "https://www.hindustantimes.com/world-news/cdc-limits-reviews-of-vaccinated-individuals-infected-with-covid-19-spurring-concerns-101620558894009.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/09/1600x900/369262709_0-5_1620560205418_1620560224356.jpg", "publishedAt": "2021-05-09T11:38:32Z", "content": "Federal health officials this month decided to limit how they monitor vaccinated people who have been infected with Covid-19, drawing concern from some scientists who say that may mean missing needed… [+7494 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Simantini Dey", "title": "Ask The Doctor: How to Cope With Self-Isolation Claustrophobia, Covid-19 Induced Insomnia - News18", "description": "In this week’s column, Dr Dinakaran, D MBBS, MD Assistant professor of Psychiatry at National Institute of Mental Health and Neurosciences (NIMHANS), has replied to the queries.", "url": "https://www.news18.com/news/buzz/ask-the-doctor-how-to-cope-with-self-isolation-claustrophobia-covid-19-induced-insomnia-3721127.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1620560207_doctor.jpeg", "publishedAt": "2021-05-09T11:38:31Z", "content": "A year after the Coronavirus pandemic wrecked our collective lives, our society has been grappling with fear and insecurity. As a result, we have seen misinformation spread like wildfire, and many re… [+7638 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Elaine Chen", "title": "CDC Limits Reviews of Vaccinated but Infected, Spurring Concerns - BloombergQuint", "description": "CDC Limits Reviews of Vaccinated but Infected, Spurring Concerns", "url": "https://www.bloombergquint.com/business/cdc-limits-reviews-of-vaccinated-but-infected-spurring-concerns", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-09T11:07:14Z", "content": "(Bloomberg) --\r\nFederal health officials this month decided to limit how they monitor vaccinated people who have been infected with Covid-19, drawing concern from some scientists who say that may mea… [+7824 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Depression is more common in obese teen boys, bullied teenagers of all genders: Study - EdexLive", "description": "In the study young people, born in Vastmanland County, replied to questions about their height, weight and depressive symptoms on three separate occasions", "url": "https://www.edexlive.com/news/2021/may/09/depression-is-more-common-in-obese-teen-boys-bullied-teenagers-of-all-genders-study-20475.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/1/23/w600X390/Depression-2-Express-Illustrations.jpg", "publishedAt": "2021-05-09T11:01:00Z", "content": "Depressive symptoms are more common in teenage girls than in their male peers. However, boys' mental health appears to be affected more if they suffer from obesity. Irrespective of gender, bullying i… [+4138 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Why is treatment of COVID-19 patients challenging? Find your answer here - Times Now", "description": "Even after recovering, previous COVID-19 patients suffer from health complications. This poses a challenge to the healthcare experts as well as cause obstructions to leading a healthy life.", "url": "https://www.timesnownews.com/health/article/why-is-treatment-of-covid-19-patients-challenging-find-your-answer-here/754764", "urlToImage": "https://imgk.timesnownews.com/story/corona-5401250_1920.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-09T11:00:01Z", "content": "<ul><li>COVID-19 highly affects the respiratory system of patients </li></ul>\r\n<ul><li>India currently has about 37,36,648 active cases </li></ul>\r\n<ul><li>Recent study suggests why recovered COVID p… [+2963 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Vegetarians have healthier levels of disease markers than meat-eaters: Study - Times Now", "description": "A recent study conducted at the University of Glasgow shows the impact of a vegetarian diet on health markers as compared to a non-vegetarian diet.", "url": "https://www.timesnownews.com/health/article/vegetarians-have-healthier-levels-of-disease-markers-than-meat-eaters-study/754779", "urlToImage": "https://imgk.timesnownews.com/story/salad-2756467_1920_2.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-09T10:00:01Z", "content": "London: Vegetarians appear to have a healthier biomarker profile than meat-eaters, and this applies to adults of any age and weight, and is also unaffected by smoking and alcohol consumption, accordi… [+3542 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study unveils how proteins control information processing in brain - ANI News", "description": "Halle [Germany], May 9 (ANI): A complicated interaction between different proteins is needed for information to pass from one nerve cell to the next. A team of researchers now managed to study this process in the synaptic vesicles, which play an important rol…", "url": "https://www.aninews.in/news/science/study-unveils-how-proteins-control-information-processing-in-brain20210509152856", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/dhsajdhjhdssdjsadjashdjashdasd_uMetomJ_3r4NRjM-thumbnail-154x87-70.jpg", "publishedAt": "2021-05-09T09:59:00Z", "content": "Halle [Germany], May 9 (ANI): A complicated interaction between different proteins is needed for information to pass from one nerve cell to the next. A team of researchers now managed to study this p… [+2055 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Dr. Geeta Dharmatti", "title": "Mother's Day 2021: 5 Diet Tips For Working Mothers That May Help Meet Nutrient Requirements - Doctor NDTV", "description": "Mother's Day 2021: Working mothers often find it hard to manage time. This results in intake of a poor diet. Here are some tips for working mothers that can help consume a healthy diet.", "url": "https://doctor.ndtv.com/living-healthy/mothers-day-2021-5-diet-tips-for-working-mothers-that-may-help-meet-nutrient-requirements-2438210", "urlToImage": "https://c.ndtvimg.com/2020-07/39rj53t8_working-mom-650_650x400_06_July_20.jpg", "publishedAt": "2021-05-09T09:47:54Z", "content": "When the world is struggling with illness, recovery and healing, changing eating habits to boost one's immunity is the key to good health. There is a great need to work on nutrition literacy amongst … [+4631 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mother's Day 2021: 5 Health Tips For Expecting Mothers Amidst The Pandemic - NDTV", "description": "On the occasion of mother's day 2021, Dr Aruna Kalra shares tips for expecting mothers to stay healthy during the ongoing pandemic.", "url": "https://www.ndtv.com/health/mothers-day-2021-5-health-tips-for-expecting-mothers-amidst-the-pandemic-2438180", "urlToImage": "https://c.ndtvimg.com/2020-06/hjn4fpk8_pregnancy-650_650x400_26_June_20.jpg", "publishedAt": "2021-05-09T08:40:05Z", "content": "Mother's Day 2021: Eat a nutritious diet for healthy development of the baby\r\nHighlights\r\n<ul><li>Pregnant women must eat a healthy diet\r\n</li><li>Eat a well balanced meal for optimum nutrition\r\n</li… [+3863 chars]"}, {"source": {"id": null, "name": "http://www.newsgram.com/"}, "author": null, "title": "Covid-19 May Cause Long-Lasting Harm To Heart: Doctors - http://www.newsgram.com/", "description": "Once you spot signs like dizziness, light-headedness, hypertension, vomiting, sweating, and shortness of breath then consult your doctor.", "url": "https://www.newsgram.com/covid-19-may-cause-long-lasting-harm-to-heart-doctors/", "urlToImage": "https://i0.wp.com/www.newsgram.com/wp-content/uploads/2021/05/nurse-3624463_640.jpg", "publishedAt": "2021-05-09T08:36:30Z", "content": "A large number of recovered patients from Covid-19 have encountered heart problems and even patients with existing heart problems have felt its effects. The virus can lead to heart injury, heart fail… [+3176 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Associated Press Television News", "title": "Health workers in Chad lack access to any vaccines - Republic World", "description": "While wealthier nations around the world have stockpiled vaccines for their citizens, many other countries have scrambled to secure enough doses.", "url": "https://www.republicworld.com/world-news/africa/health-workers-in-chad-lack-access-to-any-vaccines.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/9ursom0hvi36fhwn_1620548060.jpeg?tr=f-jpeg", "publishedAt": "2021-05-09T08:18:00Z", "content": "At the small hospital near the desert's edge where Dr. Oumaima Djarma works, there are no debates among staff over which coronavirus vaccine is the best. There is simply no vaccine at all. Not even f… [+1855 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Remdesivir not suitable for all Covid cases: Dr Rahul Gupta - India Education Diary", "description": "Jammu: Professor and Head of Department, Chest Disease, GMC Jammu, Dr Rahul Gupta today cautioned against use of Remdesivir without proper diagnosis, adding that Remdesivir is not to be used in patients who are not on oxygen support or in home", "url": "https://indiaeducationdiary.in/remdesivir-not-suitable-for-all-covid-cases-dr-rahul-gupta/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/43318850520218018433.jpg", "publishedAt": "2021-05-09T07:28:29Z", "content": "Jammu: Professor and Head of Department, Chest Disease, GMC Jammu, Dr Rahul Gupta today cautioned against use of Remdesivir without proper diagnosis, adding that Remdesivir is not to be used in patie… [+1230 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Deepthi Sanjiv", "title": "Asymptomatic cases on the rise in expectant mothers - Times of India", "description": "Doctors are seeing more pregnant women with asymptomatic Covid-19 infections. Dr Vidyashri Kamath, consultant OBG, Woman and Child Centre, KMC Hospita", "url": "https://timesofindia.indiatimes.com/city/mangaluru/asymptomatic-cases-on-the-rise-in-expectant-mothers/articleshow/82494930.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-09T07:20:00Z", "content": "Asymptomatic cases on the rise in expectant mothers"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Covid-19 could cause long-lasting damage to heart: Doctors - Daijiworld.com", "description": "New Delhi, May 9 (IANSlife): A large number of recovered patients from Covid-19 have encountered heart problems and even patients with existing heart problems have felt its affects. The virus can lead to heart injury, heart failure, stroke, and damage to your…", "url": "https://daijiworld.com/news/newsDisplay?newsID=831528", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2021-05-09T07:14:05Z", "content": "New Delhi, May 9 (IANSlife): A large number of recovered patients from Covid-19 have encountered heart problems and even patients with existing heart problems have felt its affects. The virus can lea… [+2959 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Two pandemics clash as doctors find covid spurs diabetes - Livemint", "description": "Among Covid-19’s many ripple effects, the worsening of the global diabetes burden could carry a heavy public-health toll", "url": "https://lifestyle.livemint.com/health/wellness/two-pandemics-clash-as-doctors-find-covid-spurs-diabetes-111620543339003.html", "urlToImage": "https://images.livemint.com/img/2021/05/09/1140x641/diabetes-777001_1920_1620543971635_1620543982033.jpg", "publishedAt": "2021-05-09T07:11:30Z", "content": "(Bloomberg) -- When Ziyad Al-Alys research team told him how often diabetes appeared to strike Covid-19 survivors, he thought the data must be wrong, so he asked his five colleagues to crunch the num… [+7236 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "COVID-appropriate behaviour, vaccination main shields against all mutants, future waves: Experts - Devdiscourse", "description": "Read more about COVID-appropriate behaviour, vaccination main shields against all mutants, future waves: Experts on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1565907-covid-appropriate-behaviour-vaccination-main-shields-against-all-mutants-future-waves-experts", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_01_2021_14_44_10_124902.jpg?width=920&format=jpeg", "publishedAt": "2021-05-09T06:28:16Z", "content": "With the second wave of the COVID-19 pandemic ravaging the country and concerns being raised about a possible third wave, experts caution that the next wave could be less severe if people keep follow… [+5188 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "FACT CHECK: Can you get infected with COVID-19 after vaccination? This is what government says - DNA India", "description": "The vaccine will not allow the virus to further replicate and it will not allow the disease to become more severe.", "url": "https://www.dnaindia.com/india/report-fact-check-can-you-get-infected-with-covid-19-after-vaccination-this-is-what-government-says-2889495", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2021/05/09/973182-971532-960722-960625-covid-vaccination.jpg", "publishedAt": "2021-05-09T05:57:00Z", "content": null}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "COVID-19 in children: Symptoms to look out for and how you can treat it at home - THE WEEK", "description": "There has been a 51% rise in the number of children getting infected in Maharashtra", "url": "https://www.theweek.in/news/health/2021/05/09/covid-19-in-children-symptoms-to-look-out-for-and-how-you-can-treat-it-at-home.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/health/images/2021/5/9/dr-Deepu-Abraham-file.jpg", "publishedAt": "2021-05-09T02:43:01Z", "content": "For much of the COVID-19 pandemic, the disease affected mostly adults. But, as India was engulfed by the second wave of infections, the number of children testing COVID-positive over the last few mon… [+10038 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pune Mirror", "title": "‘COVID treatment tough due to infectious profile’ - Pune Mirror", "description": "Growing evidence that virus infects both upper and lower respiratory tracts, says Lancet review", "url": "https://punemirror.indiatimes.com/others/scitech/covid-treatment-tough-due-to-infectious-profile/articleshow/82482646.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-91886,msid-82482642/82482642.jpg", "publishedAt": "2021-05-09T00:30:00Z", "content": "Growing evidence that virus\r\n infects both upper and lower respiratory tracts, says Lancet\r\n reviewLONDON\r\n As the COVID-19 cases surge globally, especially in India, leaving many of us wondering why… [+2295 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Shilpi Madan", "title": "Locking them up - The New Indian Express", "description": "You are done pumping scalp serums, massaging oil pods on your follicles, and wielding haute tongs to make your hair look glossy and voluminous.", "url": "https://www.newindianexpress.com/magazine/2021/may/09/locking-them-up-2299335.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/5/8/w600X390/lock.JPG", "publishedAt": "2021-05-08T23:30:00Z", "content": "You are done pumping scalp serums, massaging oil pods on your follicles, and wielding haute tongs to make your hair look glossy and voluminous. Try going back to the basics—food. Eat healthy to pour … [+3068 chars]"}, {"source": {"id": null, "name": "Thekashmirimages.com"}, "author": "Images News Netwok", "title": "Remdesivir not suitable for all Covid patients: Experts - Kashmir Images", "description": "Jammu: Professor and Head of Department, Chest Diseases, GMC Jammu, Dr Rahul Gupta today cautioned against use of remdesivir without proper diagnosis, adding th", "url": "https://thekashmirimages.com/2021/05/09/remdesivir-not-suitable-for-all-covid-patients-experts/", "urlToImage": "https://i2.wp.com/thekashmirimages.com/wp-content/uploads/2020/08/Zydus-Cadila-launches-COVID-19-drug-Remdesivir-in-India.jpg?fit=1024%2C683&ssl=1", "publishedAt": "2021-05-08T21:47:35Z", "content": "Added on May 9, 2021 Images News NetwokJammu: Professor and Head of Department, Chest Diseases, GMC Jammu, Dr Rahul Gupta today cautioned against use of remdesivir without proper diagnosis, adding th… [+1292 chars]"}, {"source": {"id": null, "name": "Thenorthlines.com"}, "author": "Northlines", "title": "CD expert cautions against self-medication, Remdesivir not suitable for all Covid cases - The Northlines", "description": "Jammu Tawi, May 08: Professor and Head of Department, Chest Disease, GMC Jammu, Dr Rahul Gupta today cautioned against the use of Remdesivir without proper diagnosis, adding that Remdesivir is not to be used in patients who are not on oxygen support or in hom…", "url": "https://www.thenorthlines.com/cd-expert-cautions-against-self-medication-remdesivir-not-suitable-for-all-covid-cases/", "urlToImage": "https://www.thenorthlines.com/wp-content/uploads/2020/09/Northlines-01.png", "publishedAt": "2021-05-08T20:02:11Z", "content": "Jammu Tawi, May 08: Professor and Head of Department, Chest Disease, GMC Jammu, Dr Rahul Gupta today cautioned against the use of Remdesivir without proper diagnosis, adding that Remdesivir is not to… [+1260 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Thalassemia : Challenges In Covid 19 Pandemic - Daily Excelsior", "description": "Dr Sanjeev Kumar Digra On the occasion of world thalassemia day thought goes to trial tribulations of a person with thalassemia, if those were not enough", "url": "https://www.dailyexcelsior.com/thalassemia-challenges-in-covid-19-pandemic/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2021/05/health.jpg", "publishedAt": "2021-05-08T19:29:49Z", "content": "Dr Sanjeev Kumar DigraOn the occasion of world thalassemia day thought goes to trial tribulations of a person with thalassemia, if those were not enough the current Pandemic has compounded the proble… [+5804 chars]"}, {"source": {"id": null, "name": "Telegraph India"}, "author": "Koustubh Panda", "title": "Shot in the dark - Telegraph India", "description": "The Government And Its Health Administrators Have Bungled The Roll Out Of The Covid Vaccine But It's The Citizenry That Will Have To Play A Huge Role In Controlling The Second Killer Wave", "url": "https://www.telegraphindia.com/india/covid-19-shot-in-the-dark/cid/1814979", "urlToImage": "https://assets.telegraphindia.com/telegraph/2021/May/1620493940_vaccine_pti.jpg", "publishedAt": "2021-05-08T19:01:48Z", "content": "This fight against Covid-19 is admittedly the most unprecedented and unpredictable battle that the human race has ever fought against a common enemy; it is not only invisible but also frustratingly e… [+8844 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhishek Choudhari", "title": "Give me some sunshine: Exposure to sun is vital for good health - Times of India", "description": "Nagpur: While work-from-home, online classes and self-imposed social lockdown has prevented many families from getting exposed to the virus, it has al.", "url": "https://timesofindia.indiatimes.com/city/nagpur/give-me-some-sunshine-exposure-to-sun-is-vital-for-good-health/articleshow/82487909.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82487908,width-1070,height-580,imgsize-67433,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-08T18:55:00Z", "content": "Give me some sunshine: Exposure to sun is vital for good health"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Neha", "title": "Can drinking warm water, taking hot water bath protect you from COVID-19? - The Siasat Daily", "description": "New Delhi: Ever since the outbreak of the COVID-19 pandemic, many people are following home remedies to avoid contracting the disease. The popular remedies are drinking warm water and taking hot water bath. But can they really protect you from COVID-19? On Sa…", "url": "https://www.siasat.com/can-drinking-warm-water-taking-hot-water-bath-protect-you-from-covid-19-2134595/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/05/water.jpg", "publishedAt": "2021-05-08T18:25:00Z", "content": "New Delhi: Ever since the outbreak of the COVID-19 pandemic, many people are following home remedies to avoid contracting the disease. The popular remedies are drinking warm water and taking hot wate… [+1419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Mucormycosis fungal infections up among COVID-19 survivors - Economic Times", "description": "In Maharashtra, at least eight COVID-19 survivors have died due to mucormycosis while 200 others are being treated, said Dr Tatyarao Lahane, who heads the Directorate of Medical Education and Research of the state government.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/fungal-infection-cases-rising-in-2nd-phase-of-pandemic-warn-doctors-in-maharashtra-gujarat/articleshow/82482356.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82482364,width-1070,height-580,imgsize-109577,overlay-economictimes/photo.jpg", "publishedAt": "2021-05-08T14:47:00Z", "content": "Cases of mucormycosis, a serious but rare fungal infection, are on the rise among COVID-19 survivors, causing blindness or other serious issues, health officials in Maharashtra and Gujarat said on Sa… [+3325 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Karthikeyan", "title": "Fungal infection cases rising in 2nd phase of pandemic, warn - DTNEXT", "description": "Cases of mucormycosis, a fungal infection, are rising among COVID-19 survivors, causing blindness or serious illness and even death in some cases, health officials in Maharashtra and Gujarat said on Saturday.", "url": "http://www.dtnext.in/News/TopNews/2021/05/08195450/1292902/Fungal-infection-cases-rising-in-2nd-phase-of-pandemic-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/May/202105081954500839_Fungal-infection-cases-rising-in-2nd-phase-of-pandemic-warn_SECVPF.gif", "publishedAt": "2021-05-08T14:38:04Z", "content": "Cases of mucormycosis, a fungal infection, are rising among COVID-19 survivors, causing blindness or serious illness and even death in some cases, health officials in Maharashtra and Gujarat said on … [+3682 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Covid-induced black fungus cases on rise in Maha, Gujarat: How deadly is it? - Times of India", "description": "India News: At least eight Covid-19 patients have lost vision in one eye due to mucormycosis, a rare and deadly fungal infection which has a mortality rate of ove", "url": "https://timesofindia.indiatimes.com/india/covid-induced-black-fungus-cases-on-rise-in-maha-gujarat-how-deadly-is-it/articleshow/82482209.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82482240,width-1070,height-580,imgsize-162081,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-08T14:33:00Z", "content": "Covid-sparked fungal infection assuming epidemic proportionsTriggered by coronavirus, mucormycosis, which has a mortality rate of over 50% and can lead to blindness, is sweeping through parts of Maha… [+158 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Advances in ovarian cancer treatment & prevention mechanisms can save many women in India - United News of India", "description": "Kolkata, May 8 (UNI) Women-related cancers although being one of the major causes of mortality in India are less spoken about and cared for.", "url": "http://www.uniindia.com/advances-in-ovarian-cancer-treatment-prevention-mechanisms-can-save-many-women-in-india/east/news/2390669.html", "urlToImage": "", "publishedAt": "2021-05-08T14:08:00Z", "content": "Kolkata, May 8 (UNI) Women-related cancers although being one of the major causes of mortality in India are less spoken about and cared for. Cancers such as ovarian cancer especially have a high mort… [+2302 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Blood clots in Covid patients: Top doctor decodes early signs & prevention - Hindustan Times", "description": "As India continues to battle the second wave of coronavirus, top doctor decodes complications related to blood clots in Covid patients. Dr. Ambarish Satwik of Sir Ganga Ram Hospital talks about how different cases of blood clots have been observed in some Cov…", "url": "https://www.hindustantimes.com/videos/shows/blood-clots-in-covid-patients-top-doctor-decodes-early-signs-prevention-101620482436758.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/08/1600x900/HT_In_Focus_-__Normal_thumbclot_1620482474415_1620482481527.jpg", "publishedAt": "2021-05-08T14:01:35Z", "content": "This site and its partners use technology such as cookies to personalize content and ads and analyse traffic. By using this site you agree to its privacy policy\r\n. You can change your mind and revisi… [+35 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Study finds children spread COVID-19 infections faster due to higher 'viral load' - CNBCTV18", "description": "The study found that children spread coronavirus 'more efficiently' compared to adults because they have a high viral load.Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/study-finds-children-spread-covid-19-infections-faster-due-to-higher-viral-load-9235961.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/04/school_children-768x432.jpg", "publishedAt": "2021-05-08T13:41:47Z", "content": "Children spread COVID-19 infections faster than adults as they carry a higher 'viral load’, according to a study published in The Journal of the American Medical Association (JAMA).\r\nThe study found … [+1934 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Wearing your mask right? Top doctor explains how to avoid Covid infection - Hindustan Times", "description": "India is in the midst of a second wave of the Covid-19 pandemic and many experts have already warned of an imminent third wave. Dr. Rommel Tickoo, Director (Internal Medicine) at Max Healthcare and Dr. Ambarish Satwik, vascular and endovascular surgeon at Sir…", "url": "https://www.hindustantimes.com/videos/shows/wearing-your-mask-right-top-doctor-explains-how-to-avoid-covid-infection-101620479497193.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/08/1600x900/HT_In_Focus_-__Normal_thumbmask__1620479518561_1620479522277.jpg", "publishedAt": "2021-05-08T13:12:47Z", "content": null}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Mild Covid very unlikely to cause lasting heart damage: Study - Morung Express", "description": "London, May 8 (IANS) Mild Covid-19 infection is very unlikely to cause lasting damage to the structure or function of the heart, a new study suggests.", "url": "https://www.morungexpress.com/", "urlToImage": "https://www.morungexpress.com/uploads/2021/05/53857034_1620478605_12f709bafe5405783659a93444b4fdc1.jpg", "publishedAt": "2021-05-08T12:57:07Z", "content": "London, May 8 (IANS) Mild Covid-19 infection is very unlikely to cause lasting damage to the structure or function of the heart, a new study suggests.\r\nThe researchers, including Thomas Treibel from … [+1654 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Eat Jaggery Or Ghee With Roti': Government Shares 'Sample Meal Plan' For Covid Patients - NDTV Food", "description": "Government of India's twitter handle recently shared a simple meal plan for patients with COVID 19.", "url": "https://food.ndtv.com/news/eat-jaggery-or-ghee-with-roti-government-shares-sample-meal-plan-for-covid-patients-2437807", "urlToImage": "https://c.ndtvimg.com/2021-01/1925ap0o_ghee-_625x300_27_January_21.jpeg", "publishedAt": "2021-05-08T12:07:46Z", "content": "The nation is tackling with the second wave of the Coronavirus pandemic. The gap between active cases and recovered cases is still very wide, and as per experts we are yet to hit the peak soon. In ot… [+2607 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Black fungus claims eyesight of some COVID-19 survivors in Gujarat - Economic Times", "description": "In Ahmedabad, at least five patients with mucormycosis are being operated upon every day at the civil hospital at Asarva, a senior doctor said.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/black-fungus-claims-eyesight-of-some-covid-19-survivors-in-gujarat/articleshow/82479932.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82479918,width-1070,height-580,imgsize-142473,overlay-economictimes/photo.jpg", "publishedAt": "2021-05-08T11:43:00Z", "content": "Cases of Mucormycosis, a fungal infection, affecting some COVID-19 survivors are on the rise in Gujarat which has left many patients blind, doctors and officials claimed on Saturday.\r\nMathur Savani, … [+2647 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "Is there a connection between your drinking and social networking? Here's what study says - Asianet Newsable ", "description": "A study reported in the journal Health and Place claims that there's a connection between social networking, binge drinking, and your neighbourhood.", "url": "https://newsable.asianetnews.com/gallery/lifestyle/is-there-a-connection-between-your-drinking-and-social-networking-here-s-what-study-says-ank-qssdtf", "urlToImage": "https://static-ai.asianetnews.com/images/01f0x15fpqs9n0bzg82z2464pz/alcohol-affect-and-english-6-jpg_1200x630xt.jpg", "publishedAt": "2021-05-08T11:41:39Z", "content": "First Published May 8, 2021, 5:11 PM IST\r\nA study reported in the journal Health and Place claims that there's a connection between social networking, binge drinking, and your neighbourhood.\r\nAs per … [+1156 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Black fungus claims eyesight of some COVID-19 survivors in Guj - Devdiscourse", "description": "Read more about Black fungus claims eyesight of some COVID-19 survivors in Gujarat on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1565259-black-fungus-claims-eyesight-of-some-covid-19-survivors-in-gujarat", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/21_11_2020_11_10_50_9857215.jpg?width=920&format=jpeg", "publishedAt": "2021-05-08T10:47:00Z", "content": "Cases of Mucormycosis, a fungal infection, affecting some COVID-19 survivors are on the rise in Gujarat which has left many patients blind, doctors and officials claimed on Saturday.\r\nMathur Savani, … [+2766 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Mucormycosis on rise in Covid-19 patients in Ahmedabad, says doctor - Hindustan Times", "description": "Mucormycosis is a rare fungal infection that is found in immunodeficient patients.", "url": "https://www.hindustantimes.com/india-news/mucormycosis-on-rise-in-covid-19-patients-in-ahmedabad-says-doctor-101620468857557.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/08/1600x900/2021-05-05T092857Z_1_LYNXMPEH440GG_RTROPTP_3_HEALTH-CORONAVIRUS-INDIA_1620468986951_1620469012086.JPG", "publishedAt": "2021-05-08T10:20:29Z", "content": "Fungal infection mucormycosis has been on the rise among Covid patients in Ahmedabad for the last 15-20 days, doctors have said. Around 67 patients are being treated for the same in the Ear, Nose and… [+1662 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "ANI", "title": "Study: Mild COVID-19 infection is very unlikely to cause lasting heart damage - Yahoo India News", "description": "London [UK], May 8 (ANI): Mild Covid-19 infection is very unlikely to cause lasting damage to the structure or function of the heart, according to a study.", "url": "https://in.style.yahoo.com/study-mild-covid-19-infection-095926404.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/GsLg9f1U2vtdb1KsLgBlOg--~B/aD00NTA7dz02MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/aniin.com/965b6d8461aab929316590bef228f041", "publishedAt": "2021-05-08T09:59:26Z", "content": "London [UK], May 8 (ANI): Mild Covid-19 infection is very unlikely to cause lasting damage to the structure or function of the heart, according to a study.\r\nThe study was led by UCL (University Colle… [+3881 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Here is why the US decision to back TRIPS waiver for COVID-19 vaccines is crucial - Moneycontrol.com", "description": "The US has been non-committal about India’s move to get Trade-Related Aspects of Intellectual Property Rights (TRIPS) waiver to COVID-19 vaccines at WTO. Now it has decided to offer its support to the proposal.", "url": "https://www.moneycontrol.com/news/photos/world/explained-here-is-why-us-decision-to-back-trips-waiver-for-covid-19-vaccines-is-crucial-6869321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/6-trips-agreement-770x433.jpg", "publishedAt": "2021-05-08T09:44:11Z", "content": null}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Samarpita Yashaswini", "title": "Know the dietary advisory shared by the Centre for COVID 19 patients - PINKVILLA", "description": "The Centre recently suggested a list of food items that should be included in the dietary plan of a person suffering from COVID-19 and that aid in boosting immunity. Read on to know the diet plan and the immunity-boosting food items.", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/know-dietary-advisory-shared-centre-covid-19-patients-729512", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/dietary_advisory_shared_by_the_centre_for_covid_19_patients_social.jpg?itok=bjyY4uoV", "publishedAt": "2021-05-08T07:08:39Z", "content": null}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "OneIndia Correspondent", "title": "COVID-19 related black fungal infections adds chaos amidst a pandemic - Oneindia", "description": "Doctors at a leading private facility in Delhi are witnessing a rise in the number of Covid-triggered mucormycisis cases, according to a statement from the hospital.Mucormycisis is a fungal infection triggered by COVID-19. Black fungus or mucormycosis has bee…", "url": "https://www.oneindia.com/india/covid-19-related-black-fungal-infections-adds-chaos-amidst-a-pandemic-3256381.html", "urlToImage": "https://www.oneindia.com/img/1200x80/2021/05/fungal-infections-1620455439.jpg", "publishedAt": "2021-05-08T06:32:16Z", "content": "New Delhi, May 08: Doctors at a leading private facility in Delhi are witnessing a rise in the number of Covid-triggered mucormycisis cases, according to a statement from the hospital.\r\nMucormycisis … [+3185 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Centre directs social media platforms to curb COVID-19 misinformation in new advisory - Moneycontrol", "description": "Social media platforms have been told to take immediate action to disable or remove content spreading misinformation related to the COVID-19 pandemic.", "url": "https://www.moneycontrol.com/news/technology/centre-directs-social-media-platforms-to-curb-covid-19-misinformation-in-new-advisory-6868121.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/social-media_shutterstock_1573945981-770x433.jpg", "publishedAt": "2021-05-08T05:05:49Z", "content": "Amid surge in COVID-19 cases, the government has directed social media platforms to keep misinformation in check.\r\nThe Centre on May 7 sent an advisory to social media platforms, including Facebook, … [+1345 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "'Unique infectious profile' makes Covid so hard to treat: Lancet - IANS", "description": "According to the review, there is growing evidence that the virus infects both the upper and lower respiratory tracts.The", "url": "http://www.ianslive.in/index.php?param=news/Unique_infectious_profile_makes_Covid_so_hard_to_treat_Lancet-783126/SCI-TECH+and+HEALTH/36", "urlToImage": "http://ianslive.in/upload/2021/May/08/r-1620448758202105081009182313_l.jpg", "publishedAt": "2021-05-08T04:53:36Z", "content": "Photo Credit: IANS\r\nIANSLive\r\nLondon, May 8 (IANS) As the Covid-19 cases surge globally, especially in India, leaving many of us wonder why it is so hard to treat, a review published in the prestigio… [+402 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shivi Kataria", "title": "Novel drug targeting amyloid plaques offers tentative hope for Alzheimers patients, NEJM study - Medical Dialogues", "description": "A hallmark of Alzheimers disease is the accumulation of amyloid-β (Aβ) peptide. Donanemab, an...", "url": "https://medicaldialogues.in/psychiatry/news/novel-drug-targeting-amyloid-plaques-offers-tentative-hope-for-alzheimers-patients-nejm-study-77365", "urlToImage": "https://medicaldialogues.in/h-upload/2021/05/07/152457-ad.jpg", "publishedAt": "2021-05-08T04:00:48Z", "content": "A hallmark of Alzheimer's disease is the accumulation of amyloid- (A) peptide. Donanemab, an antibody that targets a modified form of deposited A was evaluated in the recently published TRAILBLAZER-A… [+2595 chars]"}, {"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "The COVID‐19 Menace - Walczak - - Global Challenges - Wiley", "description": "The enormously contagious severe acute respiratory syndrome coronavirus 2 has rapidly spread worldwide. The virus has acquired a new proteolytic site for a ubiquitous furin protease, as well as new b...", "url": "https://onlinelibrary.wiley.com/doi/10.1002/gch2.202100004", "urlToImage": "https://onlinelibrary.wiley.com/cms/asset/70f66df2-2a25-416a-a11d-f819505cef55/gch2202100004-gra-0001-m.jpg", "publishedAt": "2021-05-08T03:08:18Z", "content": "1 Introduction\r\nThe pandemic of the century has just swept the world unawares and turned 2020 into a nightmare. The rapid spread and high potency of the severe acute respiratory syndrome coronavirus … [+66564 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Explained: Cleared for India, antibody cocktail Trump used - The Indian Express", "description": "Former US President Donald Trump had taken the drug when he contracted Covid-19 in October last year.", "url": "https://indianexpress.com/article/explained/explained-cleared-for-india-antibody-cocktail-trump-used-7306415/", "urlToImage": "https://images.indianexpress.com/2021/05/660_060521095039.jpg", "publishedAt": "2021-05-08T01:32:48Z", "content": "An investigational antibody cocktail, from Switzerland-based drug-maker Roche, has got approval from Indias Central Drugs Standards Control Organisation (CDSCO) for use in emergency situations for tr… [+3003 chars]"}]}