{"status": "ok", "totalResults": 43, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News18", "title": "At 3.5 Mn, India Has Highest Number of Children Who Have Received No Vaccines: UNICEF - News18", "description": "India has the highest number of under-vaccinated or unvaccinated children worldwide at 3.", "url": "https://www.news18.com/news/india/at-3-5-mn-india-has-highest-number-of-children-who-have-received-no-vaccines-unicef-3966974.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/07/1626351611_children-vaccine1.jpg", "publishedAt": "2021-07-15T12:20:44Z", "content": "India has the highest number of under-vaccinated or unvaccinated children worldwide at 3.5 million, an increase of 1.4 million from 2019, amid the COVID-19 pandemic outbreak, the UNICEF said. It also… [+2807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Long Covid Has More Than 200 Symptoms, Study Finds - NDTV", "description": "Patients who experience long COVID report more than 200 symptoms across 10 organ systems, according to the largest global study to date of ''long-haulers'' published on Thursday.", "url": "https://www.ndtv.com/world-news/long-covid-has-more-than-200-symptoms-study-finds-2487364", "urlToImage": "https://c.ndtvimg.com/2021-06/3edhl1f4_coronavirus-generic_625x300_17_June_21.jpg", "publishedAt": "2021-07-15T11:28:09Z", "content": "Survey was open to those aged 18 or over who had experienced symptoms consistent with Covid\r\nLondon: Patients who experience long COVID report more than 200 symptoms across 10 organ systems, accordin… [+4070 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Explained: What are the Kappa and Lambda variants of Covid-19? Should you be concerned? - mid-day.com", "description": "Two variants of the coronavirus disease have recently come into focus as cases emerge around the world and in India. Mumbai-based experts unpack how these new ‘variants of interest’ differ from previously-known variants", "url": "https://www.mid-day.com/lifestyle/health-&-fitness/article/explained-what-are-the-kappa-and-lambda-variants-of-covid-19-should-you-be-concerned-23183018", "urlToImage": "https://images.mid-day.com/images/images/2021/jul/lambdakappa_d.jpg", "publishedAt": "2021-07-15T11:24:00Z", "content": null}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Heart Inflammation Caused by COVID-19 in Children May Resolve Rapidly in Months: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "MIS-C is a rare condition that causes widespread inflammation throughout the body. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2021-07-15-heart-inflammation-caused-by-covid-in-children", "urlToImage": "https://s.w-x.co/in-heart_0.jpg", "publishedAt": "2021-07-15T11:22:23Z", "content": "Heart problems in children, who were hospitalised with the multisystem inflammatory syndrome (MIS-C)an inflammatory condition triggered by COVID-19lasted just a few months and resolved rapidly, sugge… [+2310 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Reduction in mortality, ICU stay and treatment cost among vaccinated patients, reveals study - CNBCTV18", "description": "A retrospective cohort study on the impact of vaccination among Covid-19 patients by Star Health and Allied Insurance unveiled the significant impacts of vaccination among individuals 45 years and above.", "url": "https://www.cnbctv18.com/finance/reduction-in-mortality-icu-stay-and-treatment-cost-among-vaccinated-patients-reveals-study-9998201.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/05/Covid9-1019x573.jpg", "publishedAt": "2021-07-15T11:06:00Z", "content": "MiniA retrospective cohort study on the impact of vaccination among Covid-19 patients by Star Health and Allied Insurance unveiled the significant impacts of vaccination among individuals 45 years an… [+7 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/steve-dent", "title": "Severely paralyzed man communicates using brain signals sent to his vocal tract - Engadget", "description": "A severely paralyzed man communicated using a system that translates signals from his brain to his vocal tract directly into words that appear on a screen..", "url": "https://www.engadget.com/severely-paralyzed-man-communicates-using-brain-signals-sent-to-his-vocal-tract-110524126.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-07/ae215810-e54f-11eb-b333-df8fd83ee8ec", "publishedAt": "2021-07-15T11:03:45Z", "content": "A severely paralyzed man has been able to communicate using a new type of technology that translates signals from his brain to his vocal tract directly into words that appear on a screen. Developed b… [+2794 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Did COVID-19 impact our mental health like we think it did? - Times of India", "description": "The pandemic brought along a wave of challenges which took a massive toll on our physical and psychological well-being. The onset of the deadly coronavirus initiated discussions around mental health issues that were often brushed off in the pre-COVID era. Fro…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/coronavirus-did-covid-19-impact-our-mental-health-like-we-think-it-did/photostory/84436732.cms", "urlToImage": "https://static.toiimg.com/photo/84436746.cms", "publishedAt": "2021-07-15T10:30:00Z", "content": "As time went by, according to the researchers, average levels of depression, anxiety, and distress began to fall. They suggested that as per certain data, \"overall psychological distress returned to … [+964 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Leech Therapy: All you need to know about this ayurvedic pain management technique - Times of India", "description": "Did you know that leeches - the parasitic worms belonging to the Hirudinea subclass, have been used in medicine to treat nervous system anomalies, dental difficulties, skin illnesses, and infections since ancient times? Not only that but modern medical scienc…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/home-remedies/leech-therapy-all-you-need-to-know-about-this-ayurvedic-pain-management-technique/photostory/84437080.cms", "urlToImage": "https://static.toiimg.com/photo/84437243.cms", "publishedAt": "2021-07-15T09:30:00Z", "content": "Leech therapy is not recommended for people who have autoimmune disorders, anaemia, blood clotting problems, or have arteries that are damaged. It is also generally advised that children under the ag… [+316 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Treatment with blood thinners may reduce death in COVID patients - Ahmedabad Mirror", "description": "#TORONTO\nAdministering a full dose of a standard blood thinner early to moderately ill hospitalised patients with COVID-19 could halt the formation of blood clots and reduce the risk of severe disease and death, finds a study.\nCOVID -19 is marked by heightene…", "url": "https://ahmedabadmirror.com/treatment-with-blood-thinners-may-reduce-death-in-covid-patients/81803210.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1626291319932.jpg-org", "publishedAt": "2021-07-15T09:06:36Z", "content": "<ul><li>Agencies</li><li> 15-07-2021 02:15 PM</li></ul>\r\n#TORONTOAdministering a full dose of a standard blood thinner early to moderately ill hospitalised patients with COVID-19 could halt the forma… [+1993 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Think Before You Pour Your Next Glass! Lancet Study Says 62,100 New Cancer Cases In India Due To Alcohol - News18", "description": "Alcohol consumption was associated with 62,100 or five per cent of newly diagnosed cancer cases last year in India, according to a study published in The Lancet Oncology journal which shows alcohol use is on the rise in the country.", "url": "https://www.news18.com/news/lifestyle/think-before-you-pour-your-next-glass-lancet-study-says-62100-new-cancer-cases-in-india-due-to-alcohol-3965954.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/07/1626338606_alcoholconsumption01.png", "publishedAt": "2021-07-15T08:46:00Z", "content": "Alcohol consumption was associated with 62,100 or five per cent of newly diagnosed cancer cases last year in India, according to a study published in The Lancet Oncology journal which shows alcohol u… [+4390 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Mild Zika virus cases likely present since April in Kerala, claim doctors - Hindustan Times", "description": "The state's case tally currently stands at 28, health minister Veena George informed on Thursday, including five new cases. | Latest News India", "url": "https://www.hindustantimes.com/india-news/mild-zika-virus-cases-likely-present-since-april-in-kerala-claim-doctors-101626333809853.html", "urlToImage": "https://images.hindustantimes.com/img/2021/07/15/1600x900/research-scientist-protein-galperin-sciences-working-developing_9656ccae-d843-11e8-b06f-edb2612a0442_1626334940198.jpg", "publishedAt": "2021-07-15T07:43:25Z", "content": "Doctors at a hospital in Kerala have claimed that it is likely that there have been mild cases of the Zika virus in the state since April this year, as the patients were not getting tested due to ris… [+1678 chars]"}, {"source": {"id": null, "name": "Reportdoor.com"}, "author": null, "title": "Will COVID-19 vaccines work if I have a weak immune system? - Report Door", "description": "Will COVID-19 vaccines work if I have a weak immune system?Probably not as well as they do in healthy people, but the shots should offer some", "url": "https://www.reportdoor.com/will-covid-19-vaccines-work-if-i-have-a-weak-immune-system/", "urlToImage": null, "publishedAt": "2021-07-15T06:38:44Z", "content": "Will COVID-19 vaccines work if I have a weak immune system?\r\nProbably not as well as they do in healthy people, but the shots should offer some protection.\r\nIts why vaccinations are still recommended… [+2100 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Antidepressants might benefit individuals with depression, diabetes: Study - Hindustan Times", "description": "A new study suggests that people with diabetes and depression who take antidepressants might face a lower risk of serious diabetes complications and death. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/antidepressants-might-benefit-individuals-with-depression-diabetes-study-101626329971117.html", "urlToImage": "https://images.hindustantimes.com/img/2021/07/15/1600x900/adam-niescioruk-ROQz4eE2kzs-unsplash_1626330178180_1626330507681.jpg", "publishedAt": "2021-07-15T06:27:24Z", "content": "The findings of a new study suggest that people with diabetes and depression who take antidepressants might face a lower risk of serious diabetes complications and death.\r\nThe findings were published… [+1484 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Short chain fatty acids have potential therapeutic applications against COVID-19, study suggests - News-Medical.Net", "description": "SARS-CoV-2, the virus responsible for the COVID-19 pandemic, is highly transmissible, with nasal passages being the target of original infection.", "url": "https://www.news-medical.net/news/20210715/Short-chain-fatty-acids-have-potential-therapeutic-applications-against-COVID-19-study-suggests.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/SARS-620x480.jpg", "publishedAt": "2021-07-15T05:43:00Z", "content": "SARS-CoV-2, the virus responsible for the COVID-19 pandemic, is highly transmissible, with nasal passages being the target of original infection. The nasal passage also shows the highest expression o… [+3653 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Pfizer, Johnson and Johnson yet to apply for a license of COVID19 vaccines in India - Times Now", "description": "Pfizer, Johnson and Johnson are yet to apply for a license of COVID19 vaccines in India, news agency ANI reports citing sources.", "url": "https://www.timesnownews.com/india/article/pfizer-johnson-and-johnson-yet-to-apply-for-a-license-of-covid19-vaccines-in-india/785248", "urlToImage": "https://imgk.timesnownews.com/story/pfizercovidvaccine_4.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-07-15T05:12:00Z", "content": "New Delhi: Pfizer, Johnson and Johnson are yet to apply for a license of COVID19 vaccines in India, news agency ANI reports citing sources. The report comes a day after the US said that it is waiting… [+1323 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": null, "title": "No, we can’t treat COVID-19 like the flu. Here’s why - EastMojo", "description": "Perth (Australia): Earlier this month, the Australian government announced a four-phase plan to return us to something resembling normality. Under this", "url": "https://www.eastmojo.com/coronavirus-updates/2021/07/15/no-we-cant-treat-covid-19-like-the-flu-heres-why/", "urlToImage": "https://i1.wp.com/www.eastmojo.com/wp-content/uploads/2021/06/covid-19-5040857_1280.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2021-07-15T04:30:00Z", "content": "Perth (Australia): Earlier this month, the Australian government announced a four-phase plan to return us to something resembling normality. Under this plan, Prime Minister Scott Morrison said, we wi… [+5410 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Neurological disorders contribute 10% of the total disease burden in India: Study - ETHealthworld.com", "description": "The contribution of non-communicable neurological disorders and neurological injuries to the total disease burden has more than doubled in last 29 years", "url": "https://health.economictimes.indiatimes.com/news/policy/neurological-disorders-contribute-10-of-the-total-disease-burden-in-india-study/84431008", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-84431008,imgsize-109891,width-800,height-434,overlay-ethealthworld/neurological-disorders-contribute-10-of-the-total-disease-burden-in-india-study.jpg", "publishedAt": "2021-07-15T04:20:00Z", "content": "New Delhi: The India State-Level Disease Burden Initiative published a study in The Lancet Global Health, which is a first comprehensive estimate of disease burden due to neurological disorders and t… [+2177 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": null, "title": "Misinformation spikes Google searches on infertility, Covid jabs - OrissaPOST", "description": "New York: Google searches related to infertility and coronavirus vaccines increased by 34,900 per cent after two physicians submitted a petition to the European Medicines Agency (EMA) questioning the safety and efficacy data of the Covid-19 Pfizer vaccine. Wh…", "url": "https://www.orissapost.com/misinformation-spikes-google-searches-on-infertility-covid-jabs/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2020/10/Google-search.jpg", "publishedAt": "2021-07-15T02:30:42Z", "content": "New York: Google searches related to infertility and coronavirus vaccines increased by 34,900 per cent after two physicians submitted a petition to the European Medicines Agency (EMA) questioning the… [+2153 chars]"}, {"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "A case of severe autoimmune hemolytic anemia after a receipt of a first dose of SARS‐CoV‐2 vaccine - Wiley", "description": "SARS-CoV-2 mRNA vaccine made by Pfizer and BioNTech was approved by the U.S. Food and Drug Administration for use under an Emergency Use Authorization for active immunization to prevent coronavirus d...", "url": "https://onlinelibrary.wiley.com/doi/10.1111/ijlh.13653", "urlToImage": "https://onlinelibrary.wiley.com/cms/asset/29a006b7-09d3-4b0a-accd-91b9ebdf2ba0/ijlh.v43.3.cover.jpg", "publishedAt": "2021-07-15T02:10:19Z", "content": "Corresponding Author\r\nMercy Hospital, Allina Health, 4050 Coon Rapids Blvd NW, 55433 Minneapolis, MN, United States\r\nCorresponding author:\r\nTomas M. Murdych, MD, Mercy Hospital, Allina Health, 4050 C… [+114 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "How does your eating speed affect weight loss? Luke Coutinho explains! - Times of India", "description": "Slow eaters or the people who chew their food well are found to be benefited with improved digestion, skin health, vitality, and even weight loss. Faster eating or mindless binging on the other hand can have a detrimental impact on your overall health and fit…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/how-does-your-eating-speed-affect-weight-loss-luke-coutinho-explains/photostory/84408492.cms", "urlToImage": "https://static.toiimg.com/photo/84408597.cms", "publishedAt": "2021-07-15T01:30:00Z", "content": "Luke Coutinho explained that when we chew our food well, we directly improve the nutrient absorption in our body as the digestion process begins from the mouth itself. The salivary amylase and other … [+339 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "DR SARANYA NARAYAN", "title": "Rain risks - The New Indian Express", "description": "This monsoon take care to avoid the chance of getting a co-infection with Covid-19 and malaria or dengue", "url": "https://www.newindianexpress.com/cities/bengaluru/2021/jul/15/rain-risks-2330160.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/7/15/w600X390/RAIN_RISKS.jpg", "publishedAt": "2021-07-15T01:10:00Z", "content": "BENGALURU: Monsoon  quenches the thirst of the land but is also accompanied by tropical, vector-borne diseases like malaria and dengue. With India’s ongoing battle with the pandemic, the onset of pos… [+3075 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Eleanor Hayward", "title": "Healthy adults should take statins even if they don't have heart problems, study says - Daily Mail", "description": "Researchers at Oxford University looked at data from 120,000 patients to establish if those who do not have existing heart disease still benefit from statins as a preventative measure.", "url": "https://www.dailymail.co.uk/health/article-9787609/Healthy-adults-statins-dont-heart-problems-study-says.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/07/14/13/45435771-0-image-a-4_1626265692345.jpg", "publishedAt": "2021-07-14T22:30:49Z", "content": "Healthy adults should take statins even if they don't have heart problems as the benefits are worth the mild side effects, a major study has concluded.\r\nResearchers at Oxford University looked at dat… [+4127 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Heather Hollingsworth", "title": "Dispiriting setback: COVID deaths, cases rise again globally - Associated Press", "description": "COVID-19 deaths and cases are on the rise again globally in a dispiriting setback that is triggering another round of restrictions and dampening hopes for a return to normal life.  The World Health Organization reported Wednesday that deaths climbed last week…", "url": "https://apnews.com/article/joe-biden-health-coronavirus-pandemic-united-nations-c866c330751256f34a7c32a1e631b67e", "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7afc5b0e73e41a498d11987b1d4c97e/3000.jpeg", "publishedAt": "2021-07-14T19:01:52Z", "content": "COVID-19 deaths and cases are on the rise again globally in a dispiriting setback that is triggering another round of restrictions and dampening hopes for a return to normal life. \r\nThe World Health … [+5816 chars]"}, {"source": {"id": null, "name": "KCRW"}, "author": "https://www.facebook.com/kcrw", "title": "More than 1000 COVID cases emerge in LA for fifth straight day. It's the first major spike since March - KCRW", "description": "On Tuesday, for the fifth day in a row, LA County reported more than 1,000 new COVID-19 cases. The county hasn’t seen these numbers since early March, when the fall/winter surge was easing.", "url": "https://www.kcrw.com/news/shows/press-play-with-madeleine-brand/coronavirus-pollution-economy-morgan-neville-animals/variants-1000-cases-johnson-boosters", "urlToImage": "https://www.kcrw.com/news/shows/press-play-with-madeleine-brand/coronavirus-pollution-economy-morgan-neville-animals/variants-1000-cases-johnson-boosters/@@images/rectangular_image/page-header?v=1626313740.74", "publishedAt": "2021-07-14T19:00:00Z", "content": "On Tuesday, for the fifth day in a row, LA County reported more than 1,000 new COVID-19 cases. The county hasnt seen these numbers since early March, when the fall/winter surge was easing. Hospitaliz… [+319 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Blood thinner may reduce death risk in moderately ill COVID-19 patients: Study - India Today", "description": "A study has said administering a full dose of a standard blood thinner early to moderately ill hospitalised patients with Covid-19 could reduce the risk of severe disease and death.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/blood-thinner-may-reduce-death-risk-in-moderately-ill-covid-19-patients-study-1828256-2021-07-15", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/covid_1_2-647x363.jpeg?wKt1E4JyQq3_ZOKHEyBZIkiHfhhbqQpN", "publishedAt": "2021-07-14T18:43:13Z", "content": null}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "World News | COVID Infections Cross 40,000 Cases in UK First Time Since January - LatestLY", "description": "Get latest articles and stories on World at LatestLY.   Britain has reported 42,302 new coronavirus cases and 49 more deaths in the latest 24-hour period, according to government data on Wednesday.", "url": "https://www.latestly.com/agency-news/world-news-covid-infections-cross-40000-cases-in-uk-first-time-since-january-2641253.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "publishedAt": "2021-07-14T16:56:10Z", "content": "London, Jul 14 (PTI) Britain has reported 42,302 new coronavirus cases and 49 more deaths in the latest 24-hour period, according to government data on Wednesday.\r\n The figures compare with 36,660 CO… [+1955 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Doctors in Bihar remove 82 teeth of teenager with rare tumour - Zee News", "description": "In a rare case of complex tumor named  odontome , Bihar doctors removed more than 80 teeth from a teenage boy in who was suffering from extreme pain. The doctors at IGIMS, Patna removed 82 teeth in an operation that lasted for 3 hours.  He came with complaint…", "url": "https://zeenews.india.com/viral/doctors-in-bihar-remove-82-teeth-of-teenager-with-rare-tumour-2376350.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/07/14/951530-tumor-teeth-bihar.jpg", "publishedAt": "2021-07-14T15:21:36Z", "content": "New Delhi: In a rare case of complex tumor named 'odontome', Bihar doctors removed more than 80 teeth from a teenage boy in who was suffering from extreme pain. The doctors at IGIMS, Patna removed 82… [+891 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "US overdose deaths hit record 93,000 in pandemic last year - Mint", "description": "The nation was already struggling with its worst overdose epidemic but clearly COVID has greatly exacerbated the crisis, experts said.Lockdowns and other pandemic restrictions isolated those with drug addictions and made treatment harder to get, experts added", "url": "https://www.livemint.com/news/world/us-overdose-deaths-hit-record-93-000-in-pandemic-last-year-11626274019107.html", "urlToImage": "https://images.livemint.com/img/2021/07/14/600x338/AFP_98P3NX_1626274225272_1626274240500.jpg", "publishedAt": "2021-07-14T14:55:23Z", "content": "Overdose deaths soared to a record 93,000 last year in the midst of the COVID-19 pandemic, the US government reported Wednesday.\r\nThat estimate far eclipses the high of about 72,000 drug overdose dea… [+4152 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Bhaswati Guha Majumder", "title": "Guillain-Barre Syndrome: FDA Issues Warning On Johnson & Johnson's Covid-19 Vaccine Linked To Rare Disorder - Yahoo India News", "description": "About 100 preliminary reports of Guillain-Barre syndrome have been detected in the Covid-19 vaccine recipients after the administration of 12.8 million doses...", "url": "https://in.news.yahoo.com/guillain-barre-syndrome-fda-issues-131233412.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/gJfjnyGJlgS72JUvyoYhGQ--~B/aD0xODU7dz0yODA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/swarajya_613/f3a1b777c41df51f89de4cd82c68f9e5", "publishedAt": "2021-07-14T13:12:33Z", "content": "About 100 preliminary reports of Guillain-Barre syndrome have been detected in the Covid-19 vaccine recipients after the administration of 12.8 million doses of the Johnson &amp; Johnson jabs in the … [+4903 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Dr. Catherine Schuster-Bruce", "title": "8 fully vaccinated healthcare workers caught COVID-19 at a Vegas pool party. At least 7 caught the Delta varia - Business Insider India", "description": "Eight fully vaccinated health workers who attended a pool party in Las Vegas caught COVID-19, a report said. They had symptoms similar to allergies or a cold,", "url": "https://www.businessinsider.in/science/health/news/8-fully-vaccinated-healthcare-workers-caught-covid-19-at-a-vegas-pool-party-at-least-7-caught-the-delta-variant-a-report-said-/articleshow/84409431.cms", "urlToImage": "https://www.businessinsider.in/thumb/msid-84409431,width-1200,height-900,imgsize=1187470/8-fully-vaccinated-healthcare-workers-caught-covid-19-at-a-vegas-pool-party-at-least-7-caught-the-delta-variant-a-report-said-.jpg", "publishedAt": "2021-07-14T12:13:00Z", "content": "At least 11 healthcare\r\n workers, eight of whom were fully vaccinated, tested positive for COVID-19 after attending a pool party in Las Vegas in on June 7, the Las Vegas Review-Journal reported, citi… [+2867 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists use gene-editing technology to block COVID-19 transmission in human cells - WION", "description": "Researchers have used CRISPR genome editing technology to successfully block the transmission of the SARS-CoV-2 virus in infected human cells.", "url": "https://www.wionews.com/science/scientists-use-gene-editing-technology-to-block-covid-19-transmission-in-human-cells-398047", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/03/15/187248-untitled-design-2.jpg", "publishedAt": "2021-07-14T11:49:23Z", "content": "Researchers have used CRISPR genome editing technology to successfully block the transmission of the SARS-CoV-2 virus in infected human cells.\r\nThe study, published in the journal Nature Communicatio… [+1594 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "India's first COVID patient gets reinfected: What are your chances of re-infection if you had a mild infection? - Times of India", "description": "It has been suggested that the people who have had mild, or barely noticeable symptoms of coronavirus could possibly be 'less protected' than someone with severe coronavirus.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/indias-first-covid-patient-gets-reinfected-what-are-your-chances-of-re-infection-if-you-had-a-mild-infection/photostory/84406185.cms", "urlToImage": "https://static.toiimg.com/photo/84406433.cms", "publishedAt": "2021-07-14T10:42:16Z", "content": "While milder cases heal relatively quicker, and could possibly have less strengthened immunity and waning antibodies after a while, it is also said that milder cases are more at risk for reinfection … [+989 chars]"}, {"source": {"id": null, "name": "Floridanewstimes.com"}, "author": "winonaryder", "title": "Need a COVID-19 booster shot?Answer 6 questions about how to maintain protection - Floridanewstimes.com", "description": "Credit: Unsplash / CC0 public domain Increased prevalence of New coronavirus mutant People who already have COVID-19 shots are questioning how well they are protected from the evolving form of SARS-Co", "url": "https://floridanewstimes.com/need-a-covid-19-booster-shotanswer-6-questions-about-how-to-maintain-protection/302338/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/25-covid.jpg", "publishedAt": "2021-07-14T10:22:20Z", "content": "Credit: Unsplash / CC0 public domain\r\nIncreased prevalence of New coronavirus mutant People who already have COVID-19 shots are questioning how well they are protected from the evolving form of SARS-… [+6068 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "Vaccine efficacy, effectiveness and protection - World Health Organization", "description": "<div></div><p>This article is part of a series of explainers on vaccine development and distribution. Learn more about vaccines – from how they work and how they’re made to ensuring safety and equitable access – in WHO’s <a href=\"/emergencies/diseases/novel-c…", "url": "https://www.who.int/news-room/feature-stories/detail/vaccine-efficacy-effectiveness-and-protection", "urlToImage": "https://cdn.who.int/media/images/default-source/vaccines-explained/who_ve_topic-1_banner.tmb-1200v.jpg?sfvrsn=914ec6cd_14", "publishedAt": "2021-07-14T09:16:31Z", "content": "This article is part of a series of explainers on vaccine development and distribution. Learn more about vaccines – from how they work and how they’re made to ensuring safety and equitable access – i… [+5959 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": null, "title": "Can two coronavirus variants infect someone at the same time? Explainer of the Day - Jagran Josh", "description": "In a first documented case of a human infected with two different variants of the SARS-CoV-2 virus, a Belgian woman aged 90 years old was found to be", "url": "https://www.jagranjosh.com/current-affairs/can-two-coronavirus-variants-infect-someone-at-the-same-time-explainer-of-the-day-1626253737-1", "urlToImage": "https://img.jagranjosh.com/images/2021/July/1472021/COVID19_double_infection.jpg", "publishedAt": "2021-07-14T09:09:00Z", "content": "In a first documented case of a human infected with two different variants of the SARS-CoV-2 virus, a Belgian woman aged 90 years old was found to be infected with two coronavirus variants at the sam… [+2884 chars]"}, {"source": {"id": null, "name": "Thebetterindia.com"}, "author": "https://www.facebook.com/sanchari.pal.79", "title": "Cytomegalovirus Cases Detected in Delhi, Kolkata: What You Need to Know - The Better India", "description": "If you have noticed blood in stools during your post-COVID recovery, you should get tested immediately. Here's why. #CovidInIndia #Cytomegalovirus", "url": "https://www.thebetterindia.com/258585/post-covid-19-complication-cytomegalovirus-symptoms-treatment-diagnosis-india/", "urlToImage": "https://en-media.thebetterindia.com/uploads/2021/07/Feature-1.jpg", "publishedAt": "2021-07-14T08:14:29Z", "content": "In the latest complication after Black Fungus, reports of another disease called Cytomegalovirus (CMV) have surfaced. Recently, six COVID-recovered patients at Delhis Indraprastha Apollo Hospitals ha… [+3877 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Spread of Covid-19's Delta variant will substantially up cases, put pressure on healthcare: WHO - The Tribune India", "description": "As of July 13, at least 111 countries, territories and areas have reported detection of the Delta variant", "url": "https://www.tribuneindia.com/news/health/spread-of-covid-19s-delta-variant-will-substantially-up-cases-put-pressure-on-healthcare-who-283014", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/7/2021_7$largeimg_1179687517.JPG", "publishedAt": "2021-07-14T08:14:00Z", "content": "United Nations/Geneva, July 14\r\nThe increased transmissibility associated with the COVID-19's Delta variant is likely to substantially increase cases and put a greater pressure on healthcare systems,… [+5318 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Single dose of Sputnik V Covid vaccine triggers strong antibody response: Study - The Indian Express", "description": "A new study examined whether a single dose would achieve greater public health benefit than two doses by allowing protection of a larger population more quickly.", "url": "https://indianexpress.com/article/world/single-dose-of-sputnik-v-covid-vaccine-triggers-strong-antibody-response-study-7404080/", "urlToImage": "https://images.indianexpress.com/2021/07/Representational-photo-reuters.jpeg", "publishedAt": "2021-07-14T07:47:16Z", "content": "A single dose of the Sputnik V vaccine may be enough to elicit strong antibody response against SARS-CoV-2, the virus that causes COVID-19, in already infected people, according to a study.\r\nPrevious… [+3076 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "COVID-19: Synthetic SARS-CoV-2 could be used as antiviral therapy - THE WEEK", "description": "Researchers created a synthetic virus that can prevent the growth of the real virus", "url": "https://www.theweek.in/news/sci-tech/2021/07/14/covid-19--synthetic-sars-cov-2-could-be-used-as-antiviral-therap.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/health/images/2020/1/1/coronavirus-COVID-19-coronavirus-SARS-CoV-2-shut.jpg", "publishedAt": "2021-07-14T04:00:39Z", "content": "Researchers have designed a synthetic defective SARS-CoV-2 that can interfere with the growth of the real virus, potentially leading to the extinction of both the COVID-19 causing cand the artificial… [+3568 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Eating whole grains linked to smaller increases in waist size, blood pressure, blood sugar: Study in middle- to older-aged adults suggests whole grains may protect against heart disease - Science Daily", "description": "A study finds middle- to older-aged adults who ate more servings of whole grains, compared to those who ate fewer, were more likely to have smaller increases in waist size, blood pressure, and blood sugar levels as they aged. All three are linked with increas…", "url": "https://www.sciencedaily.com/releases/2021/07/210713165308.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-14T00:01:14Z", "content": "Middle- to older-aged adults who ate at least three servings of whole grains daily had smaller increases in waist size, blood pressure, and blood sugar levels over time compared to those who ate less… [+5129 chars]"}, {"source": {"id": null, "name": "SurvivorNet"}, "author": "Sophia Li", "title": "Genetic Testing: What Is It and Why Is It Important? An Interview with Breast Cancer Previvor Erika Stallings - SurvivorNet", "description": "Genetic testing, as a preventative measure, can help predict an individual’s cancer risk by looking at inherited gene mutations. These results can provide potentially life-saving information for patients who test positive for known mutations and who then can …", "url": "https://www.survivornet.com/articles/genetic-testing-what-is-it-and-why-is-it-important/", "urlToImage": "https://assets.survivornet.com/wp-content/uploads/2020/09/02165236/Close-The-Gap-Collaboration-Branding-7.30.20-1200x630.png", "publishedAt": "2021-07-13T21:54:17Z", "content": "Genetic testing can help predict an individuals cancer risk by looking at inherited gene mutations. These results can provide potentially life-saving information for patients who test positive for kn… [+2418 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "WHO chief says Delta variant soon to be dominant COVID-19 strain, slams nations ordering booster vaccine doses - Times Now", "description": "WHO chief Tedros Adhanom Ghebreyesus said that Delta variant of COVID-19 is ripping around the world at a scorching pace.", "url": "https://www.timesnownews.com/international/article/delta-variant-soon-to-be-dominant-covid-19-strain-says-who-chief-all-about-delta-delta-plus-variants/784548", "urlToImage": "https://imgk.timesnownews.com/story/covidcasesinIndia-AP_3.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-07-13T16:21:12Z", "content": "<ul><li>Delta variant was first detected in India</li></ul>\r\n<ul><li>Delta varinat is especially infecting unprotected and vulnerable people and steadily putting pressure back on health systems: WHO … [+3003 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Jeevan Biswas", "title": "Dog food may contain 'Superbugs' found in hospitalized patients; cause of concern for pet owners [details] - IBTimes India", "description": "According to a study that is being presented at the European Congress of Clinical Microbiology & Infectious Diseases (ECCMID), multi-drug resistant bacteria found in raw dog food were identical to those found in hospitalized patients across Europe.", "url": "https://www.ibtimes.co.in/dog-food-may-contain-superbugs-found-hospitalized-patients-cause-concern-pet-owners-details-838622", "urlToImage": "https://data1.ibtimes.co.in/en/full/763311/dog-food.jpg", "publishedAt": "2021-07-13T16:20:09Z", "content": "Antimicrobial Resistance (AMR)\r\nPet parents will leave no stone unturned to provide only the best of foods for their furbabies. With a wide range of foods to choose from, they can be spoilt for choic… [+4562 chars]"}]}