{"status":"ok","totalResults":71,"articles":[{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Pratishtha  Tiwari","title":"Health emergencies that should not be put on hold due to COVID 19 - Times of India","description":"Fear of getting infected with the novel coronavirus and the need for quarantine should not stop people from seeking","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/health-emergencies-that-should-not-be-put-on-hold-due-to-covid-19/articleshow/75215329.cms","urlToImage":"https://static.toiimg.com/thumb/msid-75215329,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-573713/75215329.jpg","publishedAt":"2020-04-19T12:38:08Z","content":"Fear of getting infected with the novel coronavirus and the need for quarantine should not stop people from seeking medical help for non-COVID 19 related chronic and acute health emergencies. \r\nIn the last two-three weeks, there have been cases reported where… [+2238 chars]"},{"source":{"id":null,"name":"Theprint.in"},"author":"ANI","title":"3,86,791 Covid-19 tests conducted in India so far: ICMR - ThePrint","description":"Dr Raman R Gangakhedkar, head scientist of ICMR, said of the 37,000 tests conducted on 18 April, 29,287 tests were done in the labs of the ICMR network.","url":"https://theprint.in/india/386791-covid-19-tests-conducted-in-india-so-far-icmr/404801/","urlToImage":"https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/covid-testing-scaled-e1586165716865.jpg","publishedAt":"2020-04-19T12:33:45Z","content":"New Delhi: The Indian Council of Medical Research (ICMR) on Sunday said that a total of3,86,791 COVID-19 tests have been conducted so far in the country. Out of these tests, over 37,000 tests were conducted on April 18 out of which 29,287 tests were done in t… [+1176 chars]"},{"source":{"id":null,"name":"Bloombergquint.com"},"author":"Suzy Waite","title":"World Health Guru Says Don’t Bet on Covid-19 Vaccine - BloombergQuint","description":"World Health Guru Says Don’t Bet on Covid-19 Vaccine: Observer","url":"https://www.bloombergquint.com/business/world-health-guru-says-don-t-bet-on-covid-19-vaccine-observer","urlToImage":"https://images.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2020-04-19T12:31:31Z","content":""},{"source":{"id":null,"name":"Financialexpress.com"},"author":"FE Online","title":"Coronavirus: Oxford University set to begin UK’s first clinical trials of COVID-19 vaccine by next week - The Financial Express","description":"Scientists at the Oxford university are set to begin the clinical trials of the vaccine against Covid-19 in the coming week.","url":"https://www.financialexpress.com/lifestyle/health/coronavirus-oxford-university-set-to-begin-uks-first-clinical-trials-of-covid-19-vaccine-by-next-week/1933167/","urlToImage":"https://images.financialexpress.com/2020/04/vaccine660-1.jpg","publishedAt":"2020-04-19T11:57:22Z","content":"COVID-19: Oxford University set for UK’s first clinical trials of COVID-19 vaccine! Scientists at the Oxford university are set to begin the clinical trials of the vaccine against Covid-19 in the coming week, Financial Times reported. If all goes well then th… [+2156 chars]"},{"source":{"id":null,"name":"Microbiozindia.com"},"author":null,"title":"Bangkok based University Opens Laboratory for Quick Testing of COVID-19 to Support Other Hospitals - Microbioz India","description":"Thammasat University has offered research facility testing in Allied Health Sciences so as to help medical clinic work, conveying exact and quick outcomes.\r\n\r\nThe University is giving assets to help during the national emergency due to COVID-19 and has opened…","url":"https://microbiozindia.com/health-news/bangkok-based-university-opens-laboratory-for-quick-testing-of-covid-19-to-support-other-hospitals/","urlToImage":"https://microbiozindia.com/wp-content/uploads/2020/04/virus-4915859_640.png","publishedAt":"2020-04-19T11:25:34Z","content":"Thammasat University has offered research facility testing in Allied Health Sciences so as to help medical clinic work, conveying exact and quick outcomes.\r\nThe University is giving assets to help during the national emergency due to COVID-19 and has opened r… [+3978 chars]"},{"source":{"id":null,"name":"Telanganatoday.com"},"author":"Telangana Today","title":"Nobel winning scientist claims COVID-19 virus originated in lab: Report - Telangana Today","description":"London: French Nobel prize winning scientist Luc Montagnier has sparked a fresh controversy by claiming that the SARS-CoV-2 virus came from a lab, and is the result of an attempt to manufacture a vaccine against the AIDS virus. In an interview given to French…","url":"https://telanganatoday.com/nobel-winning-scientist-claims-covid-19-virus-originated-in-lab-report","urlToImage":"https://cdn.telanganatoday.com/wp-content/uploads/2020/04/Nobel-winning-scientist-cla.jpg","publishedAt":"2020-04-19T10:35:00Z","content":"London: French Nobel prize winning scientist Luc Montagnier has sparked a fresh controversy by claiming that the SARS-CoV-2 virus came from a lab, and is the result of an attempt to manufacture a vaccine against the AIDS virus.\r\nIn an interview given to Frenc… [+2258 chars]"},{"source":{"id":null,"name":"Siasat.com"},"author":"Sameer","title":"Males more vulnerable to COVID-19: Are testicles responsible? - The Siasat Daily","description":"New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system. What…","url":"https://www.siasat.com/males-more-vulnerable-covid-19-are-testicles-responsible-1876362/","urlToImage":"https://cdn.siasat.com/wp-content/uploads/2020/04/testicles-.jpg","publishedAt":"2020-04-19T10:00:00Z","content":"New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system.\r\nWha… [+1183 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Associated Press","title":"Covid-19: ‘It made a world of difference’, says UK doctor treated by ex-students - Hindustan Times","description":"Coronavirus update: Dr. Poorna Gunasekera is especially admiring of the current generation of medical practitioners, of whom he has taught many, for being so much more “humble” than his.","url":"https://www.hindustantimes.com/world-news/covid-19-it-made-a-world-of-difference-says-uk-doctor-treated-by-ex-students/story-mgOZstOqQCi3q7LlZxypeP.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/virus-outbreak-britain-doctor-and-students_1abad7ce-8220-11ea-a716-f322ae116ff6.jpg","publishedAt":"2020-04-19T09:49:00Z","content":"At his darkest moment with the coronavirus, Dr. Poorna Gunasekera glimpsed three rays of light.\r\nFollowing a severe deterioration in his Covid-19 symptoms, Gunasekera was rushed to Derriford Hospital in Plymouth, southwest England, in the early hours of March… [+5440 chars]"},{"source":{"id":null,"name":"Thesun.co.uk"},"author":"Mollie Mansfield","title":"Skin rashes could be potential sign of coronavirus, dermatologists warn - The Sun","description":"","url":"http://www.thesun.co.uk/news/11428583/coronavirus-symptom-skin-rash/","urlToImage":"https://www.thesun.co.uk/wp-content/uploads/2020/04/JS-COMP-NEW-SYMPTOMS-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1","publishedAt":"2020-04-19T08:42:37Z","content":"DERMATOLOGISTS have warned that a skin rash could be a new symptom of the deadly coronavirus.\r\nThe rise of rashes in COVID-19 patients has prompted additional research by doctors.\r\n Skin rashes could be a symptom of the coronavirusCredit: Getty Images - Getty… [+1578 chars]"},{"source":{"id":null,"name":"Deccanherald.com"},"author":"PTI","title":"Genetic variation in immune system may affect coronavirus severity: Study - Deccan Herald","description":"Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease. The research, published in the Journal of Vir…","url":"https://www.deccanherald.com/science-and-environment/genetic-variation-in-immune-system-may-affect-coronavirus-severity-study-827261.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/article_images/2020/04/19/microbiology-163470_1280-1587284789.jpg","publishedAt":"2020-04-19T08:26:29Z","content":"Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease.\r\nThe research, published in the Journal of Vi… [+1754 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Sanchita Sharma","title":"Early measures reason for fewer cases in India: WHO regional director - Hindustan Times","description":"India has had fewer cases than it might have because of early and aggressive action to contain the spread of coronavirus disease (Covid-19), said Dr Poonam Khetrapal Singh, regional director, World Health Organization (WHO) South East Asia Region.","url":"https://www.hindustantimes.com/india-news/early-measures-reason-for-fewer-cases-in-india-who-regional-director/story-pzo670PRq3OzBFJjSkRQlK.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/covid-19_91a796e2-81df-11ea-a716-f322ae116ff6.jpg","publishedAt":"2020-04-19T07:13:00Z","content":"Fewer cases in India are attributable to early and aggressive action to contain the spread of coronavirus disease (Covid-19), said Dr Poonam Khetrapal Singh, regional director, World Health Organisation, South East Asia Region, of which India is a part.\r\nHigh… [+7097 chars]"},{"source":{"id":null,"name":"Newstracklive.com"},"author":"Harshita Jain","title":"Finding Corona vaccine becomes big task, this competition released in UK - News Track English","description":"London: The outbreak of Corona, which has been increasing suddenly, has been taking the form of an epidemic for the whole world today. This virus has caught more than 160,000 deaths. But still this death game has not stopped. This virus has rocked the whole w…","url":"https://english.newstracklive.com/news/big-task-by-finding-corona-vaccine-this-competition-released-in-uk-mc24-nu901-ta901-ta294-1085982-1.html","urlToImage":"https://media.newstracklive.com/uploads/world-news//Apr/19/big_thumb/1_5e9bbea84a4cc.jpg","publishedAt":"2020-04-19T06:19:29Z","content":null},{"source":{"id":null,"name":"Europeansting.com"},"author":"World Economic Forum","title":"What are antibody tests and can they get the world back to work? - The European Sting","description":"This article is brought to you thanks to the collaboration of The European Sting with the World Economic Forum. Author: Harry Kretchmer, Senior Writer, Formative Content Tests are already being use…","url":"https://europeansting.com/2020/04/19/what-are-antibody-tests-and-can-they-get-the-world-back-to-work/","urlToImage":"https://europeansting.files.wordpress.com/2020/04/tests.jpeg","publishedAt":"2020-04-19T06:14:00Z","content":"(Drew Hays, Unsplash)\r\nThis article is brought to you thanks to the collaboration of The European Sting with the World Economic Forum.\r\nAuthor: Harry Kretchmer, Senior Writer, Formative Content\r\n<ul><li>Tests are already being used to test frontline workers i… [+5980 chars]"},{"source":{"id":null,"name":"Nytimes.com"},"author":"James Gorman","title":"Both Acting as Barriers Against Virus That Spreads from 'Healthy' People, Are Face Masks the New Condoms? - News18","description":"If people with no symptoms are spreading the coronavirus, as some studies suggest, it may be time to give face masks the kind of advertising and promotion that support condoms as lifesavers.","url":"https://www.nytimes.com/2020/04/18/health/coronavirus-mask-condom.html","urlToImage":"https://static01.nyt.com/images/2020/04/18/science/18VIRUS-SHEDDING/18VIRUS-SHEDDING-facebookJumbo.jpg","publishedAt":"2020-04-19T05:56:59Z","content":"In another paper, which went online Friday in the journal Science, researchers reported that crab-eating macaques were susceptible to infection by the new coronavirus and that they appeared to be shedding the virus from their bodies almost as soon as they wer… [+1268 chars]"},{"source":{"id":null,"name":"Newsonair.com"},"author":null,"title":"Fresh COVID-19 cases reported from HP, Gujarat, Maharashtra - All India Radio","description":"In Himachal Pradesh two more people in Una district tested positive for COVID 19 yesterday, taking the total active infected persons in the state to 23.","url":"http://newsonair.com/Main-News-Details.aspx?id=386027","urlToImage":"http://www.newsonair.com/writereaddata/News_Pictures/STA/2020/Apr/NPIC-202041991316.jpg","publishedAt":"2020-04-19T03:44:33Z","content":"In Himachal Pradesh two more people in Una district tested positive for COVID 19 yesterday, taking the total active infected persons in the state to 23. The maximum numbers of 14 active coronavirus patients are from the Una district followed by 3 from Chamba … [+2389 chars]"},{"source":{"id":null,"name":"Mid-day.com"},"author":"Prutha Bhosle, P Vatsalya","title":"How dialysis, cancer patients are coping when Mumbai's healthcare system is geared towards COVID-19 patients - Mid-day","description":"Even as the state machinery wages war against the Coronavirus outbreak those suffering from kidney ailments and cancer hope the government starts prioritising their health too","url":"https://www.mid-day.com/articles/how-dialysis-cancer-patients-are-coping-when-mumbais-healthcare-system-is-geared-towards-covid-19-patients/22738217","urlToImage":"https://images.mid-day.com/images/2020/apr/sick-b_d.jpg","publishedAt":"2020-04-19T03:42:05Z","content":"Updated: Apr 19, 2020, 08:56 IST | \r\n Prutha Bhosle, P Vatsalya |\r\n Mumbai\r\nA month ago, Dipanwita Dutt exchanged vows and moved from Mumbai to Kolkata with her husband. But, leaving her maternal home in Dadar was not easy. Her mother Chitra Dutt, who require… [+15110 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Abantika Ghosh","title":"Pool widened further, govt to test all coming to hospitals with flu signs - The Indian Express","description":"A highly placed source said, “This means that whoever comes forward to get tested, we will test, regardless of whether the person has travel and contact history or not.”","url":"https://indianexpress.com/article/coronavirus/coronavirus-covid-19-testing-kits-flu-like-symptoms-screening-6368763/","urlToImage":"https://images.indianexpress.com/2020/04/Tsting-Nirmal.jpg?w=759","publishedAt":"2020-04-19T03:06:44Z","content":"Written by Abantika Ghosh\r\n | New Delhi | \r\nUpdated: April 19, 2020 8:28:11 am\r\nHealth workers undertake screening and sample collection at Dharavi labour camp (Express photo by Nirmal Harindran)Looking at mass testing in areas with a large number of cases ho… [+4047 chars]"},{"source":{"id":null,"name":"Newstracklive.com"},"author":"Vinod Rathore","title":"People suffering from mental illnesses due to Corona lockdown - News Track English","description":"New Delhi: Corona epidemic has brought such a crisis in front of the whole world, the effect of which will be seen for many years. In an atmosphere of fear and anxiety, human lockdown and social distancing have been forced to live. In such a situation, the he…","url":"https://english.newstracklive.com/news/a-survey-reveals-that-corona-crisis-and-lockdown-is-effecting-mental-health-mc23-nu764-ta272-1085966-1.html","urlToImage":"https://media.newstracklive.com/uploads/national-news//Apr/18/big_thumb/hjtgjgfj_5e9aff2c86457.jpg","publishedAt":"2020-04-19T02:55:53Z","content":null},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"UK Govt Faces Mounting Criticism Over Protection Clothing Shortages While Treating Covid-19 Patients - News18","description":"Britain is at or near the peak of a health crisis in which more than 15,000 people have died - the fifth highest national death toll of a pandemic linked to at least 150,000 deaths worldwide.","url":"https://www.news18.com/news/world/uk-govt-faces-mounting-criticism-over-protection-clothing-shortages-while-treating-covid-19-patients-2583549.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/04/1587262932_uk-covid-tests.jpg","publishedAt":"2020-04-19T02:34:29Z","content":"Doctors and health workers criticised the British government on Saturday for suggesting that personal protective equipment (PPE) worn while treating patients infected with coronavirus could be re-used, as supplies run low across the country.\r\nBritain is at or… [+3459 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"TIMESOFINDIA.COM","title":"5 great workouts for people who have diabetes - Times of India","description":"Most of them are unaware of the fact that exercising is just as important as diet and medication for their health condition.","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/5-great-workouts-for-people-who-have-diabetes/photostory/75224495.cms","urlToImage":"https://static.toiimg.com/photo/75227655.cms","publishedAt":"2020-04-19T01:30:00Z","content":"Exercising is important for people of all age groups and it is even more essential when suffering from a disease like diabetes. Regular workout keeps your blood glucose level in check and improves your overall health. However, not even 50 per cent of the enti… [+599 chars]"}]}