{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pratishtha Tiwari", "title": "Diabetes is NOT caused by eating meetha - Times of India", "description": "People with a sweet tooth are often advised by many “Itna meetha mat khao warna diabetes ho jaegi” (Eating too much sugar will cause diabetes). But does that really happen?", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/diabetes-is-not-caused-by-eating-meetha/photostory/79296868.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-79297176,width-900,height-1200,resizemode-6.cms", "publishedAt": "2020-11-19T11:42:28Z", "content": "A can of soda has around 10 teaspoons of sugar, which exceeds the total daily recommended intake. Frozen meals, ketchup cereal bars, juices, junk food and BBQ sauces are some other hidden sources of … [+5 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Yash Tripathi", "title": "What is Chapare Virus? Symptoms, treatment, death, prevention & more - Republic World", "description": "What is Chapare Virus? Here is everything you need to know about the CHHP fever from the Chapare virus, how it spreads, symptoms and more.", "url": "https://www.republicworld.com/technology-news/science/what-is-chapare-virus-symptoms-treatment-death-prevention-and-more.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/3nghm6peuv6ltmxf_1605773234.jpeg?tr=f-jpeg", "publishedAt": "2020-11-19T10:38:00Z", "content": "The human race is having a hard time dealing with the Coronavirus pandemic, and this is why the Chapare virus should not be taken for granted. The United States’ Centers for Disease Control and Preve… [+4701 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA", "title": "Retinas: New potential clues in diagnosing, treating Alzheimer's - DNA India", "description": "A study led by the Cedars-Sinai Department of Neurosurgery has identified certain regions in the retina - the lining found in the back of the eye - that are more affected by Alzheimer's disease than other areas. The findings may help physicians predict change…", "url": "https://www.dnaindia.com/india/video-retinas-new-potential-clues-in-diagnosing-treating-alzheimer-s-2857340", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/2020/11/19/938488-00000003.jpg", "publishedAt": "2020-11-19T09:30:56Z", "content": "©2020 Diligent Media Corporation Ltd."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Do you use earphones for long while working online? Here’s how it could affect you - The Indian Express", "description": "If people do not change their habits, they could face \"permanent damage\" to their ears, Dr Chavan warned. He said the wax inside the ear kills the bacteria naturally and prevents infection", "url": "https://indianexpress.com/article/lifestyle/health/use-of-earphones-for-working-online-causing-infections-say-experts-7057259/", "urlToImage": "https://images.indianexpress.com/2020/11/home-office-1200.jpg", "publishedAt": "2020-11-19T09:30:24Z", "content": "By: PTI | Mumbai | \r\nNovember 19, 2020 3:00:24 pm\r\nAccording to medical experts, use of headphones and\r\nearpods for long hours in the last seven to eight months has\r\nincreased such complaints. (Photo… [+3197 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Study reveals how smoking worsens COVID-19 infection in the airways - The Hindu", "description": "\"If you think of the airways like the high walls that protect a castle, smoking cigarettes is like creating holes in these walls,\" said Brigitte Gomperts, a co-author of the study", "url": "https://www.thehindu.com/sci-tech/science/study-reveals-how-smoking-worsens-covid-19-infection-in-the-airways/article33131495.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/rtkk98/article33131494.ece/ALTERNATES/LANDSCAPE_615/800-x-533", "publishedAt": "2020-11-19T09:14:38Z", "content": "Using lab-grown lung tissue, scientists have pinpointed how smoking cigarettes facilitates more severe lung infection by the novel coronavirus, an advance that may lead to new therapeutic strategies … [+2585 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Turkey To Buy Chinese COVID-19 Candidate Vaccine Doses, In Talks With Pfizer - News18", "description": "Turkey will sign a contract within days to buy at least 20 million doses of a COVID19 candidate vaccine from China's Sinovac Biotech, the health minister was cited as saying, adding that Ankara was also in talks to buy doses of Pfizer and BioNTech's vaccine.", "url": "https://www.news18.com/news/world/turkey-to-buy-chinese-covid-19-candidate-vaccine-doses-in-talks-with-pfizer-3096179.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/07/1595612567_news18_world_default_image.jpg", "publishedAt": "2020-11-19T08:39:04Z", "content": "ANKARA: Turkey will sign a contract within days to buy at least 20 million doses of a COVID-19 candidate vaccine from China’s Sinovac Biotech, the health minister was cited as saying, adding that Ank… [+2199 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: How much of Vitamin D supplement is too much for COVID-19 patients? - Times of India", "description": "Vitamin D is extremely crucial for our overall health and well being. Apart from ensuring strong bones and teeth, it also builds muscle strength and improves the functioning of the cells in our body. Also known as the 'Sunshine' vitamin, scientists and medica…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-how-much-of-vitamin-d-supplement-is-too-much-for-covid-19-patients/photostory/79299489.cms", "urlToImage": "https://static.toiimg.com/photo/79299521.cms", "publishedAt": "2020-11-19T08:30:00Z", "content": "Many scientific researches have claimed sufficient levels of Vitamin D in the body can prevent the coronavirus from entering our system and can also ensure faster recovery in patients who are already… [+461 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by Zarafshan Shiraz", "title": "Here’s how diabetes, hypertension may increase risk of Covid-19 brain complications - Hindustan Times", "description": "Study reveals neurological complications like bleeding in the brain and stroke are common in Covid-19 patients with diabetes and hypertension, here’s why", "url": "https://www.hindustantimes.com/more-lifestyle/here-s-how-diabetes-hypertension-may-increase-risk-of-covid-19-brain-complications/story-hVWAPj7uRyP1h4EXSsTNtJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/19/Pictures/_df2980fc-2a3f-11eb-a1f1-9949958d68df.jpg", "publishedAt": "2020-11-19T08:19:57Z", "content": "Some patients with Covid-19 are at higher risk of neurological complications like bleeding in the brain and stroke, according to a new study.\r\nThe study was being presented at the annual meeting of t… [+3385 chars]"}, {"source": {"id": null, "name": "Sify News"}, "author": "IANS", "title": "Take Vitamin D supplements to reduce cancer risk: Study - Sify News", "description": "New York, Nov 19 (IAN) It seems like we have now one more reason to take vitamin D supplements as researchers have found that vitamin D was associated with an overall 17 per cent risk reduction for advanced cancer.", "url": "https://www.sify.com/news/take-vitamin-d-supplements-to-reduce-cancer-risk-study-news-education-ulti5Egfbdhii.html", "urlToImage": "https://www.sify.com/images/news-183x123.jpg", "publishedAt": "2020-11-19T08:09:02Z", "content": "\"The findings suggest that vitamin D may reduce the risk of developing advanced cancers,\" said study author Paulette Chandler from the Brigham and Women's Hospital in the US.\r\n\"Vitamin D is a supplem… [+1901 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "IANS", "title": "Mouthwash can kill Covid-19 virus in 30 seconds: Study - Times Now", "description": "The researchers revealed that mouthwashes containing at least 0.07 per cent cetypyridinium chloride showed \"promising signs\" of virus-killing potential.", "url": "https://www.timesnownews.com/health/article/mouthwash-can-kill-covid-19-virus-in-30-seconds-study/683829", "urlToImage": "https://imgk.timesnownews.com/story/iStock-489430211_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-19T08:08:10Z", "content": "London: Researchers have once again claimed that widely-available mouthwashes have killed Coronavirus, responsible for the Covid-19 disease, within 30 seconds of exposure in laboratory conditions.\r\nT… [+1900 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "AI, virtual reality can help fast track COVID-19 vaccine, experts say - CNBCTV18", "description": "Another technology of importance in COVID-19 vaccine research, Faber said, is automation. Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/technology/ai-virtual-reality-can-help-fast-track-covid-19-vaccine-experts-say-7520391.htm/", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/06/coronavirus-drug-768x478.jpg", "publishedAt": "2020-11-19T08:03:40Z", "content": "From helping in optimising the yield of therapeutics to training staff for setting up large-scale manufacturing sites, cutting-edge technologies such as artificial intelligence (AI) and virtual reali… [+5238 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "Artificial Intelligence, virtual reality can help fast track COVID-19 vaccine: Experts - The New Indian Express", "description": "A panel of experts noted at the Berlin Science Week that AI and other technologies like machine learning can make sense of the mountains of data from several experiments.", "url": "https://www.newindianexpress.com/lifestyle/tech/2020/nov/19/artificial-intelligence-virtual-reality-can-help-fast-track-covid-19-vaccine-experts-2225378.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/7/26/w600X390/declare_AI.jpg", "publishedAt": "2020-11-19T07:49:00Z", "content": "NEW DELHI: From helping in optimising the yield of therapeutics to training staff for setting up large-scale manufacturing sites, cutting-edge technologies such as artificial intelligence (AI) and vi… [+5069 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Mizoram Covid-19 situation worsens, 32 test positive - Northeast Now", "description": "Mizoram’s Covid-19 situation worsens with 32 more people testing positive for the novel coronavirus in the past 24 hours. These new cases include 16 policemen. The recent spike in Covid-19 cases has compelled the state government to extend the lockdown in the…", "url": "https://nenow.in/north-east-news/mizoram/mizoram-covid-19-situation-worsens-32-test-positive.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/11/Coronavirus-1140x570-1.jpg", "publishedAt": "2020-11-19T07:48:25Z", "content": "Mizorams Covid-19 situation worsens with 32 more people testing positive for the novel coronavirus in the past 24 hours.\r\nThese new cases include 16 policemen.\r\nThe recent spike in Covid-19 cases has… [+707 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Kate Kelland", "title": "AstraZeneca COVID-19 shot candidate shows promise among elderly in trials - Reuters", "description": "AstraZeneca and Oxford University's potential COVID-19 vaccine produced a strong immune response in older adults, data published on Thursday showed, with researchers expecting to release late-stage trial results by Christmas.", "url": "https://in.reuters.com/article/us-health-coronavirus-oxford-astrazeneca-idUSKBN27Z0PF", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201119&t=2&i=1541724915&r=LYNXMPEGAI0DS&w=800", "publishedAt": "2020-11-19T07:12:00Z", "content": "LONDON (Reuters) - AstraZeneca and Oxford Universitys potential COVID-19 vaccine produced a strong immune response in older adults, data published on Thursday showed, with researchers expecting to re… [+2527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weight Loss: High Protein Diet Can Help You Burn More Fat, New Study Finds - NDTV", "description": "High protein diet: It was found that participants on a high protein diet were able to burn an average of 80 calories a day, and were burning significantly more fat.", "url": "https://www.ndtv.com/health/weight-loss-high-protein-diet-can-help-you-burn-more-fat-new-study-finds-2327295", "urlToImage": "https://c.ndtvimg.com/2019-12/mjhh7ako_protein_650x400_03_December_19.jpg", "publishedAt": "2020-11-19T07:09:59Z", "content": "High-protein diets were found to have higher thermic effect\r\nHighlights\r\n<ul><li>It takes more energy for one to process protein\r\n</li><li>High protein diet can help in burning more calories\r\n</li><l… [+3076 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com | Edited by Mallika Soni", "title": "Covid-19 and Guillain Barre Syndrome: Relation, causes and symptoms - Hindustan Times", "description": "Guillain Barre Syndrome is a rare autoimmune disorder, a prototype of post-infectious neuropathy that usually develops within two to four weeks after an acute infection, and is caused by a bacterial or viral infection.", "url": "https://www.hindustantimes.com/india-news/covid-19-and-guillain-barre-syndrome-relation-causes-and-symptoms/story-5dyPPPFK7Ijqkva2yHM0OO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/19/Pictures/scientist-prepares-samples-calgary-monitoring-coronavirus-disease_6a1a8574-2a33-11eb-a1f1-9949958d68df.jpg", "publishedAt": "2020-11-19T06:52:26Z", "content": "Several neurologists in Mumbai came together last week to conduct a study on a rare neurological complication, the Guillain Barre Syndrome (GBS), in patients of the coronavirus disease (Covid-19). Th… [+2214 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Nikhil Ghanekar", "title": "From Vaccine Candidates to Success Rates, All You Wanted to Know About Covid-19 Shot Trials in India - News18", "description": "Five vaccine candidates are currently undergoing clinical trials in India and are in different stages of trials. These include vaccines developed by Oxford University – AstraZeneca, Bharat Biotech, Cadila, Biological E – Baylor College of Medicine and Gamaley…", "url": "https://www.news18.com/news/india/all-you-wanted-to-know-about-covid-19-vaccine-trials-in-india-3095669.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/10/1603508826_covid-vaccine-1.jpg", "publishedAt": "2020-11-19T06:49:00Z", "content": "A year has passed since the first few cases of novel Coronavirus infections were detected in Chinas Wuhan province. In this period, the worlds scientific community together with government regulators… [+5380 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Smeeta Mishra", "title": "COVID-19: What About the Concerns of People With Chronic Respiratory Ailments? - The Wire Science", "description": "COVID-19 campaigns need to address the fact that people with chronic respiratory ailments may find it uncomfortable to wear masks.", "url": "https://science.thewire.in/health/covid-19-what-about-the-concerns-of-people-with-chronic-respiratory-ailments/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/11/18181119/pexels-anna-shvets-3786120-scaled.jpg", "publishedAt": "2020-11-19T06:29:00Z", "content": "Photo: Anna Shvets/Pexels.\r\nWith the onset of winter, recurrent coughs and breathing troubles become more common among people living in most Indian cities. Symptoms of people with chronic respiratory… [+5269 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Exposure to Air Pollution may Impact Mental Health Later in Life: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "When looking at individual air pollutants, the research found that long-term exposure to nitrogen dioxide or fine particulate air pollution was associated with increased depressive symptoms, but with only a small effect. - Articles from The Weather Channel | …", "url": "https://weather.com/en-IN/india/pollution/news/2020-11-19-exposure-to-air-pollution-may-impact-mental-health-later-in-life", "urlToImage": "https://s.w-x.co/in-pollution_6_0.jpg", "publishedAt": "2020-11-19T06:19:25Z", "content": "A new research adds to the growing body of evidence that higher exposure to air pollution may affect mental health later in life. In a study of women aged 80 years and older, published in the Journal… [+1304 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": null, "title": "Coronavirus is airborne indoors. But we’re still scrubbing surfaces - Moneycontrol", "description": "Scientists who initially warned about contaminated surfaces now say that the novel coronavirus spreads primarily through inhaled droplets, and that there is little to no evidence that deep cleaning mitigates the threat indoors.", "url": "https://www.nytimes.com/2020/11/18/world/asia/coronavirus-scrubbing-surfaces.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/AP20320374837536-770x433.jpg", "publishedAt": "2020-11-19T06:09:00Z", "content": "At Hong Kongs deserted airport, cleaning crews constantly spray baggage trolleys, elevator buttons and check-in counters with antimicrobial solutions. In New York City, workers continually disinfect … [+7527 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com | Edited by Karan Manral", "title": "Ray of hope? Study claims Hepatitis C drugs can be effective against Covid-19 - Hindustan Times", "description": "The study, conducted by the US’ Department of Energy, found that drugs used to treat Hepatitis C can be effective against Protease, a protein enzyme which has the ability to help Sars-Cov-2 spread in human cells.", "url": "https://www.hindustantimes.com/world-news/ray-of-hope-study-claims-hepatitis-c-drugs-can-be-effective-against-covid-19/story-57X6PRGxTVWeZZYphDvlON.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/19/Pictures/the-outbreak-milan-the-coronavirus-disease-covid_1ae85534-2a2a-11eb-a1f1-9949958d68df.jpg", "publishedAt": "2020-11-19T06:04:58Z", "content": "Even as countries across the world are scrambling to find a vaccine against the coronavirus disease (Covid-19), which has claimed more than a million lives, there might be some hope on the horizon. T… [+1682 chars]"}, {"source": {"id": null, "name": "Kashmirobserver.net"}, "author": "sofi", "title": "Can Surgical Masks Be Reused? - Kashmir Observer", "description": "Washing the mask at home could potentially cause a secondary contamination and spread the virus if washing is not set appropriately’.", "url": "https://kashmirobserver.net/2020/11/18/can-surgical-masks-be-reused/", "urlToImage": "https://kashmirobserver.net/wp-content/uploads/2020/11/Surgical-Masks.jpg", "publishedAt": "2020-11-19T05:46:18Z", "content": "WhatsAppFacebook TwitterEmail5Shares\r\nWashing the mask at home could potentially cause a secondary contamination and spread the virus if washing is not set appropriately\r\nHEALTH authorities say the m… [+4466 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can COVID-19 immunity last beyond six months for patients? - Times of India", "description": "Recent researches have evaluated that contrary to evidence, immunity against COVID-19 can last for a long while. But what is the maximum threshold you can possibly stay away from reinfection?", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-can-covid-19-immunity-last-beyond-six-months-for-patients/photostory/79284349.cms", "urlToImage": "https://static.toiimg.com/photo/79284633.cms", "publishedAt": "2020-11-19T05:30:00Z", "content": "It has been largely presumed that patients who fight COVID gain antibodies, however, which start to wane after a while. The most cited confirmation came from a July-based King's College Study which f… [+1030 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Domestic cats can be asymptomatic carriers of SARS-CoV-2, show studies - News-Medical.Net", "description": "Two recently published studies from Kansas State University researchers and collaborators have led to two important findings related to the COVID-19 pandemic: Domestic cats can be asymptomatic carriers of SARS-CoV-2, but pigs are unlikely to be significant ca…", "url": "https://www.news-medical.net/news/20201119/Domestic-cats-can-be-asymptomatic-carriers-of-SARS-CoV-2-show-studies.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2019%2f5%2fFemale_veterinary_doctor_using_stethoscope_for_cute_kitten_-_Image_-_Maria_Sbytova_A1_87d2b43d99c4479d9866e299f000d075-620x480.jpg", "publishedAt": "2020-11-19T05:27:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 19 2020\r\nTwo recently published studies from Kansas State University researchers and collaborators have led to two important findings related to the COVID-19 pan… [+3088 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Children around the world have missed out on measles vaccine due to COVID-19, could trigger an outbreak - Firstpost", "description": "The pandemic has had an effect on the control of vaccine-preventable diseases because campaigns were paused and routine immunisation services were disrupted.", "url": "https://www.firstpost.com/health/children-around-the-world-have-missed-out-on-measles-vaccine-due-to-covid-19-could-trigger-an-outbreak-9029871.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/03/Measles-spot_UN-1.jpg", "publishedAt": "2020-11-19T04:22:56Z", "content": "The pandemic has had an effect on the control of vaccine-preventable diseases because campaigns were paused and routine immunisation services were disrupted.\r\n Major measles outbreaks might occur dur… [+2405 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Lesbian, gay, bisexual communities more at-risk for dementia, study finds - New Kerala", "description": "", "url": "https://www.newkerala.com/news/2020/200787.htm", "urlToImage": "https://www.newkerala.com/news/news-box.jpg", "publishedAt": "2020-11-19T03:53:02Z", "content": "Michigan , November 18: Lesbian, gay and bisexual -- or LGB -- people are more vulnerable to one of the fastest-growing health concerns in the country: dementia, according to new research from Michig… [+3025 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Boosting immunity: Orange and coriander drink to rev up your immunity - Times of India", "description": "The sudden rains have changed the weather completely.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/home-remedies/boosting-immunity-orange-and-coriander-drink-to-rev-up-your-immunity/photostory/79286776.cms", "urlToImage": "https://static.toiimg.com/photo/79286944.cms", "publishedAt": "2020-11-19T03:30:00Z", "content": "You will need- 2 oranges, 2 coriander springs, 1 medium-sized carrot and 1 teaspoon lemon juice.\r\nHow to make: Peel the oranges, chop carrot and coriander. Put all this into a blender. Strain the jui… [+36 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Mouthwash can kill COVID-19 within 30 seconds, finds UK study - Zee News", "description": "A new study conducted by researchers at the Cardiff University in United Kingdom has found that mouthwash can kill coronavirus within 30 seconds in saliva.", "url": "https://zeenews.india.com/health/mouthwash-can-kill-covid-19-within-30-seconds-finds-uk-study-2325424.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/11/19/900033-mouthwash.jpg", "publishedAt": "2020-11-19T03:02:41Z", "content": "A new study conducted by researchers at the Cardiff University in United Kingdom has found that mouthwash can kill coronavirus within 30 seconds in saliva.\r\nThe findings of the study were published l… [+2072 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "‘Those with pulmonary disease more vulnerable to Covid’ - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/chandigarh/those-with-pulmonary-disease-more-vulnerable-to-covid-172516", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/11/Desk/2020_11$largeimg_820281542.jpg", "publishedAt": "2020-11-19T01:44:00Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+465 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Food habits in pregnancy and its association with gestational diabetes mellitus: results from a prospective cohort study in public hospitals of urban India - BMC Blogs Network", "description": "Few studies have explored the relationship between food habits and the risk of gestational diabetes mellitus (GDM) in women from India. We aimed to investigate the associations of food habits and the risk of GDM. As part of the MAASTHI prospective cohort stud…", "url": "https://bmcnutr.biomedcentral.com/articles/10.1186/s40795-020-00388-x", "urlToImage": "https://media.springernature.com/w110/springer-static/cover/journal/40795.jpg", "publishedAt": "2020-11-19T01:21:43Z", "content": null}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "China has five COVID-19 vaccines in phase III clinical trials - Macau Business", "description": "China has five vaccines for COVID-19 currently undergoing phase III clinical trials in some foreign countries, a Foreign Ministry spokesperson said", "url": "https://www.macaubusiness.com/china-has-five-covid-19-vaccines-in-phase-iii-clinical-trials/", "urlToImage": null, "publishedAt": "2020-11-18T23:13:51Z", "content": "China has five vaccines for COVID-19 currently undergoing phase III clinical trials in some foreign countries, a Foreign Ministry spokesperson said here Wednesday.\r\nSpokesperson Zhao Lijian told a ne… [+1507 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Democratic Republic of Congo says it is Ebola free - CGTN America", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9a2FKS05oLVhJQTTSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-18T22:03:18Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "India's HIV prevention model can be adopted, scaled up in other countries: Harsh Vardhan - ANI News", "description": "New Delhi [India], November 19 (ANI): India has a unique HIV prevention model that can be adopted and scaled up in many countries by tailoring the intervention as per local settings, Union Health and Family Welfare Minister Harsh Vardhan said on Wednesday.", "url": "https://www.aninews.in/news/national/general-news/indias-hiv-prevention-model-can-be-adopted-scaled-up-in-other-countries-harsh-vardhan20201119013947", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/image0014ZZ7REVVE-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-18T20:09:00Z", "content": "ANI | Updated: Nov 19, 2020 01:39 IST\r\nNew Delhi [India], November 19 (ANI): India has a unique HIV prevention model that can be adopted and scaled up in many countries by tailoring the intervention … [+3523 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Amla for air pollution: When and how to eat it for maximum health benefits - Times of India", "description": "The citrus fruit possesses compounds that can give a boost to your immune health and decrease the ill-effects of air pollution on your lungs caused due to degrading air quality levels.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/amla-for-air-pollution-when-and-how-to-eat-it-for-maximum-health-benefits/photostory/79283545.cms", "urlToImage": "https://static.toiimg.com/photo/79283923.cms", "publishedAt": "2020-11-18T18:30:00Z", "content": "Contrary to popular belief, winter is not all about cold and flu. The extreme cold weather also increases the risk of heart attack, high blood pressure and respiratory issues, which is predominantly … [+679 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Covid-19: Study questions whether masks protect wearers - Deccan Herald", "description": "Researchers in Denmark reported on Wednesday that surgical masks did not protect the wearers against infection with the coronavirus in a large randomized clinical trial. But the findings conflict with those from a number of other studies, experts said, and is…", "url": "https://www.deccanherald.com/science-and-environment/covid-19-study-questions-whether-masks-protect-wearers-917291.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/19/download-2020-11-18t233649181-917291-1605763715.png", "publishedAt": "2020-11-18T18:09:56Z", "content": "Researchers in Denmark reported on Wednesday that surgical masks did not protect the wearers against infection with the coronavirus in a large randomized clinical trial. But the findings conflict wit… [+5205 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Italy reports 34,283 new coronavirus cases on Wednesday, 753 deaths - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/world/italy-reports-34-283-new-coronavirus-cases-on-wednesday-753-deaths-172239", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/11/2020_11$largeimg_238998370.jpeg", "publishedAt": "2020-11-18T17:00:00Z", "content": "Rome, November 18\r\nItaly has registered 34,283 new coronavirus infections over the past 24 hours, the health ministry said on Wednesday, up from 32,191 the day before.\r\nThe ministry also reported 753… [+655 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Raw almonds vs. Soaked almonds: What's better and why? - Times of India", "description": "Almonds are a great source of nutrients for the body. Whether you eat it raw or soaked is all up to you and your taste bud. However, when it comes to your health, you must go for soaked almonds. Soaking the almond not only makes it easier to take off the peel…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/raw-almonds-vs-soaked-almonds-whats-better-and-why/photostory/79284508.cms", "urlToImage": "https://static.toiimg.com/photo/79284525.cms", "publishedAt": "2020-11-18T15:30:00Z", "content": "Besides being loaded with nutrients and better than raw almonds, here are some other benefits of eating soaked almonds.\r\n- It is extremely good for digestion.\r\n- It makes for a healthy snack and assi… [+267 chars]"}, {"source": {"id": null, "name": "The Local France"}, "author": null, "title": "EXPLAINED: Why France is debating making the Covid-19 vaccine compulsory? - The Local France", "description": null, "url": "https://www.thelocal.fr/20201118/explained-why-is-france-considering-making-the-covid-19-vaccine-compulsory", "urlToImage": null, "publishedAt": "2020-11-18T15:21:40Z", "content": null}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Free Press Journal", "title": "Corona Vaccine Tracker on Nov 18, 2020 - Free Press Journal", "description": "Pakistan has earmarked USD 100 million for advance payment to procure the coronavirus vaccine as and when it is available. The funds were approved for the initial purchase with the decision that vulnerable segments like senior citizens, health practitioners a…", "url": "https://www.freepressjournal.in/health/corona-vaccine-tracker-on-nov-18-2020", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2020-11%2F46412795-51e8-4e31-9252-e27a5a6e0709%2Fetc_corona_vaccine_tracker_pakistan_nov_18.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-11-18T14:52:00Z", "content": "Pakistan earmarks $100 million for vaccine\r\nPakistan has earmarked USD 100 million for advance payment to procure the coronavirus vaccine as and when it is available.\r\nThe funds were approved for the… [+1178 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Jacob Koshy", "title": "Kerala to commission genome survey for SARS-CoV-2 - The Hindu", "description": "Study, commissioned on November 11, will collect 100 samples from 14 districts every month, for three months", "url": "https://www.thehindu.com/sci-tech/health/kerala-to-commission-genome-survey-for-sars-cov-2/article33126471.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/ic0zs7/article31489406.ece/ALTERNATES/LANDSCAPE_615/03TH-SCICOV-TESTING-1", "publishedAt": "2020-11-18T14:45:00Z", "content": "To better understand the genomic variation in the strains of SARS-CoV-2 in the State, the Kerala government has tied up with the CSIR-Institute of Genomics and Integrative Biology (IGIB) for a survey… [+1955 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Covid-19: Mysteries of loss of smell finally yield some answers - Deccan Herald", "description": "It dawned on Eian Kantor on a Saturday in early April as he brewed a cup of tea from fresh mint leaves: he had lost his sense of smell. The tea suspiciously smelled of nothing at all. Kantor proceeded to rifle through the fridge, sniffing jars of pickles, chi…", "url": "https://www.deccanherald.com/science-and-environment/covid-19-mysteries-of-loss-of-smell-finally-yield-some-answers-917195.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/19/mask-50086601280-917195-1605763192.jpg", "publishedAt": "2020-11-18T14:02:36Z", "content": "It dawned on Eian Kantor on a Saturday in early April as he brewed a cup of tea from fresh mint leaves: he had lost his sense of smell. The tea suspiciously smelled of nothing at all. Kantor proceede… [+9806 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "COVID-19: Brain complications 'increasingly reported' in virus patients with diabetes and hypertension - Sky News", "description": "Life-threatening complications including strokes and brain bleeds have been found in a significant number of coronavirus patients.", "url": "https://news.sky.com/story/covid-19-brain-complications-increasingly-reported-in-virus-patients-with-diabetes-and-hypertension-12135552", "urlToImage": "https://e3.365dm.com/20/11/1600x900/skynews-brain-scan-neurology_5176080.jpg?20201118124116", "publishedAt": "2020-11-18T13:31:12Z", "content": null}, {"source": {"id": null, "name": "AsiaNews"}, "author": "AsiaNews.it", "title": "CHINA Chinese experimental vaccine induces a quick response - AsiaNews", "description": "Sinovac Biotech is conducting phase three trials in Indonesia, Brazil and Turkey. Unlike Pfizer-BioNtech and Moderna vaccines, its vaccine can be stored at a temperature between 2 and 8 degrees Celsiu", "url": "http://www.asianews.it/news-en/Chinese-experimental-vaccine-induces-a-quick-response-51625.html", "urlToImage": "http://www.asianews.it/./files/img/size3/CINA-Vaccine.jpg", "publishedAt": "2020-11-18T13:17:45Z", "content": "Beijing (AsiaNews/Agencies) – A COVID-19 vaccine is giving good results inducing a quick immune response, this according to a study published in the scientific journal The LancetInfectious Diseases.\r… [+1460 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Neil Murphy", "title": "NHS prepare to roll-out different Covid-19 jabs in new vaccine centres - Mirror Online", "description": "Professor Stephen Powis said the new vaccines would be rolled out as soon as they are approved by regulators and would be available through traditional routes and new vaccine centres", "url": "https://www.mirror.co.uk/news/uk-news/nhs-prepare-roll-out-different-23029581", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article23029851.ece/ALTERNATES/s1200/1_COBR-Data-Briefing.jpg", "publishedAt": "2020-11-18T12:41:00Z", "content": "The NHS is already preparing to deploy different coronavirus vaccines once they are approved by regulators, NHS's medical director has said.\r\nProfessor Stephen Powis said the programme would be rolle… [+3230 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Artificial intelligence-based tool may help diagnose opioid addiction earlier, finds study - ANI News", "description": "Washington [US], November 18 (ANI): A study published in Ecological Applications suggests that nature around one's home may help mitigate some of the negative mental health effects of the COVID-19 pandemic.", "url": "https://www.aninews.in/news/science/artificial-intelligence-based-tool-may-help-diagnose-opioid-addiction-earlier-finds-study20201118174241", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/asjdhjashjdsjhadshjdhjads-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-18T12:13:50Z", "content": "Washington [US], November 18 (ANI): Researchers have used machine learning, a type of artificial intelligence, to develop a prediction model for the early diagnosis of opioid use disorder.The advance… [+840 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "BI India Bureau", "title": "Chapare Virus — All you need to know about the deadly virus that causes hemorrhagic fever like Ebola - Business Insider India", "description": "The Centre for Disease Control and Prevention in the US said that the Chapare virus falls in the arenavirus category. It can spread through direct contact", "url": "https://www.businessinsider.in/science/health/news/what-is-chapare-virus-and-symptom-of-this-virus/articleshow/79282571.cms", "urlToImage": "https://www.businessinsider.in/photo/79282571/what-is-chapare-virus-and-symptom-of-this-virus.jpg?imgsize=540325", "publishedAt": "2020-11-18T11:36:00Z", "content": "It’s been one whole year since the first coronavirus case was reported in Wuhan, China – the pandemic that brought the world to a standstill. And now, there’s another virus called Chapare that has re… [+1625 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by Jahnavi Gupta", "title": "E-cigarette users may have increased susceptibility to Covid-19 - Hindustan Times", "description": "In a controlled study of smokers, nonsmokers, and e-cigarette users, University of North Carolina School of Medicine researchers found that e-cigarette users exhibited significantly altered immune responses to a model of influenza virus infection.", "url": "https://www.hindustantimes.com/health/e-cigarette-users-may-have-increased-susceptibility-to-covid-19/story-zhyH8QGE9k0EHlS7Q9EhYM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/18/Pictures/_12b1984c-298c-11eb-bd4c-84783e11e201.jpg", "publishedAt": "2020-11-18T10:58:03Z", "content": "In a controlled study of smokers, nonsmokers, and e-cigarette users, University of North Carolina School of Medicine researchers found that e-cigarette users exhibited significantly altered immune re… [+4653 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Aditi Murti", "title": "2021 Measles Outbreak Is Likely Due to Vaccine Delays: Experts - The Swaddle", "description": "The Covid19 pandemic and related lockdowns have caused families all over the world to fall behind on children’s vaccine schedules.", "url": "https://theswaddle.com/2021-measles-outbreak-is-likely-due-to-vaccine-delays-experts/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2020/11/MS1.jpg", "publishedAt": "2020-11-18T10:39:13Z", "content": "A measles outbreak is likely in 2021 due to disrupted vaccination schedules caused by the Covid19 lockdown, according to an article published in The Lancet. The scientists who authored the article ur… [+3103 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Karan Thapar", "title": "Oxford Vaccine May Better Fit India Than Pfizer's or Moderna's: Gagandeep Kang - The Wire Science", "description": "However, she expressed concerns about the manner in which the government planned to identify people falling into the four priority groups for vaccination.", "url": "https://science.thewire.in/the-sciences/oxford-vaccine-may-better-fit-india-than-pfizers-or-modernas-gagandeep-kang/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/26163744/gagandeep-kang.jpg", "publishedAt": "2020-11-18T10:29:00Z", "content": "Photo: YouTube.\r\nThe following is a paraphrased summary of Gagandeep Kangs interview to Karan Thapar for The Wire. It is not inaccurate but it has been recounted from memory; please watch the full in… [+5712 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Covid-19 from frozen food? | Firms need to be 'mature' in implementing job-sharing | THE BIG STORY - The Straits Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9cEs1bWZLRGNxZ0HSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-18T09:56:38Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "How smoking worsens Covid-19 infection decoded - Deccan Herald", "description": "Using lab-grown lung tissue, scientists have pinpointed how smoking cigarettes facilitates more severe lung infection by the novel coronavirus, an advance that may lead to new therapeutic strategies to help reduce smokers' chances of developing severe Covid-1…", "url": "https://www.deccanherald.com/science-and-environment/how-smoking-worsens-covid-19-infection-decoded-917094.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/18/2020-11-16t133436z180772964rc2d4k9x0hojrtrmadp3imperial-brands-resultsjpg-917094-1605704197.jpg", "publishedAt": "2020-11-18T09:31:48Z", "content": "Using lab-grown lung tissue, scientists have pinpointed how smoking cigarettes facilitates more severe lung infection by the novel coronavirus, an advance that may lead to new therapeutic strategies … [+2763 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Marnie Willman", "title": "Sugar in Semen Makes HIV Drugs Less Effective - The Wire Science", "description": "High levels of sugar can obstruct antivirals from linking with viruses.", "url": "https://science.thewire.in/the-sciences/sugar-in-semen-makes-hiv-drugs-less-effective/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/11/18072908/6813489183_0b1d983bfc_o-1.jpg", "publishedAt": "2020-11-18T09:29:00Z", "content": "Scanning electromicrograph of an HIV-infected T cell. Photo: NIAID.\r\nWell over half a million people die of HIV/AIDS each year, making it one of the leading causes of death in the world. According to… [+5068 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Researchers study family with coronavirus to find out why their children were immune | ABC News - ABC News (Australia)", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9cDhJQ0RFd0drY03SAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-18T07:52:06Z", "content": null}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Chinese Covid vax appears safe, induces immune response: Study - Daily Pioneer", "description": "A Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy volunteers aged 18 to 59 years in an early-phase randomised clinical trial, say researchers.\n\nAccording to the study, published in the journal The Lancet Infe…", "url": "https://www.dailypioneer.com/2020/pioneer-health/chinese-covid-vax-appears-safe--induces-immune-response--study.html", "urlToImage": "https://www.dailypioneer.com/uploads/2020/story/images/big/chinese-covid-vax-appears-safe--induces-immune-response--study-2020-11-18.jpg", "publishedAt": "2020-11-18T07:15:48Z", "content": "A Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy volunteers aged 18 to 59 years in an early-phase randomised clinical trial, say researchers.\r\nAcco… [+2598 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Alzheimers Disease Data Initiative launches new AD Workbench to foster greater global research innovation and accelerate breakthroughs in Alzheimers disease and related dementias - United News of India", "description": "SEATTLE, Nov. 18, 2020 /PRNewswire/ -- Launching today is the Alzheimer''s Disease Data Initiative (ADDI) and its Alzheimer''s disease (AD) Workbench, a cloud-based platform for scientists to accelerate discoveries and innovations for AD and related dementias…", "url": "http://www.uniindia.com/alzheimers-disease-data-initiative-launches-new-ad-workbench-to-foster-greater-global-research-innovation-and-accelerate-breakthroughs-in-alzheimers-disease-and-related-dementias/business-economy/news/2237447.html", "urlToImage": "", "publishedAt": "2020-11-18T05:48:00Z", "content": "More News19 Nov 2020 | 5:29 PMMUMBAI, India, Nov. 19, 2020 /PRNewswire/ -- Asphalt Autotech Private Limited (Protto) has raised a Seed stage round from a group of Angel Investors. Protto is a two whe… [+1893 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID-19 vaccines: 5 false myths to avoid and break away from - Times of India", "description": "While scientists and medical professionals are working hard to develop a clinically approved vaccine to treat patients and contain the spread of the virus, people are struggling to keep the vaccine-related mistruths at bay.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-19-vaccines-5-false-myths-to-avoid-and-break-away-from/photostory/79262095.cms", "urlToImage": "https://static.toiimg.com/photo/79262121.cms", "publishedAt": "2020-11-18T05:30:00Z", "content": "Surely, scientists and researchers are burning the midnight oil to develop a vaccine. Additionally, there's also an urgency in the need for a possible cure. However, just because the progress on deve… [+256 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Chinese Covid-19 vaccine candidate appears safe, induces immune response, preliminary study finds - Times of India", "description": "China News: BEIJING: Results from an early-phase clinical trial of a Chinese vaccine candidate, CoronaVac, revealed that the formulation appears safe and induces .", "url": "https://timesofindia.indiatimes.com/world/china/chinese-covid-19-vaccine-candidate-appears-safe-induces-immune-response-preliminary-study-finds/articleshow/79276117.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-79276097,width-1070,height-580,imgsize-171334,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-11-18T05:02:00Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Chinese Covid-19 Vaccine Candidate CoronaVac Appears Safe, Induces Immune Response, Preliminary Study Fin... - News18", "description": "According to the findings of the phase 1/2 randomised clinical trial, published in The Lancet Infectious Diseases journal, the vaccine candidate could induce an antibody response in participants within 28 days of the first immunisation, by giving two doses 14…", "url": "https://www.news18.com/news/world/chinese-covid-19-vaccine-candidate-coronavac-appears-safe-induces-immune-response-preliminary-study-finds-3091583.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605418527_vaccine-1.jpg", "publishedAt": "2020-11-18T04:59:16Z", "content": "Results from an early-phase clinical trial of a Chinese vaccine candidate, CoronaVac, revealed that the formulation appears safe and induces an antibody response in healthy volunteers aged 18 to 59 y… [+4454 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Shots Race Toward Finish Line in 300-Day Science Feat - NDTV", "description": "In early January, about the only thing the world's scientists knew for sure about the novel coronavirus was its genetic profile. Now, some 300 days later, vaccine developers are on the brink of a major victory against a pathogen that's inflicted untold person…", "url": "https://www.ndtv.com/world-news/covid-shots-race-toward-finish-line-in-300-day-science-feat-2326631", "urlToImage": "https://c.ndtvimg.com/2020-11/li5lkjsg_covid-vaccine_625x300_11_November_20.jpg", "publishedAt": "2020-11-18T03:51:45Z", "content": "Bringing a conventional vaccine from inception to market takes more than a decade on average.\r\nIn early January, about the only thing the world's scientists knew for sure about the novel coronavirus … [+7133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Include these foods in your daily diet to get healthy, glowing skin - The Indian Express", "description": "Ensure you incorporate these healthy foods in your diet to glow from \"inside out\"", "url": "https://indianexpress.com/article/lifestyle/life-style/winter-skincare-diet-foods-glowing-bright-skin-6995288/", "urlToImage": "https://images.indianexpress.com/2020/11/skincare_1200_getty.jpg", "publishedAt": "2020-11-18T03:22:35Z", "content": "By: Lifestyle Desk | New Delhi | \r\nUpdated: November 18, 2020 9:22:35 am\r\nEnsure your diet helps you tide over skincare troubles. (Source: Getty Images/Thinkstock)We all want our skin to glow and rem… [+2186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "China’s COVID-19 vaccine induces quick immune response within four weeks: Study - The Indian Express", "description": "While the early to mid-stage trials were not designed to assess the efficacy of CoronaVac, researchers said it could provide sufficient protection, based on their experience with other vaccines and data from preclinical studies with macaques.", "url": "https://indianexpress.com/article/coronavirus/chinas-covid-19-vaccine-induces-quick-immune-response-within-four-weeks-study-7055342/", "urlToImage": "https://images.indianexpress.com/2020/11/365969039.jpg", "publishedAt": "2020-11-18T03:06:37Z", "content": "By: Reuters | \r\nNovember 18, 2020 8:36:37 am\r\nA box of Sinovac Biotech Ltd. SARS-CoV-2 vaccine in Sao Paulo, Brazil, on Wednesday, Nov. 11, 2020. Brazil reversed its decision to suspend Sinovac coron… [+4492 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "‘Long Covid’ causing organ impairments in 70% of low-risk patients, says UK study - ThePrint", "description": "The study found that heart and lung impairment were just as prevalent in low-risk individuals with long Covid as the older counterparts.", "url": "https://theprint.in/health/long-covid-causing-organ-impairments-in-70-of-low-risk-patients-says-uk-study/545344/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/06/Covid-19-test-scaled-e1591854650355.jpg", "publishedAt": "2020-11-18T02:39:53Z", "content": "New Delhi: Almost 70 per cent of ‘low-risk’ Covid-19 patients have impairment in one or more organs four months after initial symptoms of SARS-CoV-2 infection, according to a new study from the UK.\r\n… [+3585 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Just 12 Minutes of Intense Exercise Is Enough to Change Biomarkers in Your Blood - ScienceAlert", "description": "Short bursts of exercise have more of an impact on our bodies than you might think: a new study shows that just 12 minutes of intense activity is enough to significantly change the biomarkers of metabolic health in people's blood.", "url": "https://www.sciencealert.com/just-12-minutes-of-intense-exercise-is-enough-to-change-biomarkers-in-your-blood", "urlToImage": "https://www.sciencealert.com/images/2020-11/processed/exercise-shoulders_1024.jpg", "publishedAt": "2020-11-18T00:19:51Z", "content": "Short bursts of exercise have more of an impact on our bodies than you might think: a new study shows that just 12 minutes of intense activity is enough to significantly change the biomarkers of meta… [+3427 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Miyoung Kim, Roxanne Liu", "title": "Sinovac's COVID-19 vaccine induces quick immune response - study - Reuters UK", "description": "Sinovac Biotech's <SVA.O> experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, preliminary trial results showed on Wednesday.", "url": "https://in.reuters.com/article/uk-health-coronavirus-sinovac-idUKKBN27X35I", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201117&t=2&i=1541560730&r=LYNXMPEGAG1X8&w=800", "publishedAt": "2020-11-17T23:45:00Z", "content": "SINGAPORE/BEIJING (Reuters) - Sinovac Biotech's SVA.O experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had r… [+3962 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Go easy on the eggs: 'Egg-cess' consumption linked to diabetes - Times of India", "description": "New research from the University of South Australia shows that excess egg consumption can increase your risk of diabetes. Conducted in partnership with the China Medical University, and Qatar University, the longitudinal study (1991 to 2009) is the first to a…", "url": "https://timesofindia.indiatimes.com/videos/news/go-easy-on-the-eggs-egg-cess-consumption-linked-to-diabetes/videoshow/79258899.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-79258899,imgsize-253722.cms", "publishedAt": "2020-11-17T22:30:00Z", "content": "Nov 18, 2020, 04:00AM ISTSource: ANINew research from the University of South Australia shows that excess egg consumption can increase your risk of diabetes. Conducted in partnership with the China M… [+830 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Survey: 80% of American Young Adults Depressed During Pandemic - Futurism", "description": "\"Addressing mental health and substance use problems in young adults, both during and after the COVID-19 pandemic, is an imperative.\"", "url": "https://futurism.com/neoscope/survey-80-percent-american-young-adults-depressed-pandemic", "urlToImage": "https://wp-assets.futurism.com/2020/11/survey-80-percent-american-young-adults-depressed-pandemic-768x403.jpg", "publishedAt": "2020-11-17T19:31:57Z", "content": "It goes without saying that the COVID-19 pandemic has devastated the United States so far, there have been over 11.2 million confirmed cases and 247,000 confirmed deaths in the country. But the pande… [+1869 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Brazil to receive first doses of China's Sinovac COVID-19 vaccine, says Butantan Institute - Devdiscourse", "description": "Read more about Brazil to receive first doses of China's Sinovac COVID-19 vaccine, says Butantan Institute on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1311262-brazil-to-receive-first-doses-of-chinas-sinovac-covid-19-vaccine-says-butantan-institute", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_11_2020_17_21_54_7118575.jpg?width=920&format=jpeg", "publishedAt": "2020-11-17T18:47:03Z", "content": "Brazil's Butantan Institute biomedical center will receive this week the first doses of China's Sinovac vaccine against COVID-19, its director, Dimas Covas, said on Tuesday, speaking remotely in a co… [+251 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Major measles outbreaks forecast for 2021 due to Covid: Study - Bangalore Mirror", "description": "Researchers have stressed that major measles outbreaks will likely occur in the wake of the Covid-19 pandemic as early as 2021 due to many missed vaccinations.", "url": "https://bangaloremirror.indiatimes.com/news/india/major-measles-outbreaks-forecast-for-2021-due-to-covid-study/articleshow/79268988.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-408834,msid-79269092/79269092.jpg", "publishedAt": "2020-11-17T17:30:00Z", "content": "Sydney, Researchers have stressed that major measles\r\n outbreaks will likely occur in the wake of the Covid-19 pandemic\r\n as early as 2021 due to many missed vaccinations\r\n.\r\nMeasles is a highly cont… [+2482 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Himani Chandna", "title": "6 in 10 diabetics in India worry about catching Covid, getting hospitalised, study finds - ThePrint", "description": "Study by market research firm Kantar also finds that more city residents are worried about uncontrolled blood sugar levels in general.", "url": "https://theprint.in/health/6-in-10-diabetics-in-india-worry-about-catching-covid-getting-hospitalised-study-finds/546299/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/04/diabetes.jpg", "publishedAt": "2020-11-17T15:11:07Z", "content": "New Delhi: Six in every 10 diabetics surveyed in India have expressed concern about catching Covid-19 and getting hospitalised for the disease, found a study by UK-based market research firm Kantar.\r… [+3623 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Do Ticks Prefer Humans or Dogs? - LiveScience", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9Y1RNa3ZtRkZkamvSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-17T14:44:30Z", "content": null}]}