{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Magnitude and durability of SARS-CoV-2 S-binding antibody titers in the pre-variant era among healthcare workers in NYC - News-Medical.Net", "description": "Researchers analyzed sera samples of 400 participants of the PARIS study to evaluate the risk of SARS-CoV-2 infection and seroreversion for an average of 84 days.", "url": "https://www.news-medical.net/news/20220404/Magnitude-and-durability-of-SARS-CoV-2-S-binding-antibody-titers-in-the-pre-variant-era-among-healthcare-workers-in-NYC.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709572_16490801187599009.jpg", "publishedAt": "2022-04-04T13:53:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers evaluated the magnitude and durability of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) spike (S)-binding antibody… [+5164 chars]"}, {"source": {"id": null, "name": "Thefreshtoast.com"}, "author": null, "title": "Doing This At Any Level Increases Your Risk Of Heart Disease, Finds Study - LA Weekly", "description": "The Fresh Toast - While alcohol can be associated with a variety of benefits, it seems likely that heart health is not one of them.   - News", "url": "https://thefreshtoast.com/news/doing-this-at-any-level-increases-your-risk-of-heart-disease-finds-study/", "urlToImage": "https://thefreshtoast.com/wp-content/uploads/2022/04/doing-this-at-any-level-increases-your-risk-of-heart-disease-e1648852253654.jpg", "publishedAt": "2022-04-04T13:30:48Z", "content": "Over the years, alcohol consumption has been linked with a variety of behaviors. While consuming it in large amounts has mostly resulted in negative outcomes, consuming it with discretion has been li… [+1666 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/TechExplorist/", "title": "A simple ECG can pinpoint the risk of mortality in hospitalized COVID-19 patients - Tech Explorist", "description": "Study identifies hospitalised COVID-19 patients at elevated mortality risk.", "url": "https://www.techexplorist.com/simple-ecg-pinpoint-risk-mortality-hospitalized-covid-19-patients/46222/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/04/ecg.jpg", "publishedAt": "2022-04-04T12:43:02Z", "content": "An electrocardiogram (ECG) records the electrical activity as it travels through the heart. The QT interval refers to the electrical signal from the moment the ventricles of the heart contract until … [+3676 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Symptomatic diabetic autonomic neuropathy common in adults with type 1 diabetes - Healio", "description": "About one in five adults with type 1 diabetes reports having symptomatic diabetic autonomic neuropathy, according to study findings published in the Journal of Diabetes and Its Complications. In findings from participants in the T1D Exchange clinic registry, …", "url": "https://www.healio.com/news/endocrinology/20220401/symptomatic-diabetic-autonomic-neuropathy-common-in-adults-with-type-1-diabetes", "urlToImage": "https://www.healio.com/~/media/slack-news/endocrinology/infographics/et0322mizokamistout_mm_graphic_01_web.jpg", "publishedAt": "2022-04-04T12:35:23Z", "content": "About one in five adults with type 1 diabetes reports having symptomatic diabetic autonomic neuropathy, according to study findings published in the Journal of Diabetes and Its Complications. \r\nIn fi… [+4042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Does eating avocados twice a week lower the risk of heart disease? Here’s what an expert says - The Indian Express", "description": "The study surveyed more than 68,000 women and 41,000 men, who were free of cancer, coronary heart disease and stroke at baseline, on their diets every four years, over a period of 30 years", "url": "https://indianexpress.com/article/lifestyle/health/eating-avocados-twice-a-week-lower-risk-heart-disease-health-study-7846140/", "urlToImage": "https://images.indianexpress.com/2022/03/Avocados-1200.jpg", "publishedAt": "2022-04-04T12:00:29Z", "content": "Avocadosare pear-shaped fruits that contain tons of essential vitamins like A, B, C, E, K and minerals such as copper, iron, potassium and magnesium, making them a healthy choice for consumption. In … [+2980 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Acute respiratory distress syndrome may increase death risk among young COVID-19 patients - News-Medical.Net", "description": "A new study estimated the risk and prevalence of acute respiratory distress syndrome in hospitalized young adults with SARS-CoV-2 infection.", "url": "https://www.news-medical.net/news/20220404/Acute-respiratory-distress-syndrome-may-increase-death-risk-among-young-COVID-19-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709542_16490731430956143.jpg", "publishedAt": "2022-04-04T11:56:00Z", "content": "A team of international scientists have recently estimated the risk and prevalence of acute respiratory distress syndrome (ARDS) in hospitalized young adults with severe acute respiratory syndrome co… [+4726 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Omicron variant less severe than Delta for children younger than 5 years: Study - The Tribune India", "description": "Children younger than five years who are infected with Omicron have less risk of severe health outcomes than those infected with the Delta variant of coronavirus, according to a study.", "url": "https://www.tribuneindia.com/news/health/omicron-variant-less-severe-than-delta-for-children-younger-than-5-years-study-383519", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_1024691666.jpg", "publishedAt": "2022-04-04T11:33:00Z", "content": "PTI\r\nWashington, April 4\r\nChildren younger than five years who are infected with Omicron have less risk of severe health outcomes than those infected with the Delta variant of coronavirus, according … [+2567 chars]"}, {"source": {"id": null, "name": "European Society of Cardiology"}, "author": null, "title": "How to prevent recurrent stroke when the cause is unknown - European Society of Cardiology", "description": "Your access to the latest cardiovascular news, science, tools and resources.", "url": "https://www.escardio.org/The-ESC/Press-Office/Press-releases/How-to-prevent-recurrent-stroke-when-the-cause-is-unknown", "urlToImage": "https://www.escardio.org/static_file/Escardio/Medias/common-library/logos/esc/ESC%20&%20Associations%20Lockup%20Vertical.jpg", "publishedAt": "2022-04-04T11:14:40Z", "content": "Copenhagen, Denmark – 4 April 2022:  Nearly one-third of patients with a stroke of unknown cause have a heart rhythm disorder that can be treated to prevent another stroke. That’s the finding of the … [+3441 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Adesola Mojo", "title": "Long COVID: Do symptoms differ by variant? - Verve Times", "description": "While new research suggests that symptoms linked to long COVID could vary depending on which COVID-19 variant a person is infected with, infectious disease experts say they are not completely convinced this is the case.\tThe data is", "url": "https://vervetimes.com/long-covid-do-symptoms-differ-by-variant/", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5846418.1649008069!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-04-04T11:09:44Z", "content": "While new research suggests that symptoms linked to long COVID could vary depending on which COVID-19 variant a person is infected with, infectious disease experts say they are not completely convinc… [+12676 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID infection: Signs you have a weak immune system - Times of India", "description": "A weak immune system is like a passive invitation for germs to invade our body. The body's sole defence mechanism, the immune system, always remains alert against foreign attack. It memorises the pathogen and protects the body from future attacks. Usually thi…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-infection-signs-you-have-a-weak-immune-system/photostory/90640606.cms", "urlToImage": "https://static.toiimg.com/photo/90640851.cms", "publishedAt": "2022-04-04T10:30:00Z", "content": "As per the data obtained from WHO reports, most of the people who contracted the novel coronavirus in 2020 developed antibodies 1-3 weeks after the symptoms started to show. \"Patients who have had mo… [+694 chars]"}, {"source": {"id": null, "name": "WJXT News4JAX"}, "author": "Danielle Gober, Ivanhoe Newswire", "title": "Navigating the highs and lows of cholesterol myths - WJXT News4JAX ", "description": "In the U.S., 12 percent of people 20 years or older have high cholesterol.", "url": "https://www.news4jax.com/health/2022/04/04/navigating-the-highs-and-lows-of-cholesterol-myths/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/SFMZKWPMOFB57JQSCJBPLFUMGI.jpg?_a=ATABld60", "publishedAt": "2022-04-04T10:00:00Z", "content": "In the U.S., 12% of people 20 years or older have high cholesterol. Awareness about cholesterol ranges from your primary care doctor to the honeybee on the side of your Cheerios box, but whats really… [+1500 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid raises risk of heart problems more than vaccine: CDC - ETHealthWorld", "description": "These findings, which were for both males and females in all age groups, supported the continued use of recommended mRNA Covid-19 vaccines among all eligible persons aged over 5 years, the CDC said in its latest weekly Morbidity and Mortality Weekly Report.", "url": "https://health.economictimes.indiatimes.com/news/industry/covid-raises-risk-of-heart-problems-more-than-vaccine-cdc/90638324", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-90638324,imgsize-7648,width-1200,height-628,overlay-ethealthworld/covid-raises-risk-of-heart-problems-more-than-vaccine-cdc.jpg", "publishedAt": "2022-04-04T09:30:00Z", "content": "The risk for cardiac complications was significantly higher after Covid-19 infection than after mRNA vaccination developed by Pfizer or Moderna against the deadly infectious disease, according to an … [+880 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Health Desk", "title": "10 benefits of low sodium diet that will help you in the longer run - India TV News", "description": "Sodium in any diet is a very tricky thing to maintain. A low sodium diet has many health benefits, while its excess intake can lend you to troublesome issues. It is believed that one should always consume sodium in moderate quantities, as it opens the door to…", "url": "https://www.indiatvnews.com/health/is-low-sodium-diet-good-for-health-here-are-10-benefits-that-will-help-you-in-the-longer-run-2022-04-04-767610", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/pjimage-30-1649060192.jpg", "publishedAt": "2022-04-04T09:24:29Z", "content": "Salt knowns as sodium chloride, act as a binder and stabilizer in food items. It is the best food preservative that keeps bacteria at bay. The human body requires salt for various body functions like… [+2072 chars]"}, {"source": {"id": null, "name": "Northglennews.co.za"}, "author": "garethd", "title": "Five tips to boost your eye health - Northglen News", "description": "Your eyes are your window to the world and therefore deserve to be well cared for and looked after in order to maintain a healthy vision…and that doesn’t start and end with a regular eye screening. Op", "url": "https://northglennews.co.za/285447/five-tips-to-boost-your-eye-health/", "urlToImage": "https://northglennews.co.za/wp-content/uploads/sites/51/2022/03/elanawagner-04-04-2022-health-eyecare-2.jpg", "publishedAt": "2022-04-04T09:12:56Z", "content": "Your eyes are your window to the world and therefore deserve to be well cared for and looked after in order to maintain a healthy visionand that doesnt start and end with a regular eye screening. Opt… [+2220 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Exercise could help reduce severity of serious cancer complication, finds study - Rising Kashmir", "description": "Researchers have identified yet another benefit of keeping up the exercise routine. A recent study has found that exercising prior to developing cancer was associated with slower tumor growth and helped reduce the effects of a cancer complication known as was…", "url": "https://www.risingkashmir.com/displaynews.aspx?news=103893", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637846347220849273_can-aerobic-exercises-shield-me-from-covid-19-complications-722x406.tmb-0.jpg", "publishedAt": "2022-04-04T09:07:23Z", "content": "Researchers have identified yet another benefit of keeping up the exercise routine. A recent study has found that exercising prior to developing cancer was associated with slower tumor growth and hel… [+2260 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Keep a check on fat levels in your blood! - Ahmedabad Mirror", "description": "#LONDON\nIncreased levels of blood fats, also known as lipids, in people with Type 2 diabetes and obesity are more harmful than previously thought, a new study has found.\nIn patients with metabolic diseases, elevated fat levels in the blood create stress in mu…", "url": "https://www.ahmedabadmirror.com/keep-a-check-on-fat-levels-in-your-blood/81827293.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1649010568323.jpg-org", "publishedAt": "2022-04-04T08:54:08Z", "content": "Lipids may up symptoms of diabetes, obesity \r\n#LONDONIncreased levels of blood fats, also known as lipids, in people with Type 2 diabetes and obesity are more harmful than previously thought, a new s… [+2257 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Irritable bowel syndrome: Causes, symptoms, treatment or tips to cure IBS - Hindustan Times", "description": "Irritable Bowel Syndrome is classified as a functional gastrointestinal disorder and is a chronic condition of the lower gastrointestinal tract that is a growing cause of concern among Indians today. Here's all you need to know about its causes, symptoms, tre…", "url": "https://www.hindustantimes.com/lifestyle/health/irritable-bowel-syndrome-causes-symptoms-treatment-or-tips-to-cure-ibs-101649060747644.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/04/1600x900/anatomy-g5c89e6e36_1280_1649060975433_1649060997159.png", "publishedAt": "2022-04-04T08:46:03Z", "content": "A very common health condition in India that affects the digestive system, irritable bowel syndrome or IBS is a mix of belly discomfort or pain and trouble with bowel habits: either going more or les… [+6525 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "HELEN HERNANDEZ", "title": "Can depression, anxiety and stress be treated with physical exercise? - OI Canadian", "description": "\"Over the past few years, with the pandemic, our anxious amygdala, the part of the brain that recognizes danger and puts us on high alert, has been on hyperalert, triggering a near-constant stress res", "url": "https://oicanadian.com/can-depression-anxiety-and-stress-be-treated-with-physical-exercise/", "urlToImage": "https://www.infobae.com/new-resizer/sXgHGrPPvHcB8cDJ0V-hT8s9T4I=/1200x628/filters:format(webp):quality(85)//cloudfront-us-east-1.images.arcpublishing.com/infobae/P5V2IJWIVBAKJESLZ4ODUTROX4.jpg", "publishedAt": "2022-04-04T08:11:55Z", "content": "When Jennifer Heisz She was in grad school, borrowed a friend’s rusty old bike, and ended up redirecting her career. At that time, she was studying neurosciencecognitive but, dissatisfied with the di… [+8879 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Insect-borne viruses like Zika, dengue may trigger next pandemic: WHO - News9 LIVE", "description": "Globally, the frequency and severity of epidemics of  Zika and dengue are growing, owing to a...", "url": "https://www.news9live.com/health/insect-borne-viruses-like-zika-dengue-may-trigger-next-pandemic-who-162686", "urlToImage": "https://media.news9live.com/h-upload/2022/04/04/275182-covid.jpg", "publishedAt": "2022-04-04T07:56:34Z", "content": "According to the World Health Organization (WHO), insect-borne viruses like Zika and dengue fever could be the source of the next pandemic. Dengue, yellow fever, chikungunya, and Zika are all serious… [+2749 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "New study sheds light on how people gained weight during COVID-19 pandemic - ANI News", "description": "Washington [US], April 4 (ANI): A new study has found that more people weighed in as obese during the first year of the COVID-19 pandemic than the previous year.", "url": "https://www.aninews.in/news/health/new-study-sheds-light-on-how-people-gained-weight-during-covid-19-pandemic20220404123713", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/obesiettty20210828095434202109111611392022021811482820220404065046-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-04T07:09:21Z", "content": "ANI | Updated: Apr 04, 2022 12:37 IST\r\nWashington [US], April 4 (ANI): A new study has found that more people weighed in as obese during the first year of the COVID-19pandemic than the previous year.… [+2639 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Low salt intake reduces HF symptoms, not ED visits: SODIUM-HF trial - Medical Dialogues", "description": "For longtime people with heart failure have been told to lower their salt intake, but until now...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/low-salt-intake-reduces-hf-symptoms-not-ed-visits-sodium-hf-trial-90918", "urlToImage": "https://medicaldialogues.in/h-upload/2021/05/14/153366-salt.jpg", "publishedAt": "2022-04-04T05:58:52Z", "content": "For longtime people with heart failure have been told to lower their salt intake, but until now there has been little scientific evidence behind the recommendation.\r\nLow salt intake was not associate… [+3875 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Want to eat guilt free? Take a look at these light foods - Play Crazy Game", "description": "If you're on a new diet that somehow restricts the amount of food you can eat, you know it's not easy to stay in line. Starving yourself is not recommended on any diet, after all, if you don't eat enough to sustain yourself you can end up making your health w…", "url": "https://playcrazygame.com/2022/04/04/want-to-eat-guilt-free-take-a-look-at-these-light-foods/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/frango.jpg", "publishedAt": "2022-04-04T04:59:59Z", "content": "If you’re on a new diet that somehow restricts the amount of food you can eat, you know it’s not easy to stay in line. Starving yourself is not recommended on any diet, after all, if you don’t eat en… [+2347 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Addiction to Online Streaming Affects Health; Experts Advise Balance - Sentinelassam - The Sentinel Assam", "description": "Other behavioural changes include increased dependence of caffeinated drinks and sometimes...", "url": "https://www.sentinelassam.com/life/addiction-to-online-streaming-affects-health-experts-advise-balance-585915", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/04/04/332052-binge-watching.jpg", "publishedAt": "2022-04-04T04:37:35Z", "content": "Rahul (name changed), a 23-year-old Delhi-based working professional, loved the online streaming services. It gave him the ease of watching premium original content from his couch, all for a yearly p… [+5111 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How to Avoid Risk of Headaches While Following the Keto Diet? - News18", "description": "Headache is a common symptom observed by those consuming keto diets. Also known as keto headache, it becomes a constant cause of worry for the first few weeks with the dieters.", "url": "https://www.news18.com/news/lifestyle/how-to-avoid-risk-of-headaches-while-following-the-keto-diet-4936160.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/protein-day-2022-2-164587346016x9.jpg", "publishedAt": "2022-04-04T04:30:47Z", "content": "The journey of losing weight is not easy. With work from home becoming our new normal, the sedentary lifestyle has once again found its way into our lives and has made us all bit lazy. Our physical m… [+2551 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "My five-year-old is now eligible for a COVID vaccine – should I get them immunised? - Devdiscourse", "description": "This risk far outweighed by the potential for adverse effects from the virus, including more severe and long-lasting heart inflammation stemming from infection.Much like a seatbelt, in the rare event that its needed to stave off the worst, Id much rather my c…", "url": "https://www.devdiscourse.com/article/health/1989307-my-five-year-old-is-now-eligible-for-a-covid-vaccine---should-i-get-them-immunised", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/20_11_2021_15_42_13_4150567.jpg?width=920&format=jpeg", "publishedAt": "2022-04-04T04:05:12Z", "content": "Since 2020, we've heard that COVID is mainly a problem for the elderly or vulnerable. Vaccines have dramatically improved their protection against the disease, but children and younger people – becau… [+4893 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Kevin Kunzmann", "title": "Rivaroxaban Benefits LER Patients Safely Regardless of Chronic Kidney Disease - MD Magazine", "description": "VOYAGER PAD subgroup analyses showed the anticoagulant reduced likelihood of hospitalization without increasing bleeding risk in patients with CKD.", "url": "https://www.hcplive.com/view/rivaroxaban-benefits-ler-patients-safely-chronic-kidney-disease", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/4234007874376ea88a7343def8b8918805e62ad3-620x618.png?fit=crop&auto=format", "publishedAt": "2022-04-04T03:32:29Z", "content": "A subgroup analysis from the VOYAGER PAD trial showed anticoagulant rivaroxaban (Xarelto) was associated with reduced coronary or peripheral events resulting hospitalization among patients with recen… [+2022 chars]"}, {"source": {"id": null, "name": "Thelatch.com.au"}, "author": "Jack Revell", "title": "Can You Be Immune to COVID? Why Some Will Never Catch It - The Latch", "description": "Scientists have long suspected that there are some people who are naturally immune to COVID. They appear to have genetic qualities that make their immune systems particularly adept at fighting the SARS-COV-2 virus.", "url": "https://thelatch.com.au/can-you-be-immune-to-covid/", "urlToImage": "https://thelatch.com.au/wp-content/uploads/2021/12/rapid-antigen-tests-free-australia-1-1200x630.jpg", "publishedAt": "2022-04-04T03:03:51Z", "content": "If you’ve yet to catch COVID-19, over two years into the pandemic that has swept the world, you may well be one of the rare people who are naturally immune to the disease.\r\nEither that or, as one Kor… [+5057 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Quit smoking: It may kill your chances of surviving a heart attack - Times Now", "description": "The study has also found that levels of Alpha-1 Anti Trypsin (A1AT)--a protein in the liver that protects the body's tissues--in smokers were 'significantly less' than in non-smokers.", "url": "https://www.timesnownews.com/health/quit-smoking-it-may-kill-your-chances-of-surviving-a-heart-attack-article-90631035", "urlToImage": "https://static.tnn.in/thumb/msid-90631035,imgsize-100,width-1280,height-720,resizemode-75/90631035.jpg", "publishedAt": "2022-04-04T00:49:00Z", "content": "TV Newsmakers Today: Gurmeet, Debina blessed with a baby girl, Urfi Javed gets a call from her ex, and more"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The effect of COVID-19 on the lung function of young adults - News-Medical.Net", "description": "Researchers evaluate whether SARS-CoV-2 infection has a negative impact on lung function in young adults who experienced mild to moderate COVID-19.", "url": "https://www.news-medical.net/news/20220403/The-effect-of-COVID-19-on-the-lung-function-of-young-adults.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709493_16490242825213262.jpg", "publishedAt": "2022-04-03T23:59:00Z", "content": "A reduced diffusion capacity in the pulmonary function of patients who have experienced severe coronavirus disease 2019 (COVID-19) has been widely reported, which has contributed to some of the sever… [+5490 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Mutations in Noncoding DNA Are Found to Protect the Brain From ALS - Neuroscience News", "description": "Mutations in the IL18RAP gene reduce inflammation and appears to protect the brain against ALS.", "url": "https://neurosciencenews.com/genetics-als-neuroprotection-20304/", "urlToImage": "https://neurosciencenews.com/files/2022/04/dna-als-neurosicnes-public.jpg", "publishedAt": "2022-04-03T23:24:03Z", "content": "Summary: Mutations in the IL18RAP gene reduce inflammation and appear to protect the brain against ALS.\r\nSource: Weizmann Institute of Science\r\nGenetic mutations linked to a disease often spell bad n… [+6221 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Bats carry some of the most virulent, but not the most dangerous zoonotic viruses - News-Medical.Net", "description": "A recent analysis reveals that bats harbor the most virulent zoonotic viruses when compared to birds.", "url": "https://www.news-medical.net/news/20220403/Bats-carry-some-of-the-most-virulent-but-not-the-most-dangerous-zoonotic-viruses.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709478_16489960491264298.jpg", "publishedAt": "2022-04-03T23:14:00Z", "content": "The current coronavirus disease 2019 (COVID-19) pandemic caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is considered a zoonotic pandemic, as SARS-CoV-2 has been transmitt… [+4847 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Ask a Doctor: Is There a Way to Help Prevent or Reverse Diabetes? - The Epoch Times", "description": "You have a tremendous power over how disease progresses or regresses in your body. If you're facing diabetes, these steps can make all the difference.", "url": "https://www.theepochtimes.com/ask-a-doctor-is-there-a-way-to-help-prevent-or-reverse-diabetes_4365490.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/03/15/shutterstock_1033367926.jpg", "publishedAt": "2022-04-03T20:00:38Z", "content": "Have you had a pre-diabetes scare? Are you looking to turn your health around before its too late? If so, you know better than anyone how scary it can be to hear that your blood sugar is dangerously … [+8227 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Compound From Cardamom Spice Can Kill Aggressive Triple-Negative Breast Cancer Cells - SciTechDaily", "description": "Study shows that compound from cardamom shows promise for treating aggressive breast cancer. Cardamonin — a natural compound found in the spice cardamom and other plants — could have therapeutic potential for triple-negative breast cancer, according to a new …", "url": "https://scitechdaily.com/compound-from-cardamom-spice-can-kill-aggressive-triple-negative-breast-cancer-cells/", "urlToImage": "https://scitechdaily.com/images/Cardamom-Spice.jpg", "publishedAt": "2022-04-03T18:15:42Z", "content": "Study shows that compound from cardamom shows promise for treating aggressive breast cancer.\r\nCardamonin — a natural compound found in the spice cardamom and other plants — could have therapeutic pot… [+3478 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "A prune—or six—a day may keep inflammation at bay - Medical Xpress", "description": "A study in postmenopausal people suggests eating nutrient-rich prunes every day may be beneficial to bone health, reducing inflammatory factors that contribute to osteoporosis. The research will be presented this week in Philadelphia at the American Physiolog…", "url": "https://medicalxpress.com/news/2022-04-pruneor-sixa-day-inflammation-bay.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/a-pruneor-sixa-day-may.jpg", "publishedAt": "2022-04-03T18:03:04Z", "content": "A study in postmenopausal people suggests eating nutrient-rich prunes every day may be beneficial to bone health, reducing inflammatory factors that contribute to osteoporosis. The research will be p… [+2647 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Alzheimer’s: these are the 3 metabolic warning signs at 35 that you should pay attention to - Code List", "description": "Alzheimer's accounts for 70% of the more than 50 million people who suffer from it. dementia, according to the World Health Organization. Consequently, it is the first type of mental diseases that can develop once dementia begins, therefore it is likely that …", "url": "https://codelist.biz/2022/04/03/alzheimers-these-are-the-3-metabolic-warning-signs-at-35-that-you-should-pay-attention-to/", "urlToImage": "https://www.terra.com.mx/u/fotografias/m/2022/4/1/f1280x720-36820_168495_5050.png", "publishedAt": "2022-04-03T16:29:46Z", "content": "Alzheimer’s accounts for 70% of the more than 50 million people who suffer from it. dementia, according to the World Health Organization. Consequently, it is the first type of mental diseases that ca… [+1931 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Increase Sees Half of Older Adults Die With Dementia Diagnosis - Technology Networks", "description": "A study has shown that nearly half of all older adults now die with a diagnosis of dementia listed on their medical record, up 36% from two decades ago.", "url": "https://www.technologynetworks.com/neuroscience/news/increase-sees-half-of-older-adults-die-with-dementia-diagnosis-360284", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/360284/increase-sees-half-of-older-adults-die-with-dementia-diagnosis-360284-640x360.jpg?cb=20220404", "publishedAt": "2022-04-03T15:22:30Z", "content": "Nearly half of all older adults now die with a diagnosis of dementia listed on their medical record, up 36% from two decades ago, a new study shows. \r\nBut that sharp rise may have more to do with bet… [+2700 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Eating Habits You Think Are Healthy But Could Be Harmful – 01/04/2022 - Play Crazy Game", "description": "Everyone knows and it's true: eating vegetables, reducing sugar intake and exercising regularly are healthy habits. In fact, they are among the practices recommended by the WHO (World Health Organization) to increase the quality — and the expectation — of lif…", "url": "https://playcrazygame.com/2022/04/03/eating-habits-you-think-are-healthy-but-could-be-harmful-01-04-2022-2/", "urlToImage": "https://conteudo.imguol.com.br/c/entretenimento/95/2022/03/31/habito-saudavel-alimentacao-low-carb-suco-verde-mulher-comendo-1648754103966_v2_615x300.jpg", "publishedAt": "2022-04-03T15:15:00Z", "content": "Everyone knows and it’s true: eating vegetables, reducing sugar intake and exercising regularly are healthy habits. In fact, they are among the practices recommended by the WHO (World Health Organiza… [+8088 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Zoe Weiner", "title": "The Plant-Based Fat That Can Help You Live Longer Is Also Great for Strengthening Your Skin Barrier - Well+Good", "description": "Dermatologists reveal six linoleic acid skin benefits, and explain why the ingredient is great for strangthening the skin barrier.", "url": "https://www.wellandgood.com/linoleic-acid-skin-benefits/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/04/GettyImages-1327623672.jpg", "publishedAt": "2022-04-03T15:08:00Z", "content": null}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Clara Olshansky", "title": "These Popular Drinks May Increase Cancer Risk, New Study Suggests — Eat This Not That - Eat This, Not That", "description": "There are some drinks that are better than others when it comes to preventing cancer. A new study shows the correlation.", "url": "http://www.eatthis.com/news-drinks-increase-cancer-risk/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/02/energy-drinks.jpg?quality=82&strip=all", "publishedAt": "2022-04-03T15:00:53Z", "content": "If you're grabbing a beverage on the go, unless you're specifically looking for organic or all-natural options, odds are you're going to end up drinking something with at least some ingredients you d… [+2608 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Robert Preidt", "title": "When Diabetes Strikes, Eye Exams Can Save Your Sight - HealthDay News", "description": "SUNDAY, April 3, 2022 (HealthDay News) -- Could an annual eye exam save your sight if you have diabetes? Most definitely, one vision expert says.\"Diabetes is known to alter the health of the blood vessels in the retina and these vascular changes do not cause …", "url": "https://consumer.healthday.com/b-4-3-diabetes-2657025557.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNzgxMTMwOS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3NTkzNDA2Mn0.uYwUnN_Y_FguyVHGfxGe0dq9pciGKHZ2t-oQ0buo7V8/image.jpg?width=1200&coordinates=0%2C64%2C0%2C64&height=600", "publishedAt": "2022-04-03T13:02:03Z", "content": "SUNDAY, April 3, 2022 (HealthDay News) -- Could an annual eye exam save your sight if you have diabetes? Most definitely, one vision expert says.\r\n\"Diabetes is known to alter the health of the blood … [+2572 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lack of sleep may increase unhealthy abdominal fat: Study - Times of India", "description": "Researchers from Mayo Clinic have found that lack of sleep and free access to food increases calorie consumption and fat accumulation, especially inside the belly. The findings of the research were published in the 'Journal of the American College of Cardiolo…", "url": "https://timesofindia.indiatimes.com/videos/news/lack-of-sleep-may-increase-unhealthy-abdominal-fat-study/videoshow/90623525.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90623525,imgsize-35172.cms", "publishedAt": "2022-04-03T10:22:39Z", "content": "Apr 03, 2022, 03:52PM ISTSource: ANIResearchers from Mayo Clinic have found that lack of sleep and free access to food increases calorie consumption and fat accumulation, especially inside the belly.… [+486 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Brain damage in infants can be prevented by stabilizing blood sugar level: Study - Devdiscourse", "description": "The treatment of low blood sugar in infancy can ward off long-term brain damage in infants, according to a recent clinical study.", "url": "https://www.devdiscourse.com/article/science-environment/1988691-brain-damage-in-infants-can-be-prevented-by-stabilizing-blood-sugar-level-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_04_2022_10_18_19_5629827.jpg?width=920&format=jpeg", "publishedAt": "2022-04-03T10:18:21Z", "content": "The treatment of low blood sugar in infancy can ward off long-term brain damage in infants, according to a recent clinical study. The findings of the study were published in the journal 'JAMA'.\r\nThe … [+3121 chars]"}, {"source": {"id": null, "name": "StarNewsOnline.com"}, "author": "Sydney Hoover, Wilmington Star-News", "title": "Another COVID-19 variant? Health officials say be aware of omicron BA.2, but don't panic - StarNewsOnline.com", "description": "The newest COVID-19 variant, a subvariant of omicron, is quickly becoming the dominant strain of the virus.", "url": "https://www.starnewsonline.com/story/news/2022/04/03/wilmington-residents-newest-covid-omicron-ba-2-variant/7233452001/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/06/03/NSTN/ba059711-f369-402f-bcab-e0f7d5d69651-ghows-NC-200919987-c07ba8ad.jpg?auto=webp&crop=3639,2047,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-04-03T10:00:19Z", "content": "As the newest variant of the coronavirus spreads quickly across the world, local health officials said while it’s important to be aware, the latest strain is not necessarily something to worry about … [+3316 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Explained: How COVID-19 causes severe brain inflammation and neuronal damage - News9 LIVE", "description": "Researchers have now discovered severe brain inflammation and injury, including cell destruction and ...", "url": "https://www.news9live.com/health/covid-19/explained-how-covid-19-causes-severe-brain-inflammation-and-neuronal-damage-162563", "urlToImage": "https://media.news9live.com/h-upload/2022/04/03/272286-webf070219ns14-1024x64011zon.jpg", "publishedAt": "2022-04-03T09:40:26Z", "content": "Patients who have had COVID-19 frequently complain of headaches, confusion, and other neurological symptoms. However, doctors are not sure how the disease targets the brain during infection. But now,… [+1327 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Fitness experts reveal effects of PCOS on skin, hair health - Hindustan Times", "description": "Polycystic Ovary Syndrome is the most common hormonal disturbance and women with PCOS often face unique challenges with their skin and hair health which leads to depression and lack of confidence. Health experts share a few skin and hair issues linked to PCOS…", "url": "https://www.hindustantimes.com/lifestyle/health/fitness-experts-reveal-effects-of-pcos-on-skin-hair-health-101648782657776.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/01/1600x900/dermatologist-g39caa2cda_1280_1648783292601_1648783309715.png", "publishedAt": "2022-04-03T08:58:00Z", "content": "Polycystic Ovary Syndrome (PCOS) is one of the most common endocrine disorders among women of reproductive age that affects at least one in every 10 women in India and its symptoms include missed, ir… [+5421 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Exercise may reduce depression, boost effects of therapy, says study - PTC News", "description": "Exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and increase the benefits of therapy, according to a new study led published in the journal, 'Frontiers In Psychiatry'.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://ptcnews-wp.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/04/Exercise-benefits-people-with-depression-1.jpg", "publishedAt": "2022-04-03T08:10:36Z", "content": "Washington, April 3: Exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and increase the benefits of therapy, according to a new study led published in… [+2538 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Breast cancer: Experts list the symptoms of the most prevalent tumour in India - Times Now", "description": "Lumps in the breast are the most common symptom of breast cancer.", "url": "https://www.timesnownews.com/health/breast-cancer-experts-list-the-symptoms-of-the-most-prevalent-tumour-in-india-article-90621205", "urlToImage": "https://static.tnn.in/thumb/msid-90621205,imgsize-100,width-1280,height-720,resizemode-75/90621205.jpg", "publishedAt": "2022-04-03T07:14:00Z", "content": "TV Newsmakers Today: Gurmeet, Debina blessed with a baby girl, Urfi Javed gets a call from her ex, and more"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "A new drug multiplies survival in women with metastatic breast cancer - Code List", "description": "In the history of small accumulated victories, which is the fight against cancer, trastuzumab is an example of ingenuity. Team from the International Breast Cancer Center (IBCC) in Barcelona that has led the new study. Photo: The Country of Spain. The Destiny…", "url": "https://codelist.biz/2022/04/03/a-new-drug-multiplies-survival-in-women-with-metastatic-breast-cancer/", "urlToImage": "https://medicinaysaludpublica.blob.core.windows.net.optimalcdn.com/images/2022/04/01/sacs-5-cda907b3-focus-0-0-688-364-e58ab36e.jpg", "publishedAt": "2022-04-03T06:56:40Z", "content": "In the history of small accumulated victories, which is the fight against cancer, trastuzumab is an example of ingenuity.\r\n Team from the International Breast Cancer Center (IBCC) in Barcelona that h… [+2727 chars]"}, {"source": {"id": null, "name": "Cityspidey.com"}, "author": null, "title": "5 common vitamin deficiencies and how to increase their intake - CitySpidey.com", "description": "Every vitamin and mineral has a unique effect on the human body that is essential for good health", "url": "https://www.cityspidey.com/news/17147/5-common-vitamin-deficiencies-and-how-to-increase-their-intake", "urlToImage": "https://cityspideynews.s3.amazonaws.com/uploads/spidey/202204/vitamin-deficiencies-cover-1648964200.webp", "publishedAt": "2022-04-03T05:38:36Z", "content": "Every vitamin and mineral has a unique effect on the human body that is essential for good health. Many of them do not stay in the body for a long time(for various reasons) and sometimes, one needs t… [+4299 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Quinoa to Curd: 5 Things Vegetarians Must Add In Their Diet - India.com", "description": "What people don’t realise is that vegetarians have a lot of protein enriched food items too. Their nutritional content is usually higher and affordable.", "url": "https://www.india.com/health/quinoa-to-curd-5-things-vegetarians-must-add-in-their-diet-5317074/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/04/pjimage-2022-04-03T101826.776.jpg", "publishedAt": "2022-04-03T04:49:55Z", "content": "A lot of people believe that vegetarians are losing out protein as their choices are very limited. For non-vegetarians, their major source of protein is chicken, salmon and eggs. What people dont rea… [+1410 chars]"}, {"source": {"id": null, "name": "Eastafricanewspost.com"}, "author": "Phyllis Ward", "title": "The continued increase in the rate of positivity for COVID-19 puts it this Saturday at 7.25%. - East Africa News Post", "description": "For the seventh day in a row, it was a positive rate COVID-19 In Puerto Rico, its percentage rose to 7.25% today, Saturday, according to the Ministry of", "url": "https://www.eastafricanewspost.com/the-continued-increase-in-the-rate-of-positivity-for-covid-19-puts-it-this-saturday-at-7-25/", "urlToImage": null, "publishedAt": "2022-04-03T03:25:56Z", "content": "For the seventh day in a row, it was a positive rate COVID-19 In Puerto Rico, its percentage rose to 7.25% today, Saturday, according to the Ministry of Health.\r\nThis percentage indicates that the le… [+2776 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Boost immune system: Eat more oily fish and reduce added sugar or saturated fat - Verve Times", "description": "Immunologist Doctor Jenna Macciochi, on behalf of Berocca spoke exclusively with Express.co.uk to offer her tips when it comes to the best and worst foods for keeping your immunity strong no matter the season.Your immune system is your greatest healt", "url": "https://vervetimes.com/boost-immune-system-eat-more-oily-fish-and-reduce-added-sugar-or-saturated-fat/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1590070.jpg", "publishedAt": "2022-04-03T03:14:04Z", "content": "Immunologist Doctor Jenna Macciochi, on behalf of Berocca spoke exclusively with Express.co.uk to offer her tips when it comes to the best and worst foods for keeping your immunity strong no matter t… [+1300 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David R Clark et al., The Conversation", "title": "Why You Don't Need to Feel Sore After a Workout to Know if You've Exercised Enough - ScienceAlert", "description": "\"No pain, no gain\" is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you've done enough.", "url": "https://www.sciencealert.com/why-you-don-t-need-to-feel-sore-a-workout-to-know-if-you-ve-exercised-enough", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/PersonDeadLiftsWeights_1024.jpg", "publishedAt": "2022-04-03T03:01:08Z", "content": "\"No pain, no gain\" is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you've done enough.\r\nTh… [+4676 chars]"}, {"source": {"id": null, "name": "Zyri.net"}, "author": "Zyri", "title": "Influenza Virus: Flu vaccination begins in the region - Zyri", "description": "The Ministry of Health of the province of Buenos Aires announced that as of the first Monday of April, the flu vaccination 2022 for pregnant people, boys and girls from 6 to 24 months of age. Also to those between 24 and 36 months who present risk factors. Th…", "url": "https://www.zyri.net/2022/04/02/influenza-virus-flu-vaccination-begins-in-the-region/", "urlToImage": "https://tn.com.ar/resizer/GuXDC4zNB-Bos_9v7uaDbuoTdyw=/1023x0/smart/filters:quality(60)/cloudfront-us-east-1.images.arcpublishing.com/artear/O4UIIGKJ2ZEOJJDDHWJF5BDCCQ.jpg", "publishedAt": "2022-04-02T23:17:05Z", "content": "The Ministry of Health of the province of Buenos Aires announced that as of the first Monday of April, theflu vaccination 2022 for pregnant people, boys and girls from 6 to 24 months of age. Also to … [+2872 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Kuldeep Singh", "title": "What makes Alzheimer’s patients drowsy? - Revyuh", "description": "Extreme drowsiness during the day is a common sign of Alzheimer's disease, but what causes it? We now have an answer thanks to a recent study. Even after", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/what-makes-alzheimers-patients-drowsy/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/04/What-makes-Alzheimers-patients-drowsy.jpg", "publishedAt": "2022-04-02T23:15:13Z", "content": "Extreme drowsiness during the day is a common sign of Alzheimer’s disease, but what causes it? We now have an answer thanks to a recent study.\r\nEven after a full night’s sleep, many persons with Alzh… [+3678 chars]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Matt Hoffman", "title": "SAGE-718 Demonstrates Safety, Signs of Improvement in Phase 2 Alzheimer Disease Study - Neurology Live", "description": "Sage Therapeutics’ investigational NMDA receptor positive allosteric modulator was well-tolerated, with signs of cognitive and functional improvements reported for patients with AD in the phase 2 LUMINARY study.", "url": "https://www.neurologylive.com/view/sage-718-demonstrates-safety-improvement-phase-2-alzheimer-disease-study", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/68dd9993297c50393f3eef388c0b83e3e6a8e00d-300x300.png?fit=crop&auto=format", "publishedAt": "2022-04-02T22:59:59Z", "content": "According to data presented at the 2022 American Academy of Neurology (AAN) Annual Meeting, April 2-7, in Seattle, Washington, the investigational SAGE-718, a first-in-class positive allosteric modul… [+6035 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Patrice Wendling and Catherine Hackett", "title": "POISE-3 Backs Wider Use of TXA in Noncardiac Surgery - Medscape", "description": "", "url": "https://www.medscape.com/viewarticle/971483", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_190128_surgeon_operation_800x450.jpg", "publishedAt": "2022-04-02T22:43:21Z", "content": "The antifibrinolytic tranexamic acid (TXA) reduced serious bleeding without a significant effect on major vascular outcomes in patients undergoing noncardiac surgery at risk for these complications i… [+8861 chars]"}, {"source": {"id": null, "name": "Wire19.com"}, "author": null, "title": "egnite, Inc. Announces Data from the Largest Contemporary Analysis of Valvular Heart Disease Prevalence in the United States - Latest Digital Transformation Trends | Cloud News - Wire19", "description": "– Data to Be Presented at 2022 ACC Annual Meeting Demonstrate Valve Disease is More Common in Women in the U.S. – – Other Key Findings Suggest Tricuspid and Mitral Regurgitation Have Highest Prevalence Rates; Severe Mitral Regurgitation Diagnosed More Frequen…", "url": "https://wire19.com/egnite-inc-announces-data-from-the-largest-contemporary-analysis-of-valvular-heart-disease-prevalence-in-the-united-states/", "urlToImage": null, "publishedAt": "2022-04-02T21:34:57Z", "content": "– Data to Be Presented at 2022 ACC Annual Meeting Demonstrate Valve Disease is More Common in Women in the U.S. –\r\n– Other Key Findings Suggest Tricuspid and Mitral Regurgitation Have Highest Prevale… [+5269 chars]"}, {"source": {"id": null, "name": "Dicksonpost.com"}, "author": "MOHSEN HASANIN, M.D", "title": "New guidelines could help prevent colon cancer in younger patients - Dickson Post", "description": "Colon cancer is the third-most common type of cancer and the third-leading cause of cancer death in both men and women, but it doesn’t have to be. As a gastroenterologist,", "url": "https://www.dicksonpost.com/lifestyles/new-guidelines-could-help-prevent-colon-cancer-in-younger-patients/article_e8393470-abd6-11ec-9848-6f1238d704b2.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/dicksonpost.com/content/tncms/assets/v3/editorial/a/7a/a7a6e028-abd7-11ec-bc11-e763b9c00a84/623d15780bd53.image.jpg?crop=1288%2C676%2C0%2C466&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-04-02T20:30:00Z", "content": "Colon cancer is the third-most common type of cancer and the third-leading cause of cancer death in both men and women, but it doesnt have to be. As a gastroenterologist, I believe colonoscopies are … [+2351 chars]"}, {"source": {"id": null, "name": "D1softballnews.com"}, "author": "Zach", "title": "A study explains why people with allergic asthma are less susceptible to severe COVID-19 - D1SoftballNews.com", "description": "Researchers at the University of North Carolina at Chapel Hill in the United States have revealed the biological reasons for how COVID-19 progresses and why a certain population of asthma patients is", "url": "https://d1softballnews.com/a-study-explains-why-people-with-allergic-asthma-are-less-susceptible-to-severe-covid-19/", "urlToImage": "https://images2.listindiario.com/n/content/716/715563/p/680x460/202204021703061.png", "publishedAt": "2022-04-02T19:39:38Z", "content": "Researchers at the University of North Carolina at Chapel Hill in the United States have revealed the biological reasons for how COVID-19 progresses and why a certain population of asthma patients is… [+4978 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Diltiazem not effective in patients with angina, nonobstructive CAD - Healio", "description": "WASHINGTON &mdash; In the first randomized trial of a therapy for treatment of patients with angina and nonobstructive CAD, diltiazem did not improve coronary vasomotor dysfunction compared with placebo. For the EDIT-CMD trial, researchers randomly assigned 8…", "url": "https://www.healio.com/news/cardiology/20220402/diltiazem-not-effective-in-patients-with-angina-nonobstructive-cad", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/fm_im/w/woman-with-heart-attack_adobe.jpeg", "publishedAt": "2022-04-02T19:37:21Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nWASHINGTON — In the first randomized tri… [+5941 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Y. Lee", "title": "Tweet Claims Vitamin D Deficiency Is ‘One Of The More Serious Issues Of Our Time’ - Forbes", "description": "\"Vitamin D\" was trending on Twitter, after a Twitterer claimed that Vitamin D deficiency is overlooked. Here was the response.", "url": "https://www.forbes.com/sites/brucelee/2022/04/02/tweet-claims-vitamin-d-deficiency-is-one-of-the-more-serious-issues-of-our-time/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62488dcd1b7085e94f7fe7c1/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-04-02T18:09:36Z", "content": "\"Vitamin D\" was trending on Twitter after a Twitterer made a claim about Vitamin D deficiency. ... [+] (Photo: Getty)\r\ngetty\r\nWhats one of the more serious issues of our time? Pollution and climate c… [+5126 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Maddy Biddulph", "title": "6 probiotic foods to support your gut - Livescience.com", "description": "Including these probiotic foods in your diet can help your gut microbes to flourish", "url": "https://www.livescience.com/6-probiotic-foods-to-support-your-gut", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kv56vQMZWFmAVvSuezg9dk-1200-80.jpg", "publishedAt": "2022-04-02T15:52:59Z", "content": "Want to know which probiotic foods to eat to improve your health and wellbeing? As well as breaking down foods and absorbing nutrients, the gut has a massive impact on how well the body and mind work… [+5018 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "How to Completely Abandon Alcohol Consumption ⋆ Ceng News - Ceng News", "description": "Excessive consumption of alcohol can have negative consequences for your body, mind, and daily life.\"The negative effects on the body,", "url": "https://www.cengnews.com/news/how-to-completely-abandon-alcohol-consumption-382449.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/04/1648908320_woman-bed-alcohol-nearby.jpg", "publishedAt": "2022-04-02T14:07:53Z", "content": "Excessive consumption of alcohol can have negative consequences for your body, mind, and daily life.\r\n“The negative effects on the body, brain, and mind are irreversible” at some point, according to … [+6483 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Detox foods that speed up metabolism and help with weight loss - Play Crazy Game", "description": "If you do a search for lists of foods that help to lose weight and detoxify the body, you will come across different types of foods that, in addition to contributing to weight loss, are quite nutritious. See too: Strawberry and oatmeal healthy drink recipe fo…", "url": "https://playcrazygame.com/2022/04/02/detox-foods-that-speed-up-metabolism-and-help-with-weight-loss/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/02/cha-verde.jpg", "publishedAt": "2022-04-02T13:56:54Z", "content": "If you do a search for lists of foods that help to lose weight and detoxify the body, you will come across different types of foods that, in addition to contributing to weight loss, are quite nutriti… [+2223 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists use new CRISPR gene-editing approach to find paths toward possible HIV cure - News-Medical.Net", "description": "Scientists at Northwestern Medicine are using new advances in CRISPR gene-editing technology to uncover new biology that could lead to longer-lasting treatments and new therapeutic strategies for Human Immunodeficiency Virus (HIV).", "url": "https://www.news-medical.net/news/20220401/Scientists-use-new-CRISPR-gene-editing-approach-to-find-paths-toward-possible-HIV-cure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/CRISPR_locus_on_DNA_sequence-Catalin_Rusnac_51742dddb09c41d2924841b1b4decc7a-620x480.jpg", "publishedAt": "2022-04-02T03:32:00Z", "content": "Scientists at Northwestern Medicine are using new advances in CRISPR gene-editing technology to uncover new biology that could lead to longer-lasting treatments and new therapeutic strategies for Hum… [+4744 chars]"}]}