{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "How Covid-19 differs from other infectious lung diseases at cell-level decoded - ETHealthworld.com", "description": "In the study, published in the journal Nature, scientists analysed over 6,50,000 cells from patients who had died of severe Covid-19, acute bacterial pneumonia, or bacterial or influenza-related acute respiratory distress syndrome, and from those who had had …", "url": "https://health.economictimes.indiatimes.com/news/industry/how-covid-19-differs-from-other-infectious-lung-diseases-at-cell-level-decoded/81758803", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-81758803,imgsize-521625,width-800,height-434,overlay-ethealthworld/how-covid-19-differs-from-other-infectious-lung-diseases-at-cell-level-decoded.jpg", "publishedAt": "2021-03-30T09:54:24Z", "content": "Using advanced analysis tools, scientists have revealed at single-cell resolution, how the novel coronavirus infection affects lung tissue in severe cases, compared to other diseases which affect the… [+2231 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Diabetes drug may be new weapon against HIV - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/health/diabetes-drug-may-be-new-weapon-against-hiv-232180", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/3/2021_3$largeimg_480129718.jpg", "publishedAt": "2021-03-30T09:51:00Z", "content": "New York, March 30 \r\nA team of researchers has discovered an important vulnerability of the AIDS-causing retrovirus HIV, and has shown in preclinical experiments that a widely used diabetes drug, met… [+2054 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "New test can detect COVID-19 even after mutation - Health Europa", "description": "A new COVID-19 diagnostic test has been developed that can detect the virus even after it has mutated.", "url": "https://www.healtheuropa.eu/new-test-can-detect-covid-19-even-after-mutation/107114/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2021/03/©-iStock-solarseven.jpg", "publishedAt": "2021-03-30T09:16:56Z", "content": "A team of scientists led by Nanyang Technological University, Singapore (NTU Singapore) has developed the test called the VaNGuard (Variant Nucleotide Guard), which uses CRISPR gene-editing technolog… [+2896 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Unable To Fall Asleep? Try These 5 Expert-Recommended Foods And Drinks For Better Sleep - NDTV", "description": "A healthy diet and lifestyle can help you get adequate sleep. Here are some foods and drinks you can add to your diet for better sleep.", "url": "https://www.ndtv.com/health/unable-to-fall-asleep-try-these-5-expert-recommended-foods-and-drinks-for-better-sleep-2402140", "urlToImage": "https://c.ndtvimg.com/2020-07/k2b6kpa8_sleep_625x300_30_July_20.jpg", "publishedAt": "2021-03-30T08:36:59Z", "content": "Drinking chamomile tea can help you ensure better sleep\r\nHighlights\r\n<ul><li>Inadequate sleep can affect your heart health\r\n</li><li>A healthy sleep schedule can help you ensure optimal health\r\n</li>… [+3015 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "World will need new vaccines to fight coronavirus in a year, say major scientists - WION", "description": "A survey of epidemiologists and virologists has revealed that the planet has less than a year before new vaccines are needed to fight coronavirus. The first-generation of the vaccine could be rendered ineffective in less than year, with scientists urging for …", "url": "https://www.wionews.com/science/world-will-need-new-vaccines-to-fight-coronavirus-in-a-year-say-major-scientists-374249", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/03/03/185318-covid-vaccine.jpg", "publishedAt": "2021-03-30T08:35:18Z", "content": "A survey of epidemiologists and virologists has revealed that the planet has less than a year before new vaccines are needed to fight coronavirus. The first-generation of the vaccine could be rendere… [+1710 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID vs. Allergies: Here's how you can differentiate between the two - Times of India", "description": "The novel coronavirus has and continues to cause a lot of chaos and panic in and around the world. The ever-expanding list of symptoms and long term implications has triggered a sense of fear and confusion, making people question even the small episodes of co…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-vs-allergies-heres-how-you-can-differentiate-between-the-two/photostory/81757154.cms", "urlToImage": "https://static.toiimg.com/photo/81757180.cms", "publishedAt": "2021-03-30T08:30:00Z", "content": "The most accurate way to find out whether you're suffering from COVID-19 or not is by getting yourself tested for the same. It is important that you be absolutely sure about the source of symptoms so… [+586 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Abantika Ghosh", "title": "UK Covid variant not more infectious than Indian strain: NIV-Pune’s pre-print animal study - ThePrint", "description": "This is contrary to advisories from several health authorities, published peer-reviewed papers.", "url": "https://theprint.in/health/uk-covid-variant-not-more-infectious-than-indian-strain-niv-punes-pre-print-animal-study/630829/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/08/Covid-e1601955414347.jpg", "publishedAt": "2021-03-30T08:20:16Z", "content": "New Delhi: Turning available scientific advice from multiple health authorities across the world on its head, researchers at the National Institute of Virology in Pune have concluded that the UK vari… [+5221 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "World Bipolar Day 2021: All You Need to Know About Mental Disorder - News18", "description": "The birth anniversary of famous painter Vincent van Gogh is celebrated as World Bipolar Day on March 30.", "url": "https://www.news18.com/news/lifestyle/world-bipolar-day-2021-all-you-need-to-know-about-mental-disorder-3587660.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1617088255_world-bipolar-day1-image-shutterstock.jpg", "publishedAt": "2021-03-30T07:11:57Z", "content": "The birth anniversary of famous painter Vincent van Gogh is celebrated as World Bipolar Day on March 30. The mental disorder is not as talked about as other issues like depression, anxiety, and PTSD.… [+1886 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "UCLA to study vaccine efficacy in healthcare workers - BollyInside", "description": "What You Need To Know UCLA received a $4.9 million grant from the CDC to study the effectiveness of COVID-19 vaccines among health care workers, the", "url": "https://www.bollyinside.com/news/ucla-to-study-vaccine-efficacy-in-healthcare-workers/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-03-30T06:57:42Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "The Hindu BusinessLine", "title": "Scientists develop new concept to slow down future pandemics - BusinessLine", "description": "Researchers at the National Institute of Standards and Technology (NIST) have developed an encrypted method that can be applied to a device, including cellphones, to help with the ultimate goal of slo", "url": "https://www.thehindubusinessline.com/news/scientists-develop-new-concept-to-slow-down-future-pandemics/article34195927.ece", "urlToImage": "https://www.thehindubusinessline.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2021-03-30T06:51:03Z", "content": "Researchers at the National Institute of Standards and Technology (NIST) have developed an encrypted method that can be applied to a device, including cellphones, to help with the ultimate goal of sl… [+1631 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Listening To Music Triggers Brain Same As Cocaine, Study Finds - India Times", "description": "Of all the things that can bring us happiness, music has a special place for many. Whether it’s listening to a new favourite song over and over again, or listening to your favourite sad songs while going through a breakup, it hits you right at the spot.      …", "url": "https://www.indiatimes.com/technology/science-and-future/music-brain-study-beer-cocaine-reward-537278.html", "urlToImage": "https://im.indiatimes.in/content/2021/Mar/Facebook-Image-89_6062bd6f94040.jpg", "publishedAt": "2021-03-30T06:32:14Z", "content": "Of all the things that can bring us happiness, music has a special place for many. Whether its listening to a new favourite song over and over again, or listening to your favourite sad songs while go… [+2358 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Shalini Ojha", "title": "Pfizer, Moderna's coronavirus vaccines effective even after first dose: Study | NewsBytes - NewsBytes", "description": "The vaccines developed by American pharma giant Pfizer, with Germany's BioNTech, and the one produced by Moderna, another United States company, reduce the risk of infection even after the first dose, a study has found | NewsBytes", "url": "https://www.newsbytesapp.com/news/world/pfizer-moderna-s-vaccines-work-even-after-first-dose/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l73320210330104049.png", "publishedAt": "2021-03-30T05:37:50Z", "content": "<li>The coronavirus vaccines developed by American pharma giant Pfizer, with Germany's BioNTech, and the one manufactured by Moderna, another United States company, reduce the risk of infection even … [+2061 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can COVID-19 cause diabetes? Here's what you should know - Times of India", "description": "Diabetes is considered a comorbidity for COVID-19 patients. For some patients, however, it can result in a diabetes diagnosis!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-can-covid-19-cause-diabetes-heres-what-you-should-know/photostory/81735594.cms", "urlToImage": "https://static.toiimg.com/photo/81735707.cms", "publishedAt": "2021-03-30T05:30:00Z", "content": "From anecdotal evidence which has emerged so far, a lot of patients have reportedly developed diabetes either during their infection or after recovery.\r\nOver eight studies, involving more than 3700 C… [+663 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Health benefits of physical activity in outdoors and the effects of air pollution - News-Medical.Net", "description": "Physical activity is important in preventing heart and blood vessel disease in young people so long as they don't undertake very strenuous activity on days when air pollution levels are high, according to a nationwide study of nearly 1.5 million people publis…", "url": "https://www.news-medical.net/news/20210330/Outdoor-physical-activity-during-increased-air-pollution-may-offset-its-beneficial-effects.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/Air_pollution%2c_closeup_of_one_big_smoking_pipe_-_Anastasiia_Tymoshenko_A1_8bf7a1a99f724b6ebc4bed3c25c9868c-620x480.jpg", "publishedAt": "2021-03-30T05:14:00Z", "content": "Physical activity is important in preventing heart and blood vessel disease in young people so long as they don't undertake very strenuous activity on days when air pollution levels are high, accordi… [+6778 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Positive impact of robotic-assisted surgery on colorectal cancer - Express Healthcare", "description": "Dr Venkatesh Munikrishnan, Consultant Colorectal Surgeon & Robotic Surgeon, Chennai Colorectal Clinic & Apollo Hospitals, Chennai explains how robotic surgery offers advantages like precise dissection, steadiness, a three-dimensional surgical view and more pr…", "url": "https://www.expresshealthcare.in/specials/cancer/positive-impact-of-robotic-assisted-surgery-on-colorectal-cancer/427941/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2021/03/30102423/Dr-Venkatesh-Munikrishnan.jpg", "publishedAt": "2021-03-30T04:55:46Z", "content": "Surgical procedures and techniques have been evolving over centuries. The last few decades have seen a phenomenal change in the technologies that are used to assist surgeons in the operating room. Th… [+4374 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Maharashtra: 3,144 new COVID-19 cases in Thane, 10 more deaths - Economic Times", "description": "With the addition of3,144 new cases of coronavirus, the infection count in Maharashtra's Thane district has gone up to 3,12,705, an official said on Tuesday.", "url": "https://economictimes.indiatimes.com/news/india/maharashtra-3144-new-covid-19-cases-in-thane-10-more-deaths/articleshow/81753563.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81753543,width-1070,height-580,imgsize-205868,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-30T04:44:00Z", "content": "With the addition of3,144 new cases of coronavirus, the infection count in Maharashtra's Thane district has gone up to 3,12,705, an official said on Tuesday. Besides these new cases reported on Monda… [+511 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Study finds diabetes patients to benefit from new 3D bio-printing technique for bone repair - EdexLive", "description": "Researchers have developed a technique that produces 3D bioprinted bone-repair 'scaffolds' that are infused with bone marrow stem cells, bone morphogenic protein-4 and macrophage", "url": "https://www.edexlive.com/news/2021/mar/30/study-finds-diabetes-patients-to-benefit-from-new-3d-bio-printing-technique-for-bone-repair-19397.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/3/30/w600X390/bone.jpg", "publishedAt": "2021-03-30T04:31:00Z", "content": "Bone defect is a serious problem for people with diabetes after fractures, but a new technique involving 3D bioprinting of a 'scaffold' for bone repair offers for the first time a way to overcome suc… [+3193 chars]"}, {"source": {"id": null, "name": "Dailyhawker.com"}, "author": "Nehita Abraham", "title": "How to Prevent a Heart Attack in Minimum Time - Daily Hawker - Daily Hawker", "description": "Heart ailments are acquiring epidemic proportions, accounting for 2.1 million deaths yearly. In men aged between 35 and 44, it’s the biggest killer after accidents. A combination of a sedentary lifestyle, ignorance, poverty, poor diet, smoking, ageing, stress…", "url": "https://www.dailyhawker.com/health-fitness/how-to-prevent-a-heart-attack-in-minimum-time/", "urlToImage": "https://www.dailyhawker.com/wp-content/uploads/2021/03/heart-attach.jpg", "publishedAt": "2021-03-30T03:53:00Z", "content": "Heart ailments are acquiring epidemic proportions, accounting for 2.1 million deaths yearly. In men aged between 35 and 44, its the biggest killer after accidents. A combination of a sedentary lifest… [+6755 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": null, "title": "COMMENT: Covid-19 vaccines: public health, private interests - Newspaper - DAWN.COM - DAWN.com", "description": "Checkout for the Latest and Top News from Pakistan and around the world", "url": "https://www.dawn.com/", "urlToImage": "http://www.dawn.com/_img/social-default.jpg", "publishedAt": "2021-03-30T02:17:25Z", "content": "The apex court set aside the judgements of a sessions court as well as the Lahore High Court in a 1993 murder case.\r\nUpdated30 Mar, 202107:32am\r\nChanges expected in federal cabinet before April 1; so… [+1346 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Reuters", "title": "India's Covid-19 vaccination drive picks up pace; follow-up doses not far away with new centres - Deccan Herald", "description": "Asli Bai Sayat, 72, had to travel for two hours on a camel cart to get her first coronavirus vaccine shot in Rajasthan but she may not have to go so far for the follow-up dose. After a slow start, India is picking up the pace of its immunisation campaign, sim…", "url": "https://www.deccanherald.com/national/indias-covid-19-vaccination-drive-picks-up-pace-follow-up-doses-not-far-away-with-new-centres-968183.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/03/30/2021-03-30t010105z444777372rc2dlm947qzzrtrmadp3health-coronavirus-india-vaccinejpg-968183-1617068510.jpg", "publishedAt": "2021-03-30T01:41:50Z", "content": "Asli Bai Sayat, 72, had to travel for two hours on a camel cart to get her first coronavirus vaccine shot in Rajasthan but she may not have to go so far for the follow-up dose.\r\nAfter a slow start, I… [+4098 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: Is low carb diet the key to weight loss? Find out - Times of India", "description": "When it comes to losing weight, a low-carb diet is what most people resort to. Considering carbohydrates have the potential to spike up our blood sugar levels and also lead to weight gain, many choose to keep it off.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/weight-loss-is-low-carb-diet-the-key-to-weight-loss-find-out/photostory/81709064.cms", "urlToImage": "https://static.toiimg.com/photo/81709075.cms", "publishedAt": "2021-03-30T01:30:00Z", "content": "According to a weight loss study, low-carb diets have the same effectiveness as compared to a low-fat diet. However, it was found that the volunteers felt more terrible after resorting to a diet that… [+702 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Easier process, more centres: India pushes ahead with covid vaccination drive - Mint", "description": "After a slow start, India is picking up the pace of its immunisation campaign", "url": "https://www.livemint.com/news/world/india-pushes-ahead-with-coronavirus-vaccination-drive-to-head-off-new-surge-11617066801244.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/370287381_0-9_1616715876780_1617066878612.jpg", "publishedAt": "2021-03-30T01:16:17Z", "content": "Asli Bai Sayat, 72, had to travel for two hours on a camel cart to get her first coronavirus vaccine shot in the Indian desert state of Rajasthan but she may not have to go so far for the follow-up d… [+4255 chars]"}, {"source": {"id": null, "name": "Swarajya"}, "author": "R Jagannathan", "title": "It’s Not Covid Versus Humans: Why We Need A Dharmic Approach To Deal With The Virus - Swarajya", "description": "Abrahamic solutions may not work. If they do in the short term, they will only end up storing larger problems.", "url": "https://swarajyamag.com/ideas/its-not-covid-versus-humans-why-we-need-a-dharmic-approach-to-deal-with-the-virus", "urlToImage": "https://images.assettype.com/swarajya%2F2021-03%2F4ca3cf63-eda9-4b90-b290-f569a7f6573e%2F2020_05_25__3_.png?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-03-29T23:48:00Z", "content": "India appears to be spooked again by growing Covid numbers, which crossed 68,000 in daily additions on Sunday, 28 March. Already, the worst-affected states like Maharashtra have imposed ineffectual m… [+6131 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Evidence mounts Covid jab protects those around you - BBC News", "description": "Out-of-date information may be deterring people from being vaccinated.", "url": "https://www.bbc.com/news/health-56514470", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/119BA/production/_117722127_gettyimages-1221463264.jpg", "publishedAt": "2021-03-29T23:36:30Z", "content": "By Rachel SchraerHealth reporter \r\nimage copyrightGetty Images\r\nThe Covid-19 vaccine blocks pretty much all cases of serious illness - but the government has been much more cautious about saying whet… [+4155 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "East Hampton Goes Up To ‘Orange’ COVID Alert Level, But Health Official Says ‘Stay Alert’ - BollyInside", "description": "The state Department of Public Health reported that through last week, the town has reported 717 cases of the COVID virus since the pandemic began just", "url": "https://www.bollyinside.com/news/east-hampton-goes-up-to-orange-covid-alert-level-but-health-official-says-stay-alert/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-03-29T22:28:49Z", "content": "The state Department of Public Health reported that through last week, the town has reported 717 cases of the COVID virus since the pandemic began just over a year ago. While that may be cause for so… [+2235 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Kelsie Sandoval", "title": "Don't shun Dr. Google - researching mysterious symptoms online is actually a good idea, study finds - Business Insider India", "description": "People who searched for symptoms online were more likely to give an accurate diagnosis, according to a new study. Doctors say searching for symptoms online", "url": "https://www.businessinsider.in/science/health/news/dont-shun-dr-google-researching-mysterious-symptoms-online-is-actually-a-good-idea-study-finds/articleshow/81751064.cms", "urlToImage": "https://www.businessinsider.in/photo/81751064/dont-shun-dr-google-researching-mysterious-symptoms-online-is-actually-a-good-idea-study-finds.jpg?imgsize=856462", "publishedAt": "2021-03-29T21:45:00Z", "content": "If you diagnosis an illness after searching for symptoms online, your hypothesis may be accurate, according to a new report. \r\nThe study, conducted at Brigham and Women's Hospital and Harvard Medical… [+1914 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Rock County Public Health Reports Variant Strain of COVID-19 | COVID-19 - BollyInside", "description": "Researchers believe this new strain spreads more rapidly and easily than the original strain, the health department said. The B.1.1.7 variant may also be", "url": "https://www.bollyinside.com/news/rock-county-public-health-reports-variant-strain-of-covid-19-covid-19/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-03-29T18:47:59Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Jennifer T Grier, The Conversation", "title": "Yes, you should get a vaccine even if you’ve already had the coronavirus - Scroll.in", "description": "An immunologist explains why getting the jab makes sense.", "url": "https://scroll.in/article/990792/yes-you-should-get-a-vaccine-even-if-youve-already-had-the-coronavirus", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/152282-zxliykwqgk-1608472253.jpg", "publishedAt": "2021-03-29T18:00:00Z", "content": "A few weeks ago, a message popped up in the corner of my screen. What do you think about people who have recently had Covid19 getting the vaccine? A friend of mine was eligible for a Covid19 vaccine,… [+5484 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "Gum infection linked to elevated blood pressure - India TV News", "description": "Adults with periodontitis, a severe gum infection, may be significantly more likely to have higher blood pressure (BP) compared to individuals who had healthy gums, a new study revealed.", "url": "https://www.indiatvnews.com/health/gum-infection-linked-to-elevated-blood-pressure-694290", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/03/blood-pressure-1617035659.jpg", "publishedAt": "2021-03-29T16:35:44Z", "content": "Image Source : FILE IMAGEGum infection linked to elevated blood pressure\r\nAdults with periodontitis, a severe gum infection, may be significantly more likely to have higher blood pressure (BP) compar… [+2066 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Mike Stobbe", "title": "COVID vaccine found highly effective in real-world US study - The Associated Press", "description": "NEW YORK (AP) — The U.S. government’s first look at the real-world use of COVID-19 vaccines found their effectiveness was nearly as robust as it was in controlled studies. The two vaccines...", "url": "https://apnews.com/article/us-news-new-york-coronavirus-pandemic-57cde25de803c98503c5ff9937598420", "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff901752d1b546fe8c227abe43cd6301/3000.jpeg", "publishedAt": "2021-03-29T15:41:17Z", "content": "NEW YORK (AP) The U.S. governments first look at the real-world use of COVID-19 vaccines found their effectiveness was nearly as robust as it was in controlled studies.\r\nThe two vaccines available si… [+3383 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "Pakistan launches anti-polio drive amid surge in coronavirus - DTNext", "description": "Pakistan on Monday launched a five-day vaccination campaign against polio despite facing another surge of coronavirus cases, the second anti-polio drive in 2021 as the country struggles to eradicate the crippling children's disease.", "url": "http://www.dtnext.in/News/World/2021/03/29205646/1283957/Pakistan-launches-antipolio-drive-amid-surge-in-coronavirus.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Mar/202103292056465831_Pakistan-launches-antipolio-drive-amid-surge-in-coronavirus_SECVPF.gif", "publishedAt": "2021-03-29T15:32:34Z", "content": "Pakistan on Monday launched a five-day vaccination campaign against polio despite facing another surge of coronavirus cases, the second anti-polio drive in 2021 as the country struggles to eradicate … [+32 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Why are half of America’s children with mental health problems left untreated? – Consumer health News - BollyInside", "description": "Lack of treatment for kids who struggle with depression, anxiety and/or several adverse childhood experiences is more severe among children of parents", "url": "https://www.bollyinside.com/news/why-are-half-of-americas-children-with-mental-health-problems-left-untreated-consumer-health-news/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-03-29T15:18:15Z", "content": "Lack of treatment for kids who struggle with depression, anxiety and/or several adverse childhood experiences is more severe among children of parents with only high school-level educations and child… [+3605 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "A broken heart can cause stress to the brain - Study - Times Now", "description": "Did you know the technical term for the term \"broken heart\"? It is known as the Takotsubo syndrome (TTS), which is a Japanese name.", "url": "https://www.timesnownews.com/health/article/a-broken-heart-can-cause-stress-to-the-brain-study/738585", "urlToImage": "https://imgk.timesnownews.com/story/broken-heart-2318143_1920.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-29T14:50:59Z", "content": "<ul><li>The Takotsubo syndrome (TTS) is commonly known as the \"broken heart\" sndrome</li></ul>\r\n<ul><li>Takotsubo syndrome (TTS) has temporary effects on the heart</li></ul>\r\n<ul><li>Takotsubo syndro… [+6361 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Researchers tell us reasons behind tooth pain and hypersensitivity and methods to treat it - Times Now", "description": "Toothache and sensitivity can be extremely bothersome and uncomfortable. Furthermore, they can also be an indicator of an unhealthy mouth.", "url": "https://www.timesnownews.com/health/article/researchers-tell-us-reasons-behind-tooth-pain-and-hypersensitivity-and-methods-to-treat-it/738580", "urlToImage": "https://imgk.timesnownews.com/story/teeth-5536858_1920.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-29T14:04:58Z", "content": "<ul><li>Tooth sensitivity can be triggered by consumption of anything cold or hot</li></ul>\r\n<ul><li>Change in weather can also trigger toothache and hypersensitivity</li></ul>\r\n<ul><li>Persistent to… [+4433 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "The role of benzothiazole analogs in the treatment of tuberculosis - EurekAlert", "description": "This book will help to get the glimpse on tuberculosis disease and the wide information to carry out further research on benzothiazole as an anti-TB drug.", "url": "https://www.eurekalert.org/pub_releases/2021-03/bsp-tro032921.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-29T13:54:10Z", "content": "Tuberculosis is a serious infectious disease, which is caused by the Mycobacterium tuberculosis, generally it affects the lungs. Tuberculosis is spread from one person to another through microscopic … [+3519 chars]"}, {"source": {"id": null, "name": "Zawya.com"}, "author": "Vishwadha Chander", "title": "Moderna says shipped 100mln COVID-19 vaccine doses to United States - ZAWYA", "description": "U.S. government has this week hit the accelerator on its shipments of COVID-19 vaccines", "url": "https://www.zawya.com/mena/en/life/story/Moderna_says_shipped_100mln_COVID19_vaccine_doses_to_United_States-TR20210329nL4N2LR2ZBX1/", "urlToImage": "https://www.zawya.com/images/cia/zAmp/200611115726VYEZ.jpg", "publishedAt": "2021-03-29T13:33:43Z", "content": "Moderna Inc said on Monday it has shipped 100 million doses of its COVID-19 vaccine to the United States, of which 88 million have been delivered to date in the first quarter of 2021.\r\nThe company ex… [+802 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "Researchers identify two novel variants in SARS-CoV-2 gene sequences collected from mink - BusinessLine", "description": "Canadian researchers have found two novel variants in SARS-CoV-2 gene sequences collected from mink in the US.The team identified a two-mutation (N501T-G142D) variant and a three-mutation (N501T-G142D", "url": "https://www.thehindubusinessline.com/news/science/researchers-identify-two-novel-variants-in-sars-cov-2-gene-sequences-collected-from-mink/article34189794.ece", "urlToImage": "https://www.thehindubusinessline.com/todays-paper/tp-others/tp-variety/51k42f/article33389363.ece/ALTERNATES/LANDSCAPE_615/WPbl22bmptjUGPF83DP8G3jpgjpg", "publishedAt": "2021-03-29T11:18:30Z", "content": "Canadian researchers have found two novel variants in SARS-CoV-2 gene sequences collected from mink in the US.\r\nThe team identified a two-mutation (N501T-G142D) variant and a three-mutation (N501T-G1… [+1604 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "Press Trust of India", "title": "COVID-19 variants from Brazil, South Africa less susceptible to antibodies: Research - Express Healthcare", "description": "The study noted that vaccination or recovery from COVID-19 may offer reduced protection from SARS-CoV-2 variants B.1.351 and P.1", "url": "https://www.expresshealthcare.in/covid19-updates/covid-19-variants-from-brazil-south-africa-less-susceptible-to-antibodies-research/427935/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2020/02/13151722/corona-1.jpg", "publishedAt": "2021-03-29T10:56:59Z", "content": "Variants of novel coronavirus which were first reported in South Africa and Brazil are less efficiently inhibited by antibodies from recovered patients and vaccinated individuals, a new study confirm… [+1790 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Jahnavi Sarma", "title": "Don’t reach for a cup of coffee if you are pregnant: It can lead to smaller babies, miscarriage and more - TheHealthSite", "description": "Pregnant women who consume coffee are more likely to have smaller babies than others who did not consume caffeinated beverages.", "url": "https://www.thehealthsite.com/pregnancy/dont-reach-for-a-cup-of-coffee-if-you-are-pregnant-it-can-lead-to-smaller-babies-miscarriage-and-more-804715/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2021/03/Coffee-1-1024x576-1-655x353.jpg", "publishedAt": "2021-03-29T10:19:00Z", "content": "Pregnant women are advised not to have coffee. This is not because of any superstition or misplaced good intentions. There are scientific reasons why you must not reach for your morning cup of coffee… [+3988 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "Food preservatives in processed foods harm body’s immune system: Study - BusinessLine", "description": "Food preservatives present in the processed foods may harm the body’s immune system, according to a new study.The findings suggested that the preservative tert-butylhydroquinone, or TBHQ, can harm the", "url": "https://www.thehindubusinessline.com/news/science/food-preservatives-in-processed-foods-harm-bodys-immune-system-study/article34189227.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/igvrth/article34189226.ece/ALTERNATES/LANDSCAPE_615/food29", "publishedAt": "2021-03-29T10:03:16Z", "content": "Food preservatives present in the processed foods may harm the bodys immune system, according to a new study.\r\nThe findings suggested that the preservative tert-butylhydroquinone, or TBHQ, can harm t… [+1242 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "Covid-19 long haulers face persistent neurological symptoms: Study - BusinessLine", "description": "Most common symptom was brain fog, involving memory problems, lack of mental clarity, inability to focus; study’s long haulers were mostly women, with an average age of 43", "url": "https://www.thehindubusinessline.com/news/national/covid-19-long-haulers-face-persistent-neurological-symptoms-study/article34188741.ece", "urlToImage": "https://www.thehindubusinessline.com/news/national/50rk2z/article34188740.ece/ALTERNATES/LANDSCAPE_615/PY29COVIDVACCINE2jpg", "publishedAt": "2021-03-29T08:51:12Z", "content": "Covid-19 long haulers may face persistent neurological symptoms, according to a study published in the journal Annals of Clinical and Translational Neurology.\r\nThe researchers intended to monitor Cov… [+1557 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "Antibody levels, duration of immunity vary in Covid-19 survivors - BusinessLine", "description": "A study published in the journal Lancet, revealed that antibody levels and the duration of immunity may differ in Covid-19 survivors.The study is titled Dynamics of SARS-CoV-2 neutralizing antibody re", "url": "https://www.thehindubusinessline.com/news/science/antibody-levels-duration-of-immunity-vary-in-covid-19-survivors/article34188290.ece", "urlToImage": "https://www.thehindubusinessline.com/news/national/mtd8xk/article34147303.ece/ALTERNATES/LANDSCAPE_615/Covid24", "publishedAt": "2021-03-29T07:40:53Z", "content": "A study published in the journal Lancet, revealed that antibody levels and the duration of immunity may differ in Covid-19 survivors.\r\nThe study is titled Dynamics of SARS-CoV-2 neutralizing antibody… [+1418 chars]"}, {"source": {"id": null, "name": "TRT World"}, "author": "TRTWorld", "title": "WHO report says animals likely source of Covid-19 – latest updates - TRT World", "description": "Covid-19 has infected more than 128 million people and taken some 2.79 million lives. Here are virus-related developments for March 29.", "url": "https://www.trtworld.com/life/pakistan-s-president-defence-minister-test-covid-positive-latest-updates-45407", "urlToImage": "https://cdni0.trtworld.com/w480/h270/q75/102170_20212903PAKAlvi_1617041088693.jpg", "publishedAt": "2021-03-29T06:41:01Z", "content": "Covid-19 has infected more than 128 million people and taken some 2.79 million lives. Here are virus-related developments for March 29.\r\nPakistan's President Arif Alvi (L) inspects the guard of honou… [+21973 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "PTI", "title": "2 new cases take COVID-19 tally of Andamans to 5,046 - Millennium Post", "description": "Port Blair:  The COVID-19 tally of Andaman and Nicobar Islands rose to 5,046 on Monday as two more...", "url": "http://www.millenniumpost.in/nation/2-new-cases-take-covid-19-tally-of-andamans-to-5046-435745", "urlToImage": "http://www.millenniumpost.in/h-upload/2021/03/29/557287-3852uuygj08r82rdtbbgn0ffcey4ibcwvtpy7191036.jpg", "publishedAt": "2021-03-29T05:53:16Z", "content": "Port Blair: The COVID-19 tally of Andaman and Nicobar Islands rose to 5,046 on Monday as two more persons tested positive for the infection, a health official said.\r\nOne more person has been cured of… [+387 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Explained: Can COVID-19 cause infertility in men and women? - Times of India", "description": "The potential long-term impact of the COVID-19 virus on the reproductive health of men and women is still unclear.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/explained-can-covid-19-cause-infertility-in-men-and-women/articleshow/81708661.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81708647,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-68069/81708647.jpg", "publishedAt": "2021-03-29T05:30:00Z", "content": "The outbreak of 2019 novel coronavirus disease (COVID-19) has become a major pandemic threat worldwide.\r\nThe potential long-term impact of the COVID-19 virus on the reproductive health of men and wom… [+3874 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "ruchika", "title": "Janssen gets positive CHMP opinion for Ponvory for treating relapsing forms of multiple sclerosis in... - Medical Dialogues", "description": "Belgium: The Janssen Pharmaceutical Companies of Johnson & Johnson has announced that the European...", "url": "https://medicaldialogues.in/news/industry/pharma/janssen-gets-positive-chmp-opinion-for-ponvory-for-treating-relapsing-forms-of-multiple-sclerosis-in-adults-75972", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/27/150673-janssen.jpg", "publishedAt": "2021-03-29T04:30:41Z", "content": "Belgium: The Janssen Pharmaceutical Companies of Johnson &amp; Johnson has announced that the European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) has issued a posi… [+3559 chars]"}, {"source": {"id": null, "name": "Orissadiary.com"}, "author": null, "title": "New study finds strong immune response following Pfizer vaccination - Odisha Diary", "description": "New Delhi: Initial findings from the largest and most in-depth study on the immune response following Covid-19 vaccination, has been published today. The study, involving experts from Newcastle Uni…", "url": "https://orissadiary.com/new-study-finds-strong-immune-response-following-pfizer-vaccination/", "urlToImage": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2021/03/First-responders-vaccines-full-size.jpg?fit=1200%2C600&ssl=1", "publishedAt": "2021-03-29T03:16:15Z", "content": "New Delhi: Initial findings from the largest and most in-depth study on the immune response following Covid-19 vaccination, has been published today.\r\nThe study, involving experts from Newcastle Univ… [+4753 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Sumi Sukanya Dutta", "title": "Two cities take up study on reinfections - The New Indian Express", "description": "Authorities have decided to look for IgG antibodies in newly infected people in the two cities, and this will be the first such exercise in the country.", "url": "https://www.newindianexpress.com/nation/2021/mar/29/amid-rising-covid-19-cases-across-india-pune-and-chennaitake-up-study-on-reinfections-2282966.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/3/29/w600X390/Mumbai_COVID-19_Situation_AP.jpg", "publishedAt": "2021-03-29T01:50:00Z", "content": "NEW DELHI: Amid an exponential surge of Covid-19 cases in the country, two cities Chennai and Pune that witnessed a high case burden last year and are facing resurgence, have undertaken studies to as… [+2848 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Metabolic changes in patients with lupus linked to vitamin D deficiency - Bangalore Mirror", "description": "Researchers believe that boosting vitamin D levels may improve control of these cardiovascular risk factors, as well as improving long-term outcomes for patients with systemic lupus erythematosus (SL", "url": "https://bangaloremirror.indiatimes.com/opinion/you/metabolic-changes-in-patients-with-lupus-linked-to-vitamin-d-deficiency/articleshow/81739783.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-358530,msid-81739782/81739782.jpg", "publishedAt": "2021-03-29T00:30:00Z", "content": "The findings of a new study reveal that patients\r\n with lupus\r\n are more likely to have metabolic syndrome and insulin resistance, which are both the factors linked to heart disease if they have lowe… [+1876 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Whitman County Public Health: Residents Should Avoid Social Gatherings | - BollyInside", "description": "The agency also encouraged residents to delay travel and advised them to comply with the Center for Disease Control’s current COVID-19 travel advisory", "url": "https://www.bollyinside.com/news/whitman-county-public-health-residents-should-avoid-social-gatherings/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-03-28T22:17:13Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Sify News"}, "author": "ANI", "title": "Iraq reports 5,271 new COVID-19 cases, 832,428 in total - Sify News", "description": "Baghdad [Iraq], March 29 (ANI/Xinhua): The Iraqi Ministry of Health reported on Sunday 5,271 new coronavirus cases, raising the total nationwide infections to 832,428.", "url": "https://www.sify.com/news/iraq-reports-5271-new-covid-19-cases-832428-in-total-news-international-vd2uTiadgdcca.html", "urlToImage": "https://www.sify.com/images/news-183x123.jpg", "publishedAt": "2021-03-28T20:55:08Z", "content": "Baghdad [Iraq], March 29 (ANI/Xinhua): The Iraqi Ministry of Health reported on Sunday 5,271 new coronavirus cases, raising the total nationwide infections to 832,428."}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Towards finding a cure for malaria - The Hindu", "description": "UoH research team’s novel findings published in a reputed journal", "url": "https://www.thehindu.com/news/cities/Hyderabad/towards-finding-a-cure-for-malaria/article34185613.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2021-03-28T18:46:47Z", "content": "Malaria is a life-threatening disease caused by malarial parasite Plasmodium falciparum transmitted among humans through bites of infected female Anopheles mosquitoes. It continues to be a serious th… [+2187 chars]"}, {"source": {"id": null, "name": "Lokmat.com"}, "author": "ANI", "title": "Correcting altered brain circuit may tackle coinciding obesity and depression, claims study - Lokmat", "description": "Researchers at the Baylor College of Medicine have identified and characterised a novel neural circuit that mediates the reciprocal control of obesity and depression in mouse models and potential therapy.The research has found that obesity and mental disorder…", "url": "https://english.lokmat.com/technology/correcting-altered-brain-circuit-may-tackle-coinciding-obesity-and-depression-claims-study/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/dmsdsdnmasdmsdmasdmasdmasd_S0E3XDk_202103.jpg", "publishedAt": "2021-03-28T15:49:33Z", "content": "Correcting altered brain circuit may tackle coinciding obesity and depression, claims study\r\nResearchers at the Baylor College of Medicine have identified and characterised a novel neural circuit tha… [+4240 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Italy reports 297 coronavirus deaths and 19,611 new cases - Mint", "description": "Some 272,630 coronavirus tests were carried out in the space of 24 hours, compared with a previous 357,154, the health ministry said", "url": "https://www.livemint.com/news/world/italy-reports-297-coronavirus-deaths-and-19-611-new-cases-11616945577951.html", "urlToImage": "https://images.livemint.com/img/2021/03/28/600x338/2020-06-29T170401Z_1_LYNXMPEG5S1QJ_RTROPTP_3_HEALTH-CORONAVIRUS-ITALY-CRISANTI_1594006027478_1616945867549.JPG", "publishedAt": "2021-03-28T15:39:59Z", "content": "Italy reported 297 coronavirus-related deaths on Sunday against 380 the day before, while the daily tally of new infections fell to 19,611 from 23,839.Some 272,630 coronavirus tests were carried out … [+770 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Neetu Chandra Sharma", "title": "CPCB asks sewage water treatment plants to adopt Covid-19 precautions - Mint", "description": "Taking cognisance of various studies conducted across India wherein viral RNA of SARS CoV2 was found in sewage water, the CPCB is planning to convene a meeting next week to review covid-19 related guidelines for workers in the sewage treatment plants", "url": "https://www.livemint.com/news/india/cpcb-asks-sewage-water-treatment-plants-to-adopt-covid-19-precautions-11616940066991.html", "urlToImage": "https://images.livemint.com/img/2021/03/28/600x338/WaterTreatment1_4C_--621x414_1616940801055.jpg", "publishedAt": "2021-03-28T14:15:18Z", "content": "The Central Pollution Control Board (CPCB) has asked sewage water treatment plants to ensure adopting all covid-19 precautions for its workers to protect them from SARS CoV2 infection as virus found … [+4167 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Social distancing in airplane seat assignments can reduce Covid-19 spread - Hindustan Times", "description": "The models can lower the transmission risk of Covid-19 more so than the strategy of blocking the middle seats, given the same number of passengers", "url": "https://www.hindustantimes.com/science/social-distancing-in-airplane-seat-assignments-can-reduce-covid-19-spread-101616932160583.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/28/1600x900/370362730_0-5_1616932679517_1616932699293.jpg", "publishedAt": "2021-03-28T12:00:15Z", "content": "A new research conducted to minimise the risk of secondary infections aboard has used two models to help solve the airplane seating assignment problem because Covid-19 has been shown to spread on air… [+2096 chars]"}, {"source": {"id": null, "name": "Lokmat.com"}, "author": "ANI", "title": "Immunotherapy for head, neck cancers now boosted by cancer cell gene deactivation - Lokmat", "description": "Researchers from the UCLA School of Dentistry, during a recent study, were successful in significantly slowing down the growth and spread of tumors in mice by targeting an enzyme that plays a key role in head and neck cancer cells. This also enhanced the effe…", "url": "https://english.lokmat.com/technology/immunotherapy-for-head-neck-cancers-now-boosted-by-cancer-cell-gene-deactivation/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/hdjahjashdjasdkasdjkajkasjdkkasd_d7LbIvV_vZZAa2V_202103.jpg", "publishedAt": "2021-03-28T11:12:14Z", "content": "Immunotherapy for head, neck cancers now boosted by cancer cell gene deactivation\r\nResearchers from the UCLA School of Dentistry, during a recent study, were successful in significantly slowing down … [+4158 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: AI might prove helpful against asbestos-linked cancer - ANI News", "description": "Leicester [UK], March 28 (ANI): A new international genomics research led by the University of Leicester used artificial intelligence (AI) to study an aggressive form of cancer, which could be helpful in improving patient outcomes.", "url": "https://www.aninews.in/news/science/study-ai-might-prove-helpful-against-asbestos-linked-cancer20210328164016", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/iuytfghjmnmkmklmnmk_5vGLKZy-thumbnail-154x87-70.jpg", "publishedAt": "2021-03-28T11:10:00Z", "content": "Leicester [UK], March 28 (ANI): A new international genomics research led by the University of Leicester used artificial intelligence (AI) to study an aggressive form of cancer, which could be helpfu… [+2067 chars]"}]}