{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pratishtha Tiwari", "title": "Health emergencies that should not be put on hold due to COVID 19 - Times of India", "description": "Fear of getting infected with the novel coronavirus and the need for quarantine should not stop people from seeking", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/health-emergencies-that-should-not-be-put-on-hold-due-to-covid-19/articleshow/75215329.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75215329,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-573713/75215329.jpg", "publishedAt": "2020-04-19T16:19:37Z", "content": "Fear of getting infected with the novel coronavirus and the need for quarantine should not stop people from seeking medical help for non-COVID 19 related chronic and acute health emergencies. \r\nIn the last two-three weeks, there have been cases reported where… [+2238 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus: 99 institutes willing to take part in clinical trial of plasma therapy, says ICMR - The Financial Express", "description": "Convalescent plasma is an experimental procedure for COVID-19 patients. As per the guidelines, hospitals and institutions planning to provide this modality of treatment should do so in a clinical trial with protocols which are cleared by the Institutional Eth…", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-99-institutes-willing-to-take-part-in-clinical-trial-of-plasma-therapy-says-icmr/1933429/", "urlToImage": "https://images.financialexpress.com/2020/04/COVID-9.jpg", "publishedAt": "2020-04-19T15:52:52Z", "content": "The Indian Council of Medical Research (ICMR) has received 99 applications from institutes expressing interest in participating in a randomised controlled study to assess the safety and efficacy of convalescent plasma to limit complications associated with CO… [+2048 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "\"This is not uncommon\": How the coronavirus leapt from bats to humans - Democracy Now!", "description": "As President Trump endorses a fringe conspiracy theory suggesting that the novel coronavirus originated in a Chinese lab, zoologist and disease ecologist Pet...", "url": "https://www.youtube.com/watch?v=dA3oV3vTwmo", "urlToImage": "https://i.ytimg.com/vi/dA3oV3vTwmo/maxresdefault.jpg", "publishedAt": "2020-04-19T15:30:03Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Do you wear braces? Food items you should avoid - Times of India", "description": "While braces can help in aligning your teeth, they do come with a list of do’s and don’ts. Usually regular brushing and eating soft foods can keep your braces healthy, there are some foods which should be avoided at any cost. Eating the below given foods can …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/do-you-wear-braces-food-items-you-should-avoid/photostory/75218484.cms", "urlToImage": "https://static.toiimg.com/photo/75218645.cms", "publishedAt": "2020-04-19T15:30:00Z", "content": "While braces can help in aligning your teeth, they do come with a list of do’s and don’ts. Usually regular brushing and eating soft foods can keep your braces healthy, there are some foods which should be avoided at any cost. Eating the below given foods can … [+167 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Dhirendra Kumar", "title": "10 DIY Skincare Hacks That Will Help You Get Rid Of Acne - ScoopWhoop", "description": "Go Acne Go!", "url": "https://www.scoopwhoop.com/health/10-diy-skin-hacks-that-will-help-you-get-rid-of-acne/", "urlToImage": "https://s4.scoopwhoop.com/anj2/5e9bf95b18ac8111b319cd90/a26a343b-2a82-4169-bd99-860a945b80a3.jpg", "publishedAt": "2020-04-19T14:26:54Z", "content": "Do you struggle with acne scars? Acne is normally caused by hormonal changes as a teenager, but it can last much longer. It is one of the most common skin conditions in the world, affecting an estimated 85% of people at some point in their lives. \r\nIf you dis… [+4354 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: How SARS-CoV-2 behaves in a household setting - The Indian Express", "description": "Out of a total of 392 household contacts and 105 index patients studied, the secondary attack rate of SARS-CoV-2 was 16.3 per cent. Secondary attack rate refers to the proportion of infected household contacts, excluding the index patient.", "url": "https://indianexpress.com/article/explained/how-sars-cov-2-behaves-in-a-household-setting-6369759/", "urlToImage": "https://images.indianexpress.com/2020/04/virus-4.jpg?w=759", "publishedAt": "2020-04-19T14:19:21Z", "content": "Researchers found that the 105 index patients who were quarantined at home for 14 days immediately after the onset of symptoms infected no other members of the household, provided they were wearing masks and residing alone.A new study published in the peer-re… [+3826 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Coronavirus: Don’t bet on Covid-19 vaccine, says world health guru David Nabarro - Livemint", "description": "The threat of the coronavirus may linger 'for the foreseeable future' because there’s no guarantee a vaccine can be developed says Professor David Nabarro an envoy for the WHO on Covid-19", "url": "https://www.livemint.com/news/world/coronavirus-don-t-bet-on-covid-19-vaccine-says-world-health-guru-david-nabarro-11587303274108.html", "urlToImage": "https://images.livemint.com/img/2020/04/19/600x338/covid19_1587304584087_1587304588900.jpg", "publishedAt": "2020-04-19T14:06:19Z", "content": "LONDON :\r\nThe threat of the coronavirus may linger for the foreseeable future\" because theres no guarantee a vaccine can be developed, a leading expert on the disease has said, according to the UKs Observer reported.David Nabarro, professor of global health a… [+766 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "DONALD G. MCNEIL JR.", "title": "What’s next for America in the coronavirus pandemic? - Chicago Tribune", "description": "More than 20 experts in public health, medicine, epidemiology and history shared their thoughts on the future during in-depth interviews. https://www.nytimes.com/2020/04/18/health/coronavirus-america-future.html", "url": "https://www.chicagotribune.com/coronavirus/ct-nw-nyt-cb-coronavirus-whats-next-20200419-re4qurwcnfd2nmqkkwrpqxwfgq-story.html", "urlToImage": "https://www.chicagotribune.com/resizer/D_jJJuF_oIbWvy_ZR7kMcKM2SYQ=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/V5XKB5G43VDI3E5PBHO4SRHN2U.jpg", "publishedAt": "2020-04-19T13:57:00Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Nobel winning scientist claims Covid-19 virus was man-made in Wuhan lab - Livemint", "description": "France's Luc Montagnier says SARS-CoV-2 virus was the result of an attempt to manufacture a vaccine against the AIDS virus.'The Wuhan city laboratory has specialized in these coronaviruses since the early 2000s. They have expertise in this area,' he told a Fr…", "url": "https://www.livemint.com/news/world/nobel-winning-scientist-claims-covid-19-virus-was-man-made-in-wuhan-lab-11587303649821.html", "urlToImage": "https://images.livemint.com/img/2020/04/19/600x338/20200417024L_1587303738721_1587303750908.jpg", "publishedAt": "2020-04-19T13:45:24Z", "content": "London: French Nobel prize winning scientist Luc Montagnier has sparked a fresh controversy by claiming that the SARS-CoV-2 virus came from a lab, and is the result of an attempt to manufacture a vaccine against the AIDS virus.In an interview given to French … [+2389 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Latest on the spread of the coronavirus around the world - Investing.com", "description": "Latest on the spread of the coronavirus around the world", "url": "https://www.investing.com/news/coronavirus/latest-on-the-spread-of-the-coronavirus-around-the-world-2144389", "urlToImage": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEG3I0AB_L.jpg", "publishedAt": "2020-04-19T13:35:00Z", "content": "(Reuters) - Reported cases of the coronavirus have crossed 2.31 million globally and 158,384 people have died, according to a Reuters tally as of 0200 GMT on Sunday. \r\nDEATHS AND INFECTIONS\r\n* For an interactive graphic tracking the global spread, open https:… [+5872 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Pandemic panopticon: Israeli surveillance during COVID-19 | The Listening Post (Feature) - Al Jazeera English", "description": "At The Listening Post, we have been tracking how governments are using technology - primarily phone data - to monitor the movements of citizens - and curb th...", "url": "https://www.youtube.com/watch?v=qptzZUJ3Bts", "urlToImage": "https://i.ytimg.com/vi/qptzZUJ3Bts/maxresdefault.jpg", "publishedAt": "2020-04-19T13:12:16Z", "content": null}, {"source": {"id": null, "name": "Theprint.in"}, "author": "ANI", "title": "3,86,791 Covid-19 tests conducted in India so far: ICMR - ThePrint", "description": "Dr Raman R Gangakhedkar, head scientist of ICMR, said of the 37,000 tests conducted on 18 April, 29,287 tests were done in the labs of the ICMR network.", "url": "https://theprint.in/india/386791-covid-19-tests-conducted-in-india-so-far-icmr/404801/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/covid-testing-scaled-e1586165716865.jpg", "publishedAt": "2020-04-19T12:33:45Z", "content": "New Delhi: The Indian Council of Medical Research (ICMR) on Sunday said that a total of3,86,791 COVID-19 tests have been conducted so far in the country. Out of these tests, over 37,000 tests were conducted on April 18 out of which 29,287 tests were done in t… [+1176 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "What you need to know about coronavirus on Sunday, April 19 - CNN", "description": "Less than a month ago, Singapore was being hailed as a country that got its coronavirus response right. The city-state seemed to have quashed the epidemic without the need for strict lockdowns.", "url": "https://www.cnn.com/2020/04/19/world/coronavirus-newsletter-04-19-20/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2020-04-19T11:45:39Z", "content": "A version of this story appeared in the April 19 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every day.\r\n (CNN)Less than a month ago, Singapore was being hailed as a country that got its corona… [+5035 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Qayam", "title": "‘Olympics in 2021 unrealistic unless COVID-19 vaccine found’ - The Siasat Daily", "description": "London: Holding the Tokyo Olympics any time before a vaccine is found will be \"very unrealistic,\" according to a leading global health expert. Professor Devi Sridhar said that the development of the vaccine will be key to when the Olympics can be held. Sridha…", "url": "https://www.siasat.com/olympics-2021-unrealistic-unless-covid-19-vaccine-found-1876541/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/03/Olympics-1.jpg", "publishedAt": "2020-04-19T10:32:00Z", "content": "London: Holding the Tokyo Olympics any time before a vaccine is found will be “very unrealistic,” according to a leading global health expert. Professor Devi Sridhar said that the development of the vaccine will be key to when the Olympics can be held.\r\nSridh… [+1253 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Sameer", "title": "Males more vulnerable to COVID-19: Are testicles responsible? - The Siasat Daily", "description": "New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system. What…", "url": "https://www.siasat.com/males-more-vulnerable-covid-19-are-testicles-responsible-1876362/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/testicles-.jpg", "publishedAt": "2020-04-19T10:00:00Z", "content": "New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system.\r\nWha… [+1183 chars]"}, {"source": {"id": null, "name": "Qswownews.com"}, "author": "Kunnikar", "title": "Thammasat Opens Laboratory for Quick Testing of COVID-19 to Support Other Hospitals - QS WOW News", "description": "Thammasat University has offered laboratory testing in Allied Health Sciences in order to support hospital work, delivering accurate and fast results. The University is providing resources to help during the national crisis due to COVID-19 and has opened labo…", "url": "https://qswownews.com/thammasat-opens-laboratory-for-quick-testing-of-covid-19-to-support-other-hospitals/", "urlToImage": "https://qswownews.com/wp-content/uploads/2020/04/COVID-Lab-1.jpg", "publishedAt": "2020-04-19T08:55:50Z", "content": "Thammasat University has offered laboratory testing in Allied Health Sciences in order to support hospital work, delivering accurate and fast results.\r\nThe University is providing resources to help during the national crisis due to COVID-19 and has opened lab… [+4053 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Genetic variation in immune system may affect coronavirus severity: Study - Deccan Herald", "description": "Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease. The research, published in the Journal of Vir…", "url": "https://www.deccanherald.com/science-and-environment/genetic-variation-in-immune-system-may-affect-coronavirus-severity-study-827261.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/19/microbiology-163470_1280-1587284789.jpg", "publishedAt": "2020-04-19T08:26:29Z", "content": "Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease.\r\nThe research, published in the Journal of Vi… [+1754 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "No guarantee a coronavirus vaccine will be developed, says leading world expert - The Times of Israel", "description": "'Some viruses are very, very difficult when it comes to vaccine development,' says Britain's David Nabarro, adding world will be living with COVID-19 for foreseeable future", "url": "https://www.timesofisrael.com/no-guarantee-a-coronavirus-vaccine-will-be-developed-says-leading-world-expert/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/04/AP20099731117207-1024x640.jpg", "publishedAt": "2020-04-19T07:20:01Z", "content": "One of the world’s leading experts on the new coronavirus has said there is no guarantee that a vaccine will be successfully developed, meaning that the threat is going to loom “for the foreseeable future.”\r\nYou dont necessarily develop a vaccine that is safe… [+1420 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Early measures reason for fewer cases in India: WHO regional director - Hindustan Times", "description": "India has had fewer cases than it might have because of early and aggressive action to contain the spread of coronavirus disease (Covid-19), said Dr Poonam Khetrapal Singh, regional director, World Health Organization (WHO) South East Asia Region.", "url": "https://www.hindustantimes.com/india-news/early-measures-reason-for-fewer-cases-in-india-who-regional-director/story-pzo670PRq3OzBFJjSkRQlK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/covid-19_91a796e2-81df-11ea-a716-f322ae116ff6.jpg", "publishedAt": "2020-04-19T07:13:00Z", "content": "Fewer cases in India are attributable to early and aggressive action to contain the spread of coronavirus disease (Covid-19), said Dr Poonam Khetrapal Singh, regional director, World Health Organisation, South East Asia Region, of which India is a part.\r\nHigh… [+7097 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Failed lab experiment to bats and pangolins: Theories around origin of Covid-19 - Hindustan Times", "description": "There are many theories doing the rounds when it comes to the origin of the novel coronavirus. Some even believe it was a result of a failed lab experiment.", "url": "https://www.hindustantimes.com/india-news/failed-lab-experiment-to-bats-and-pangolins-theories-around-origin-of-covid-19/story-yvf532omjHtlqbeNjdQO0M.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/assignment-name-in-brief_35d51422-8205-11ea-bf35-36f2d834daf8.jpg", "publishedAt": "2020-04-19T06:28:00Z", "content": "What is known about the coronavirus pandemic is that it originated in China and in a matter of months spread across the globe killing lakhs of people and infecting millions. \r\nWhile the contagion has brought more than half of the planet to a grinding halt, sc… [+3501 chars]"}]}