{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Spinal fluid of Alzheimer patients signals higher risk of gene inflammation - ANI News", "description": "North Carolina [US], February 12 (ANI): A clinical study by researchers of Duke University School of Medicine asserts that individuals who have a gene variant associated with an increased risk of developing Alzheimer's disease also tend to have changes in the…", "url": "https://www.aninews.in/news/health/study-spinal-fluid-of-alzheimer-patients-signals-higher-risk-of-gene-inflammation20210212095311", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/kfjkadsfldfkldfkldfdfldfldfl_abqDTFB-thumbnail-154x87-70.jpg", "publishedAt": "2021-02-12T04:26:00Z", "content": "North Carolina [US], February 12 (ANI): A clinical study by researchers of Duke University School of Medicine asserts that individuals who have a gene variant associated with an increased risk of dev… [+3530 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Common Blood Thinning Drugs Reduce Risk Of Covid Hospital Deaths: Study - NDTV", "description": "Blood-thinning drugs reduced the risk of death from Covid-19 in a new study, pointing to one more promising tool as physicians scour their medicine cabinets for treatments to blunt the pandemic.", "url": "https://www.ndtv.com/world-news/common-blood-thinning-drugs-reduce-risk-of-covid-hospital-deaths-study-2368874", "urlToImage": "https://c.ndtvimg.com/2021-02/8ilenbmg_coronavirus-hospital-generic-bloomberg_625x300_12_February_21.jpg", "publishedAt": "2021-02-12T04:14:53Z", "content": "Dexamethasone has been a success, which reduces death risk by one-third for patients on ventilators.\r\nBlood-thinning drugs reduced the risk of death from Covid-19 in a new study, pointing to one more… [+1478 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "UK records another 13,494 coronavirus cases, 678 deaths - Daijiworld.com - Daijiworld.com", "description": "London, Feb 12 (IANS): Another 13,494 people in Britain have tested positive for Covid-19, bringing the total number of coronavirus cases in the country to 3,998,655, according to official figures released on Thursday.\r\nThe country also reported another 678 c…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=800784", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2021-02-12T03:53:57Z", "content": "London, Feb 12 (IANS): Another 13,494 people in Britain have tested positive for Covid-19, bringing the total number of coronavirus cases in the country to 3,998,655, according to official figures re… [+1849 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Research reveals vital clues for discovery of COVID-19 drugs - News-Medical.net", "description": "Research from the University of Kent, Goethe-University in Frankfurt am Main, and the Philipps-University in Marburg has provided crucial insights into the biological composition of SARS-CoV-2, the cause of COVID-19, revealing vital clues for the discovery of…", "url": "https://www.news-medical.net/news/20210211/Research-reveals-vital-clues-for-discovery-of-COVID-19-drugs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2021-02-12T02:18:00Z", "content": "Research from the University of Kent, Goethe-University in Frankfurt am Main, and the Philipps-University in Marburg has provided crucial insights into the biological composition of SARS-CoV-2, the c… [+2433 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "UK COVID-19 variant likely to sweep the world: Scientists - The Shillong Times", "description": "LONDON, Feb 11: The coronavirus variant first found in the British region of Kent is a concern because it could undermine the protection given by vaccines against developing COVID-19, the head of the United Kingdom's genetic surveillance programme sa", "url": "https://theshillongtimes.com/2021/02/12/uk-covid-19-variant-likely-to-sweep-the-world-scientists/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2020/10/Covid19.jpg", "publishedAt": "2021-02-12T02:16:00Z", "content": "LONDON, Feb 11: The coronavirus variant first found in the British region of Kent is a concern because it could undermine the protection given by vaccines against developing COVID-19, the head of the… [+693 chars]"}, {"source": {"id": null, "name": "IWMBuzz"}, "author": "Editorial Team", "title": "Ways To Lose Weight Without Troubling Your Diet - IWMBuzz", "description": "Let's have a look at ways you can use to lose weight without disturbing your diet", "url": "https://www.iwmbuzz.com/lifestyle/health-fitness/ways-lose-weight-without-troubling-diet/2021/02/12", "urlToImage": "https://www.iwmbuzz.com/wp-content/uploads/2021/02/3-early-signs-to-understand-whether-you-are-pregnant-10.jpg", "publishedAt": "2021-02-11T23:25:24Z", "content": "Everyone wants to lose weight but doesn’t want to do extra effort or change their complete diet. Imagine can we lose weight, while eating whatever we like? The answer is yes, all you need is a few st… [+1470 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "Delhi reports 2 Covid deaths, 142 new infections - The Siasat Daily", "description": "New Delhi, Feb 11 : The national capital reported 142 new cases of Covid-19 in the last 24 hours and two deaths whereas 135 patients recovered from the disease on Thursday, according to Delhi Health Department bulletin.The latest case tally now stands at 6,36…", "url": "https://www.siasat.com/delhi-reports-2-covid-deaths-142-new-infections-2088319/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/02/Delhi-reports-2-Covid-deaths-142-new-infections.jpg", "publishedAt": "2021-02-11T23:00:00Z", "content": "New Delhi, Feb 11 : The national capital reported 142 new cases of Covid-19 in the last 24 hours and two deaths whereas 135 patients recovered from the disease on Thursday, according to Delhi Health … [+1469 chars]"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": "Reuters", "title": "New Zealand will get first batch of coronavirus vaccines next week - Financial Post", "description": "WELLINGTON — New Zealand will receive its first batch of the Pfizer/BioNTech vaccine next week, ahead of previous expectations of receipt by the end of March,…", "url": "https://financialpost.com/pmn/business-pmn/new-zealand-will-get-first-batch-of-coronavirus-vaccines-next-week-2", "urlToImage": null, "publishedAt": "2021-02-11T21:09:12Z", "content": "WELLINGTON New Zealand will receive its first batch of the Pfizer/BioNTech vaccine next week, ahead of previous expectations of receipt by the end of March, Prime Minister Jacinda Ardern said on Frid… [+1585 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Scientists unravel what makes some people COVID-19 super-spreaders - Daily Excelsior", "description": "BOSTON, Feb 11: Obesity, age, and the state of COVID-19 infection influence the number of virus particles an infected person breathes out, according to a", "url": "https://www.dailyexcelsior.com/scientists-unravel-what-makes-some-people-covid-19-super-spreaders-2/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2021/02/index-181.jpg", "publishedAt": "2021-02-11T19:27:00Z", "content": "BOSTON, Feb 11: Obesity, age, and the state of COVID-19 infection influence the number of virus particles an infected person breathes out, according to a new study which says these factors determine … [+2863 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "VR-based app to treat fear of heights - The Shillong Times", "description": "A team of researchers have developed a virtual reality (VR)-based app for smartphones to reduce fear of heights. The findings indicated that trial participants who spent a total of four hours training with the app at home had an improvement in their", "url": "https://theshillongtimes.com/2021/02/12/vr-based-app-to-treat-fear-of-heights/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2020/03/vr.jpg", "publishedAt": "2021-02-11T18:16:00Z", "content": "A team of researchers have developed a virtual reality (VR)-based app for smartphones to reduce fear of heights. The findings indicated that trial participants who spent a total of four hours trainin… [+1762 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Reuters", "title": "Roche's tocilizumab cuts deaths in hospitalized COVID-19 patients — study - Arab News", "description": "LONDON: Roche’s arthritis drug tocilizumab cuts the risk of death among patients hospitalized with severe COVID-19, also shortening the time to recovery and reducing the need for mechanical ventilation, results of a large trial showed on Thursday. The finding…", "url": "https://www.arabnews.com/node/1807741", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/11/2469711-1520526254.jpg", "publishedAt": "2021-02-11T18:10:13Z", "content": "CHICAGO: The US Mint announced this week that it will issue a Silver Dollar coin to commemorate Christa McAuliffe, a teacher and a civilian astronaut of Lebanese heritage who died on the Challenger S… [+2413 chars]"}, {"source": {"id": null, "name": "Vox"}, "author": "Brian Resnick", "title": "Flu season 2020-2021: It didn’t happen. Can we repeat this next season? - Vox.com", "description": "The promise and peril of this year’s missing flu season.", "url": "https://www.vox.com/science-and-health/22272237/flu-cases-down-historic-what-does-it-mean", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0ZUgeJrM1orgXVBvFHwmp5N3i8Y=/0x0:1860x1560/fit-in/1200x630/filters:fill(ffffff)/cdn.vox-cdn.com/uploads/chorus_asset/file/22297452/pS4iI_few_americans_have_had_confirmed_flu_cases_this_season.png", "publishedAt": "2021-02-11T17:40:00Z", "content": "The sum of all our mask-wearing, distancing, business closures, and other, however imperfect, precautions havent been enough to stop the Covid-19 pandemic in its tracks. But theres a silver lining: I… [+11616 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Heres how reduced physical activity is linked to Covid-19 induced depression - Hindustan Times", "description": "A study found that 61% of surveyed university students were at risk of clinical depression, a value twice the rate prior to the pandemic. This rise in depression came alongside dramatic shifts in lifestyle habits.", "url": "https://www.hindustantimes.com/lifestyle/health/heres-how-reduced-physical-activity-is-linked-to-covid-19-induced-depression-101613062139230.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/11/550x309/photo-1527137342181-19aab11a8ee8_1613063953555_1613063957172.jfif", "publishedAt": "2021-02-11T17:20:04Z", "content": "A multi-institutional team of researchers from Carnegie Mellon University, University of Pittsburgh, and University of California, San Diego found that 61 per cent of surveyed university students wer… [+3691 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Our Bureau", "title": "Covid-19: 74.31 lakh vaccinated so far - BusinessLine", "description": "As many as 4,13,752 beneficiaries were vaccinated on Thursday, taking the total Covid-19 vaccinations to close 74.31 lakh till date.With this, total number of healthcare workers received Covid shot wa", "url": "https://www.thehindubusinessline.com/news/national/covid-19-7431-lakh-vaccinated-so-far/article33813327.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/m4tw0d/article33799645.ece/ALTERNATES/LANDSCAPE_615/Bl-covid-19", "publishedAt": "2021-02-11T15:55:33Z", "content": "As many as 4,13,752 beneficiaries were vaccinated on Thursday, taking the total Covid-19 vaccinations to close 74.31 lakh till date.\r\nWith this, total number of healthcare workers received Covid shot… [+207 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "UK study finds new `game changer` drug to fight obesity - WION", "description": "A large-scale international trial in the UK has led to the discovery of a game changer drug for improving the health of people with obesity and could even play a major part in helping reduce the impact of diseases such as COVID-19.", "url": "https://www.wionews.com/world/uk-study-finds-new-game-changer-drug-to-fight-obesity-362968", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/02/11/182368-an-obese-person.jpg", "publishedAt": "2021-02-11T14:22:31Z", "content": "A large-scale international trial in the UK has led to the discovery of a 'game changer' drug for improving the health of people with obesity and could even play a major part in helping reduce the im… [+1515 chars]"}, {"source": {"id": null, "name": "Lokmat.com"}, "author": "ANI", "title": "Study suggests gene variants increase risk of Addison's disease - Lokmat", "description": "According to the largest genetic study to date on patients with Addison's disease --variants of nine genes increase the risk of developing Addison's disease, a rare disease in which the immune system attacks the adrenal glands.The findings help increase knowl…", "url": "https://english.lokmat.com/technology/study-suggests-gene-variants-increase-risk-of-addisons-disease/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/dna-1015661_960_720_JMWkqKw-thumbnail-320x180-70_rpI6KUN_Ni318mk_1_202102.jpg", "publishedAt": "2021-02-11T13:37:14Z", "content": "Study suggests gene variants increase risk of Addison's disease\r\nAccording to the largest genetic study to date on patients with Addison's disease --variants of nine genes increase the risk of develo… [+2997 chars]"}, {"source": {"id": null, "name": "Billboard"}, "author": "Lars Brandle", "title": "Alice Cooper Gets Vaccinated After Previously Contracting COVID - Billboard", "description": "The “Poison” singer admitted he and his wife Sheryl have recovered from the novel coronavirus, but they’re now covered against another bout.", "url": "https://www.billboard.com/articles/news/9524776/alice-cooper-vaccinated-covid/", "urlToImage": "https://static.billboard.com/files/2020/05/Alice-Cooper-press-cr-earMUSIC-Rob-Fenn-billboard-1548-1590679247-compressed.jpg", "publishedAt": "2021-02-11T12:36:38Z", "content": "The Godfather of Shock Rock got his jab, and he wants you to get one too.\r\nAlice Cooper, the Hall of Fame-inducted rock icon, visited the Abrazo West Campus hospital in Goodyear, Arizona, a suburb of… [+236 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "How do some people become Covid super-spreaders? Obesity, age, and the state of the infection play a huge role - Economic Times", "description": "As the infection 19 progressed, researchers found that the viral particles got smaller, reaching the size of a single micron at the peak of infection.", "url": "https://economictimes.indiatimes.com/magazines/panache/how-do-some-people-become-covid-super-spreaders-obesity-age-and-the-state-of-the-infection-play-a-huge-role/articleshow/80845305.cms", "urlToImage": "https://img.etimg.com/thumb/msid-80845753,width-1070,height-580,imgsize-512255,overlay-etpanache/photo.jpg", "publishedAt": "2021-02-11T12:34:00Z", "content": "BOSTON: Obesity, age, and the state of Covid-19 infection influence the number of virus particles an infected person breathes out, according to a new study which says these factors determine if a per… [+2890 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Hina Zahid", "title": "Common anti-depressant may be first-ever treatment for osteoarthritis - Medical Dialogues", "description": "HERSHEY, Pa. - A disease of the joints, osteoarthritis affects more than 30 million adults and is...", "url": "https://medicaldialogues.in/orthopaedics/news/common-anti-depressant-may-be-first-ever-treatment-for-osteoarthritis-74445", "urlToImage": "https://medicaldialogues.in/h-upload/2020/08/29/133722-osteoarthritis.jpg", "publishedAt": "2021-02-11T12:30:57Z", "content": "HERSHEY, Pa. - A disease of the joints, osteoarthritis affects more than 30 million adults and is the fifth-leading cause of disability in the United States. In a new study, scientists have discovere… [+3741 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Revealed: The direct connection between coffee and your heart - Times of India", "description": "If you are a coffee addict and need your brew every day, then there is some good news for you. According to recent studies, having 1-2 cups of coffee every day is tied to lower risk of heart failure. Read on to know how coffee protects the heart and how many …", "url": "https://timesofindia.indiatimes.com/life-style/food-news/revealed-the-direct-connection-between-coffee-and-your-heart/photostory/80843728.cms", "urlToImage": "https://static.toiimg.com/photo/80843877.cms", "publishedAt": "2021-02-11T12:30:00Z", "content": "Dr David Kao, senior author of the study and his team published their findings in the journal Circulation: Heart Failure on February 9.\r\nThe team conducted three major studies with 1,000 U.S. adults … [+564 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eating Whole Eggs Is Not Bad For Your Cholesterol: Here's How - NDTV", "description": "Egg can offer multiple benefits to your body. It is a well-known source of protein. But are eggs bad for your cholesterol? Read here to know the answer.", "url": "https://www.ndtv.com/health/eating-whole-eggs-is-not-bad-for-your-cholesterol-heres-how-2368444", "urlToImage": "https://i.ndtvimg.com/i/2017-03/eggs_620x351_81490597044.jpg", "publishedAt": "2021-02-11T12:11:58Z", "content": "Eggs are loaded with protein and essential vitamins\r\nHighlights\r\n<ul><li>Eggs are an excellent source of protein\r\n</li><li>You can cook eggs in different ways\r\n</li><li>A healthy diet and lifestyle a… [+2654 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "Lung Ultrasound Can Predict Clinical Progression of Severe COVID-19 Patients, Finds Study - HospiMedica", "description": "Lung ultrasound, considered a simple method for diagnosing lung disease, can also help predict the clinical progression of severe COVID-19 patients, according to a new study reported by Agência FAPESP.", "url": "https://www.hospimedica.com/covid-19/articles/294787011/lung-ultrasound-can-predict-clinical-progression-of-severe-covid-19-patients-finds-study.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2021-02-11/SDD-2523B.jpg", "publishedAt": "2021-02-11T11:28:38Z", "content": "Lung ultrasound, considered a simple method for diagnosing lung disease, can also help predict the clinical progression of severe COVID-19 patients, according to a new study reported by Agência FAPES… [+2564 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Mexico president says 1 million doses of Made-in-India vaccines scheduled - Hindustan Times", "description": "India has also supplied Indian-made vaccines to countries including Bhutan, Maldives, Nepal, and Bangladesh.", "url": "https://www.hindustantimes.com/india-news/mexico-president-says-1-million-doses-of-made-in-india-vaccines-scheduled-101613037799668.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/11/550x309/eaba2510-63c0-11eb-b162-134cbb314c5d_1613038501172_1613038600843.jpg", "publishedAt": "2021-02-11T11:27:07Z", "content": "Mexican President Andres Manuel Lopez Obrador at a news conference on Wednesday informed that the country would receive around a million doses of AstraZeneca's Covid-19 vaccine sent from India in the… [+740 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Study: Early behavioural problems predict adolescent mental health difficulties - Hindustan Times", "description": "A substantial proportion of adolescent mental health and behavioural difficulties can be predicted years before they arise, a new study indicates.", "url": "https://www.hindustantimes.com/lifestyle/health/study-early-behavioural-problems-predict-adolescent-mental-health-difficulties-101613024792386.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/11/550x309/girls-1563093_1920_1613040661845_1613040667782.jpg", "publishedAt": "2021-02-11T10:51:51Z", "content": "A substantial proportion of adolescent mental health and behavioural difficulties can be predicted years before they arise, a new study indicates.\r\nThe research, by academics at the University of Cam… [+5627 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Does your fitness and dietary supplement consumption say much about your lifestyle choices? - Times Now", "description": "Your lifestyle comprises of many factors - including waking up in time, eating healthily, exercising regularly, or your habits Here is what you need to know about the link between lifestyle and fitness.", "url": "https://www.timesnownews.com/health/article/how-fitness-and-dietary-supplements-play-an-important-role-in-analyzing-the-lifestyle-of-people/717546", "urlToImage": "https://imgk.timesnownews.com/story/iStock-1095830250_1.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-02-11T08:56:00Z", "content": "New Delhi: Your lifestyle is determined by a number of factors - including the time you wake up, what you do right after it, what you eat, how much exercise you get, and if our not you have a few hab… [+5097 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can hiccups be a sign of COVID-19? Here's what doctors want you to know, and what you should do - Times of India", "description": "According to a recent case study which has alarmed the medical community, having persistent hiccups may be yet another sign of COVID-19 the public needs to be warned about.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-symptoms-can-hiccups-be-a-sign-of-covid-19-heres-what-doctors-want-you-to-know-and-what-you-should-do/photostory/80840833.cms", "urlToImage": "https://static.toiimg.com/photo/80841418.cms", "publishedAt": "2021-02-11T08:53:33Z", "content": "The man's case study is subject to further evaluation. Yet, even if shocking, it could be possible that hiccups come up as in a way when the virus starts to attack the vital organs.\r\nRight now, the m… [+822 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Brand Studio", "title": "Manage your diabetes like a ‘boss’ as you return to work - Hindustan Times", "description": "It’s time to turn to time-tested, proven strategies to manage your diabetes, so that you can be on top of your health whether you are continuing to work from home or returning to the office.", "url": "https://www.hindustantimes.com/brand-post/manage-your-diabetes-like-a-boss-as-you-return-to-work-101613032045919.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/11/550x309/121_(3)_1613032117125_1613032126352.jpg", "publishedAt": "2021-02-11T08:30:51Z", "content": "Does it feel like youve only just gotten used to working from home? Many of us have practiced looking good on video cameras, or driving a remote brainstorming session to come up with a creative idea.… [+3722 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study sheds light on how women make choices about surgery to prevent ovarian cancer - ANI News", "description": "London [UK], February 11 (ANI): A study by researchers at Queen Mary University in London has investigated how women who are at high risk of ovarian cancer make choices about possible preventive surgery.", "url": "https://www.aninews.in/news/health/study-sheds-light-on-how-women-make-choices-about-surgery-to-prevent-ovarian-cancer20210211115430", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Cancer_oct10_sVhF8Of_EBYtR1b_eza6prz_OLpKqaz-thumbnail-154x87-70.jpg", "publishedAt": "2021-02-11T06:29:00Z", "content": "London [UK], February 11 (ANI): A study by researchers at Queen Mary University in London has investigated how women who are at high risk of ovarian cancer make choices about possible preventive surg… [+2049 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Research on HIV and human defense system yields potential drug target - EdexLive", "description": "The human protein named SAMHD1 recognises a unique molecular pattern in nucleic acids, which may act as a signal for action to the human body defence system", "url": "https://www.edexlive.com/news/2021/feb/11/researchon-hiv-and-human-defense-system-yields-potential-drug-target-18158.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/2/11/w600X390/HIV.jpg", "publishedAt": "2021-02-11T05:56:00Z", "content": "The researchers from The University of Texas Health Science Center at San Antonio (UT Health San Antonio) have discovered that a human protein named SAMHD1 recognizes a unique molecular pattern in nu… [+1627 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Associated Press Television News", "title": "California sees first cases of South African variant - Republic World", "description": "California has identified the state's first two cases of the South African variant of the coronavirus in the state, Gov. Gavin Newsom said on Wednesday.", "url": "https://www.republicworld.com/world-news/us-news/california-sees-first-cases-of-south-african-variant.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ueumskl1ajulvn9c_1613022119.jpeg?tr=f-jpeg", "publishedAt": "2021-02-11T05:50:00Z", "content": "California has identified the state's first two cases of the South African variant of the coronavirus in the state, Gov. Gavin Newsom said on Wednesday.\r\nThe cases were found in Alameda and Santa Cla… [+1761 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Single strain of bacteria may reduce the severity of graft-versus-host disease - News-Medical.Net", "description": "MUSC Hollings Cancer Center researchers found that a single strain of bacteria may be able to reduce the severity of graft-versus-host disease (GVHD), as reported online in February 2021 in JCI Insight.", "url": "https://www.news-medical.net/news/20210211/Single-strain-of-bacteria-may-reduce-the-severity-of-graft-versus-host-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Chemo_Vials-620x480.jpg", "publishedAt": "2021-02-11T05:27:00Z", "content": "MUSC Hollings Cancer Center researchers found that a single strain of bacteria may be able to reduce the severity of graft-versus-host disease (GVHD), as reported online in February 2021 in JCI Insig… [+4709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The Covid-19 vaccine had to be used, Texas doctor used it and was fired - The Indian Express", "description": "The matter of Gokal is playing out as pandemic-weary Americans scour websites and cross state lines chasing rumors, all in anxious pursuit of a medicine in short supply. The case opens wide to interpretation, becoming a study in the learn-as-you-go bioethics …", "url": "https://indianexpress.com/article/world/the-covid-19-vaccine-had-to-be-used-he-used-it-he-was-fired-7183653/", "urlToImage": "https://images.indianexpress.com/2021/02/VACCINE-DOCTOR-FIRING-1.jpg", "publishedAt": "2021-02-11T02:58:13Z", "content": "Written by Dan Barry\r\nThe Texas doctor had six hours. Now that a vial of COVID-19 vaccine had been opened on this late December night, he had to find 10 eligible people for its remaining doses before… [+11032 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Associated Press Television News", "title": "Rural library helps children without internet in Colombia - Republic World", "description": "In Bogotá - as well as in several cities around the country - schools that meet the requirements to guarantee biosecurity measures will implement an alternating system, which consists of combining face-to-face classes with virtual ones.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/rural-library-helps-children-without-internet-in-colombia.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ltzjwbae4ce7uozw_1613007824.jpeg?tr=f-jpeg", "publishedAt": "2021-02-11T01:43:00Z", "content": "The COVID-19 pandemic has exposed the digital gap in Colombia, most starkly through the closure of schools.In rural Usme, some 35 kilometres south of Bogotá, dozens of children rely on a community li… [+1921 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Timesofindia", "title": "5 times it is alright to skip your workout - Times of India", "description": "It helps to tone your body, reduces the risk of injury, prevents you from chronic diseases and lifts your mood.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/5-times-it-is-alright-to-skip-your-workout/photostory/80788993.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80789053,width-900,height-1200,resizemode-6.cms", "publishedAt": "2021-02-11T01:30:00Z", "content": "It helps to tone your body, reduces the risk of injury, prevents you from chronic diseases and lifts your mood."}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Hina Zahid", "title": "Intake of Opioids or certain antibiotics during pregnancy not tied to major birth defects - Medical Dialogues", "description": "Two studies published by The BMJ today find no links between prescription opioids or macrolide...", "url": "https://medicaldialogues.in/pediatrics-neonatology/news/intake-of-opioids-or-certain-antibiotics-during-pregnancy-not-tied-to-major-birth-defects-74422", "urlToImage": "https://medicaldialogues.in/h-upload/2020/11/09/141980-pregnancy.jpg", "publishedAt": "2021-02-11T01:00:41Z", "content": "Two studies published by The BMJ today find no links between prescription opioids or macrolide antibiotics taken during pregnancy and risk of major birth defects.Both opioids (painkillers) and macrol… [+2553 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Study reveals high blood pressure causes atrial fibrillation - Times of India", "description": "A new study has found that high blood pressure is casually associated with the most common heart rhythm disorder. The findings of the study were published in the 'European Journal of Preventive Cardiology'. Study author Dr Georgios Georgiopoulos of King's Col…", "url": "https://timesofindia.indiatimes.com/videos/news/study-reveals-high-blood-pressure-causes-atrial-fibrillation/videoshow/80784364.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-80784364,imgsize-1315221.cms", "publishedAt": "2021-02-10T22:30:00Z", "content": "Feb 11, 2021, 04:00AM ISTSource: ANIA new study has found that high blood pressure is casually associated with the most common heart rhythm disorder. The findings of the study were published in the '… [+1752 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": null, "title": "Track the Vax: When Is It Too Risky to Get the COVID-19 Vaccine? - Everyday Health", "description": "What you need to know about allergies, pregnancy, chronic conditions, and other contraindications when deciding whether or not to get vaccinated.", "url": "https://www.everydayhealth.com/coronavirus/track-the-vax-when-is-it-too-risky-to-get-the-covid-19-vaccine/", "urlToImage": "https://images.everydayhealth.com/images/coronavirus/track-the-vax-episode-11-promo-1440x810.jpg?sfvrsn=e89d6e4f_1", "publishedAt": "2021-02-10T21:05:55Z", "content": "Q&amp;A With Dr. Barbara Alexander\r\nSerena Marshall: We've heard that getting one of these COVID-19 vaccines, especially the second doses, can be painful and even put you out for a few days. Is this … [+8375 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Top 10 magnesium-rich foods - Times of India", "description": "Magnesium is an extremely important mineral for the body.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/top-10-magnesium-rich-foods/articleshow/80789726.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80789726,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1446240/80789726.jpg", "publishedAt": "2021-02-10T18:30:00Z", "content": "Magnesium is an extremely important mineral for the body. An adult body contains 25 grams magnesium, with 50 per cent to 60 per cent of it in the bones and the rest in the soft tissues. Magnesium is … [+5203 chars]"}, {"source": {"id": null, "name": "MedicineNet"}, "author": null, "title": "What's the Most Common Risk for New Diabetes Cases? - MedicineNet", "description": "Obesity is the culprit in up to half of new diabetes cases among Americans each year, a new study estimates.", "url": "https://www.medicinenet.com/script/main/art.asp?articlekey=252102", "urlToImage": "https://images.medicinenet.com/images/facebook/medicinenet/fb-mnet-default.jpg", "publishedAt": "2021-02-10T16:49:27Z", "content": "By Amy Norton HealthDay ReporterWEDNESDAY, Feb. 10, 2021\r\nObesity is the culprit in up to half of new diabetes cases among Americans each year, a new study estimates.\r\nResearchers found that over nea… [+5025 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "6.8 mn healthcare, frontline workers vaccinated against Covid: Govt - Business Standard", "description": "The number of healthcare and frontline workers vaccinated against COVID-19 reached68.26 lakh on Wednesday, the 26th day of the countrywide inoculation programme, the Union Health Ministry said.", "url": "https://www.business-standard.com/article/current-affairs/6-8-mn-healthcare-frontline-workers-vaccinated-against-covid-govt-121021001642_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-02/08/full/1612803671-9531.jpg", "publishedAt": "2021-02-10T16:00:00Z", "content": "The number of healthcare and frontline workers vaccinated against COVID-19 reached68.26 lakh on Wednesday, the 26th day of the countrywide inoculation programme, the Union Health Ministry said.\r\nThe … [+2910 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "In the COVID-19 vaccine race, we either win together or lose together - World - ReliefWeb", "description": "English News and Press Release on World about Health and Epidemic; published on 10 Feb 2021 by UNICEF and WHO", "url": "https://reliefweb.int/report/world/covid-19-vaccine-race-we-either-win-together-or-lose-together", "urlToImage": "https://reliefweb.int/profiles/reliefweb/themes/kobe/images/metatag/disaster-type/epidemic.png", "publishedAt": "2021-02-10T15:27:00Z", "content": "Joint statement by UNICEF Executive Director Henrietta Fore and WHO Director-General Dr. Tedros Adhanom Ghebreyesus\r\nNEW YORK/GENEVA, 10 February 2021 – “Of the 128 million vaccine doses administered… [+2209 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "New Research Shows Exhaled Respiratory Droplets Increase With Onset Of COVID-19, Age And Body Mass Index - PRNewswire", "description": "/PRNewswire/ -- Harvard University, Tulane University and Massachusetts General Hospital today announced new research published, \"Exhaled Aerosol Increases...", "url": "https://www.prnewswire.com/news-releases/new-research-shows-exhaled-respiratory-droplets-increase-with-onset-of-covid-19-age-and-body-mass-index-301225960.html", "urlToImage": "/content/dam/prnewswire/common/prn_facebook_sharing_logo.jpg", "publishedAt": "2021-02-10T15:15:00Z", "content": "CAMBRIDGE, Mass. and NEW ORLEANS, Feb. 10, 2021 /PRNewswire/ -- Harvard University, Tulane University and Massachusetts General Hospital today announced new research published, \"Exhaled Aerosol Incre… [+2727 chars]"}, {"source": {"id": null, "name": "Telegraph India"}, "author": "Paran Balakrishnan", "title": "Covid: Calcutta study explains rapid spread in Europe, North America - Telegraph India", "description": "Researchers At National Institute Of Biomedical Genomics Establish Link With A Protein Deficiency", "url": "https://www.telegraphindia.com/india/covid-calcutta-study-explains-rapid-spread-in-europe-north-america/cid/1806260", "urlToImage": "https://assets.telegraphindia.com/telegraph/2020/Sep/1600200344_covid.jpg", "publishedAt": "2021-02-10T14:06:31Z", "content": "A protein deficiency found commonly in large swathes of the populations in Europe and North America could explain why these regions have been worse hit by Covid-19 than people in Asia, researchers at… [+4740 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Women’s health: heart disease - BollyInside", "description": "ALBANY, NY (NEWS10) - More than 30 million American adults were diagnosed with heart disease in 2018. The prevalence of heart disease in women is", "url": "https://www.bollyinside.com/news/womens-health-heart-disease/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/02/Womens-health-heart-disease.jpg", "publishedAt": "2021-02-10T12:03:34Z", "content": "ALBANY, NY (NEWS10) – More than 30 million American adults were diagnosed with heart disease in 2018. The prevalence of heart disease in women is declining, but for decades it has been the leading ca… [+1274 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kalpana Sharma", "title": "How running won’t ruin your knees or lead to injury - Times of India", "description": "Running is a full body workout where your joints get impacted so you have to prepare your body. Practising strength", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/how-running-wont-ruin-your-knees-or-lead-to-injury/articleshow/80786815.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80786850,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-998730/80786850.jpg", "publishedAt": "2021-02-10T11:03:00Z", "content": "COVID-19 led to the resurgence of outdoor activities, especially running and cycling. With gyms and fitness centers still not considered fully safe, people are finding their fitness outlet in running… [+2989 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Reuters", "title": "Pfizer could directly deliver Covid-19 shot to South Africa vaccination points - Hindustan Times", "description": "Pfizers Covid-19 vaccine needs to be stored and distributed at around -70 degrees Celsius, requiring countries importing it to have ultra-cold chain capabilities.", "url": "https://www.hindustantimes.com/world-news/pfizer-could-directly-deliver-covid-19-shot-to-south-africa-vaccination-points-101612949619412.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/10/550x309/2021-02-10T092728Z_1295424484_RC2LPL99Y2XZ_RTRMADP_3_HEALTH-CORONAVIRUS-SAFRICA-PFIZER_1612949744581_1612949762914.JPG", "publishedAt": "2021-02-10T10:25:15Z", "content": "Pfizer said it could deliver its Covid-19 vaccine, which requires ultra-cold temperatures for storage and distribution, directly to points of vaccination in South Africa.\r\nSouth Africa is scrambling … [+1547 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "UK variant of coronavirus strain detected in 86 countries, says WHO - Hindustan Times", "description": "In the UK, for example, Covid-19 test samples of this strain increased from 63 per cent in the week of December 14 to 90 per cent in the week of January 18, the WHO said in its weekly epidemiological update.", "url": "https://www.hindustantimes.com/world-news/uk-variant-of-coronavirus-strain-detected-in-86-countries-says-who-101612952057305.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/10/550x309/2020-12-23T094741Z_1767844826_RC2XSK9NBPRW_RTRMADP_3_BRITAIN-EU-DOVER_1610712420641_1610713007080_1612952178010.JPG", "publishedAt": "2021-02-10T10:16:36Z", "content": "The World Health Organisation (WHO) on Tuesday (local time) announced that coronavirus variant B.1.1.7, which was first identified in the United Kingdom on September 20, has been reported in 86 count… [+1083 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Eat walnuts regularly to reduce negative results of H pylori infection: Study - Hindustan Times", "description": "A new study recommends that regular walnut consumption might be a promising mediation for lessening negative results related to Helicobacter pylori (H. pylori) disease, a broad bacterial infection that influences the greater part of the worlds population.", "url": "https://www.hindustantimes.com/lifestyle/health/eat-walnuts-regularly-to-reduce-negative-results-of-h-pylori-infection-study-101612939314217.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/10/550x309/photo-1589621317485-c6ed43660ffa_1612951296381_1612951312216.jfif", "publishedAt": "2021-02-10T10:03:15Z", "content": "A new study using mice models, distributed in the Journal of Clinical Biochemistry and Nutrition recommends that regular walnut consumption might be a promising mediation for lessening negative resul… [+2328 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Tumor Mutation Burden (TMB): A biomarker for cancer immunotherapy - India Today", "description": "Immunotherapy is a type of cancer treatment that uses the body's natural defenses (immune system) to identify, attack, and kill these cancer cells. The use of immunotherapy is rapidly increasing as more immunotherapies are approved to treat people with more t…", "url": "https://www.indiatoday.in/information/story/tumor-mutation-burden-tmb-a-biomarker-for-cancer-immunotherapy-1765850-2021-02-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202102/Tumor_Mutation_Burden-647x363.jpeg?0c6_SRweexdbiZw3OI8Y97GvbYUqHjT_", "publishedAt": "2021-02-10T09:40:10Z", "content": "Cancer or Cancer cells are the cells that have lost the ability to follow the normal control that the body exerts on all the cells and lead to abnormal growth of cell tissues creating a lump or tumor… [+3465 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "UK variant of coronavirus strain detected in 86 countries: WHO - ANI News", "description": "Washington [US], February 10 (ANI): The World Health Organisation (WHO) on Tuesday (local time) announced that coronavirus variant B.1.1.7, which was first identified in the United Kingdom on September 20, has been reported in 86 countries.", "url": "https://www.aninews.in/news/world/us/uk-variant-of-coronavirus-strain-detected-in-86-countries-who20210210150216", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/World_Health_Organization_fe_10-thumbnail-154x87-70.jpg", "publishedAt": "2021-02-10T09:34:22Z", "content": "Washington [US], February 10 (ANI): The World Health Organisation (WHO) on Tuesday (local time) announced that coronavirus variant B.1.1.7, which was first identified in the United Kingdom on Septemb… [+1118 chars]"}, {"source": {"id": null, "name": "PR Newswire UK"}, "author": null, "title": "Newly Released Antiviral Fabric from SQ Group Kills COVID-19 Virus - PR Newswire UK", "description": "/PRNewswire/ -- Jinan Shengquan Group Share Holding Co., Ltd. (SQ Group) in collaboration with Hong Kong Nano and Advanced Materials Institute (NAMI) released...", "url": "https://www.prnewswire.co.uk/news-releases/newly-released-antiviral-fabric-from-sq-group-kills-covid-19-virus-821958604.html", "urlToImage": "https://mma.prnewswire.com/media/1436386/1.jpg?p=facebook", "publishedAt": "2021-02-10T08:18:00Z", "content": "According to the report, the fabric, which is named Nano-VTS, is treated with a special biopolysaccharide material, and able to kill 100% of the COVID-19 virus (SARS-CoV-2) under experimental conditi… [+3936 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Think Covid-19 is mild among children? Study finds coronavirus turned severe for thousands in India - India Today", "description": "A new study suggests that Covid-19 may have turned severe and even deadly for thousands of children in India. Figures released by the Indian Academy of Paediatrics Intensive Care Chapter show that more than 2,000 cases of Multisystem Inflammatory Syndrome in …", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/think-covid-19-mild-among-children-study-cases-severe-mis-c-india-1767800-2021-02-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202102/RTS38USfrfr-647x363.jpeg?XWuOnT3GqYfJC.mGlHZtHlfnOanJYvMa", "publishedAt": "2021-02-10T08:07:47Z", "content": "Covid-19 may have turned severe and even deadly for thousands of children in India, a new research has suggested. The findings of the new study came in contrast with earlier ones that said children i… [+3203 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "How air conditioning spreads coronavirus aerosols decoded - DTNext", "description": "Using advanced air-flow simulation tools on super computers, scientists have analysed an outbreak of the novel coronavirus at a restaurant in China, findings that reveal how ventilation and air conditioning influence airborne virus transmission risk.", "url": "http://www.dtnext.in/Lifestyle/LifeStyleTopNews/2021/02/10130139/1275412/How-air-conditioning-spreads-coronavirus-aerosols-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Feb/202102101301397079_How-air-conditioning-spreads-coronavirus-aerosols-decoded_SECVPF.gif", "publishedAt": "2021-02-10T07:41:47Z", "content": "Using advanced air-flow simulation tools on super computers, scientists have analysed an outbreak of the novel coronavirus at a restaurant in China, findings that reveal how ventilation and air condi… [+2258 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "Covid-19 mutated strain spreading rapidly across US, raising concerns: Study - BusinessLine", "description": "For the study, published in the journal MedRxiv, the researchers have analysed half a million coronavirus tests and hundreds of genomes of the B.1.1.7 variant of Covid-19", "url": "https://www.thehindubusinessline.com/news/science/covid-19-mutated-strain-spreading-rapidly-across-us-raising-concerns-study/article33799646.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/m4tw0d/article33799645.ece/ALTERNATES/LANDSCAPE_615/Bl-covid-19", "publishedAt": "2021-02-10T07:25:27Z", "content": "A new study suggested that the coronavirus mutated variant is spreading rapidly across the United States, raising concerns of the second wave of the pandemic.\r\nFor the study, published in the journal… [+947 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Rabies treatment demonstrated as safe, effective for use in children in first pediatric trial - ANI News", "description": "Washington [US], February 10 (ANI): A treatment, known as KEDRAB (Rabies Immune Globulin [Human]), currently used in the prevention of rabies has been demonstrated to be safe and effective for patients age 17 and under.", "url": "https://www.aninews.in/news/health/rabies-treatment-demonstrated-as-safe-effective-for-use-in-children-in-first-pediatric-trial20210210120935", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/COVIDvaccine_july15_edshFDC-thumbnail-154x87-70.jpg", "publishedAt": "2021-02-10T06:39:00Z", "content": "ANI | Updated: Feb 10, 2021 12:09 IST\r\nWashington [US], February 10 (ANI): A treatment, known as KEDRAB (Rabies Immune Globulin [Human]), currently used in the prevention of rabies has been demonstra… [+3999 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Long COVID risk: Here's how these vital organs are affected by post COVID syndrome - Times of India", "description": "Not only do the lingering post COVID symptoms list add to the burden of the disease, but it can also require chronic care and support and even degrade the quality of life over time.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/long-covid-risk-heres-how-these-vital-organs-are-affected-by-post-covid-syndrome/photostory/80771505.cms", "urlToImage": "https://static.toiimg.com/photo/80771601.cms", "publishedAt": "2021-02-10T05:30:00Z", "content": "Brain fog and cognitive difficulties, which could age the brain by upto 10 years time is a common complaint by COVID long haulers.\r\nThere are also case studies globally which support the fact that CO… [+502 chars]"}]}