{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Prabha Raghavan", "title": "Wockhardt offers to make 2 billion Covid vaccine doses a year - The Indian Express", "description": "Outside of India, Wockhardt already has an agreement with the UK government to “fill and finish” Covid-19 vaccines exclusively for the UK.", "url": "https://indianexpress.com/article/india/wockhardt-offers-to-make-2-billion-covid-vaccine-doses-a-year-7330263/", "urlToImage": "https://images.indianexpress.com/2021/05/covid-vaccine-26.jpg", "publishedAt": "2021-05-25T23:44:28Z", "content": "Indian pharmaceutical company Wockhardt has told the government it can produce as many as two billion doses a year of most Covid-19 vaccines, starting with a capacity of 500 million doses by February… [+2615 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "Fact Check: Did Nobel Laureate & French Virologist Say Vaccinated People Will Die Within 2 Years? - OdishaBytes", "description": "A viral message claiming that French virologist and Nobel laureate Luc Montagnier has said all people getting vaccinated against COVID will die within two years of vaccination is doing the rounds on social media.\"Nobel Prize Winner Luc Montagnier has", "url": "https://odishabytes.com/fact-check-did-nobel-laureate-french-virologist-say-vaccinated-people-will-die-within-2-years/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2021/05/vaccinated-people-to-die-within-2-years-fake-news.jpg", "publishedAt": "2021-05-25T19:26:01Z", "content": "A viral message claiming that French virologist and Nobel laureate Luc Montagnier has said all people getting vaccinated against COVID will die within two years of vaccination is doing the rounds on … [+2738 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dan Sales, Connor Boyd Assistant", "title": "First man in world to get approved Covid jab is dead: Brit William Shakespeare has died at 81 - Daily Mail", "description": "Bill, as he was known, made global headlines on so-called V-Day on December 8 when he received the Pfizer jab at the University Hospital Coventry.", "url": "https://www.dailymail.co.uk/news/article-9617383/First-man-world-approved-Covid-jab-dead-Brit-William-Shakespeare-died-81.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/25/16/43425585-0-image-a-56_1621955436172.jpg", "publishedAt": "2021-05-25T18:17:27Z", "content": "William Shakespeare, the first man in the world to have an approved Covid jab, has died in hospital aged 81 after suffering a stroke.\r\nBill, as he was known, made global headlines on so-called V-Day … [+15182 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Nikhil M Babu", "title": "Doctors say black fungus cases likely to decline in 7 to 10 days - The Hindu", "description": "There is shortage of drug required for treatment of fungal infection, they claim", "url": "https://www.thehindu.com/news/cities/Delhi/doctors-say-black-fungus-cases-likely-to-decline-in-7-to-10-days/article34645054.ece", "urlToImage": "https://www.thehindu.com/news/cities/Delhi/1odj34/article34645053.ece/ALTERNATES/LANDSCAPE_615/25DELPRIYALOKNAYAK", "publishedAt": "2021-05-25T17:55:33Z", "content": "Cases of mucormycosis (black fungus) in the city seem to have reached the peak and are expected to fall in the next 7-10 days similar to COVID-19, which had triggered a spike in the fungal infection,… [+2572 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop a novel probiotic formulation with high anti-SARS-CoV-2 potency - News-Medical.Net", "description": "A team of international scientists recently conducted a randomized clinical trial to assess the safety and efficacy profiles of a novel probiotic formulation in symptomatic coronavirus disease 2019 (COVID-19) patients. The findings indicate that the probiotic…", "url": "https://www.news-medical.net/news/20210525/Researchers-develop-a-novel-probiotic-formulation-with-high-anti-SARS-CoV-2-potency.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/5/shutterstock_1889563108_(4).jpg", "publishedAt": "2021-05-25T17:05:00Z", "content": "A team of international scientists recently conducted a randomized clinical trial to assess the safety and efficacy profiles of a novel probiotic formulation in symptomatic coronavirus disease 2019 (… [+4528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mehr Gill", "title": "Explained: Role of dogs in detecting coronavirus– useful, yet miles to go - The Indian Express", "description": "A series of studies has shown how effectively dogs can detect coronavirus in sweat or urine samples of infected individuals. But can they replace conventional RT-PCR tests? Not yet.", "url": "https://indianexpress.com/article/explained/coronavirus-test-dogs-research-7330157/", "urlToImage": "https://images.indianexpress.com/2021/05/Dogs-Covid-test.jpg", "publishedAt": "2021-05-25T16:26:31Z", "content": "In the last one month, two groups of researchers have reported separate findings on sniffer dogs detecting coronavirus infection in humans with remarkable accuracy. The role of detection dogs has bee… [+5807 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "CDC: Coronavirus Infection in Fully Vaccinated People Remains Rare - News18", "description": "US health officials say coronavirus infections in fully vaccinated people remain rare.", "url": "https://www.news18.com/news/india/cdc-coronavirus-infection-in-fully-vaccinated-people-remains-rare-3776312.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1620732870_singapore-coronavirus.jpg", "publishedAt": "2021-05-25T16:19:47Z", "content": "US health officials say coronavirus infections in fully vaccinated people remain rare. The Centers for Disease Control and Prevention on Tuesday issued a report on these breakthrough cases through th… [+994 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "COVID: India's 'white fungus' infections raise new health concerns - DW (English)", "description": "Along with rising cases of black fungus infections among recovering Indian COVID patients, several cases of more severe white fungus infections are now being reported.", "url": "https://www.dw.com/en/covid-indias-white-fungus-infections-raise-new-health-concerns/a-57657371", "urlToImage": "https://static.dw.com/image/57602193_6.jpg", "publishedAt": "2021-05-25T15:36:10Z", "content": "India's Health Ministry is asking pharmaceutical companies to ramp up production and distribution of antifungal medications after a new type of fungal infection was found in recovering COVID-19 patie… [+3107 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "Coronavirus: Covid long-haulers baffle doctors with symptoms going on and on - Hindustan Times", "description": "The scope of the mysterious lingering symptoms triggered by Covid-19 is emerging more clearly. But more than a year into the pandemic, what’s causing the symptoms and how best to treat them is anything but clear.", "url": "https://www.hindustantimes.com/lifestyle/health/coronavirus-covid-long-haulers-baffle-doctors-with-symptoms-going-on-and-on-101621938453565.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/25/1600x900/PTI05_25_2021_000170A_1621955337395_1621956347228.jpg", "publishedAt": "2021-05-25T15:27:09Z", "content": "Tasha Clark tested positive for Covid-19 on April 8, 2020. The Connecticut woman, now 41, was relieved that her symptoms at the time -- diarrhea, sore throat and body aches -- didnt seem particularly… [+9046 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Claire Harrison, Lorraine King", "title": "William Shakespeare dies at 81 after becoming first man in world to get Covid vaccine - The Mirror", "description": "Tributes have been paid to Mr Shakespeare who hit global headlines on December 8 last year when he became the first man to have the jab at the University Hospital Coventry and Warwickshire", "url": "https://www.mirror.co.uk/news/uk-news/breaking-william-shakespeare-dies-81-24182185", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article24183175.ece/ALTERNATES/s1200/1_breaking_mirror__1_.png", "publishedAt": "2021-05-25T15:08:39Z", "content": "The first man in the world to be given the Covid vaccine has died.\r\nTributes have been paid to 81-year-old William Shakespeare who hit global headlines on December 8 last year when he became the firs… [+2774 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Pfizer ready with 50 mn doses for India; Moderna jab likely in 2022: Report - Business Standard", "description": "Moderna plans to launch its single-dose vaccine for the Indian market only in 2022, for which, they are in discussion with Cipla and other Indian companies, a source said", "url": "https://www.business-standard.com/article/current-affairs/moderna-expected-to-launch-single-dose-vaccine-in-india-next-year-report-121052501454_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/25/full/1621960979-0439.jpg", "publishedAt": "2021-05-25T15:06:00Z", "content": "Moderna is expecting to launch a single-dose COVID-19 vaccine in India next year and is in talks with Cipla among other Indian firms, while another US giant Pfizer is ready to offer 50 million shots … [+4511 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "Poland dangles lottery jackpot to boost COVID vaccination drive - Reuters", "description": "Poland will launch a lottery with prizes of as much as 1 million zlotys ($273,000) to encourage people to get vaccinated against COVID-19, the minister in charge of the immunisation programme said on Tuesday.", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/poland-dangles-lottery-jackpot-boost-covid-vaccination-drive-2021-05-25/", "urlToImage": "https://www.reuters.com/resizer/a47pSA3xwVJQQn6YK3zMRdZ2SEs=/1200x628/smart/cloudfront-us-east-2.images.arcpublishing.com/reuters/R3MQ6TY6RFJARKK6ZY5GVXA55U.jpg", "publishedAt": "2021-05-25T14:04:00Z", "content": "People walk in the city centre as the country's coronavirus disease (COVID-19) restrictions eased, in Warsaw, Poland May 15, 2021. Slawomir Kaminski/Agencja Gazeta/via REUTERS Poland will launch a lo… [+1363 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zinc-Rich Foods For Vegetarians: 5 Indian Foods That Can Help You Boost Immunity - NDTV", "description": "Zinc food sources: This nutrient is required  by the human body for strong immunity. Here are some desi foods high in zinc that can easily be a part of your diet.", "url": "https://www.ndtv.com/health/zinc-rich-foods-for-vegetarians-5-indian-foods-that-can-help-you-boost-immunity-2449068", "urlToImage": "https://i.ndtvimg.com/i/2017-06/chana-dal_650x400_61498590222.jpg", "publishedAt": "2021-05-25T12:54:07Z", "content": "Zinc food sources: You can add sesame seeds to your diet to increase overall zinc intake\r\nHighlights\r\n<ul><li>Zinc is helps in boosting immunity and supports metabolim function\r\n</li><li>This nutrien… [+3502 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New drugs to fight COVID-19 developed - Medical Xpress", "description": "Scientists from QIMR Berghofer Medical Research Institute in Queensland have developed two new drugs to both prevent SARS-CoV-2 infection, and also treat people who have been exposed to the virus so they do not develop severe disease.", "url": "https://medicalxpress.com/news/2021-05-drugs-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/new-drugs-to-fight-cov.jpg", "publishedAt": "2021-05-25T12:01:33Z", "content": "Scientists from QIMR Berghofer Medical Research Institute in Queensland have developed two new drugs to both prevent SARS-CoV-2 infection, and also treat people who have been exposed to the virus so … [+5170 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Mild COVID-19 induces lasting antibody protection: study - CGTN", "description": "Months after recovering from mild cases of COVID-19, people still have immune cells in their body pumping out antibodies against the virus, and such cells could persist for a lifetime, according to a study published in the journal Nature on Monday.", "url": "https://news.cgtn.com/news/2021-05-25/Mild-COVID-19-induces-lasting-antibody-protection-study-10y4nlQ1tOo/index.html", "urlToImage": "https://news.cgtn.com/news/2021-05-25/Mild-COVID-19-induces-lasting-antibody-protection-study-10y4nlQ1tOo/img/dc717bd501a04c5c88472ebddb6b28fe/dc717bd501a04c5c88472ebddb6b28fe-750.jpeg", "publishedAt": "2021-05-25T09:41:50Z", "content": "Months after recovering from mild cases of COVID-19, people still have immune cells in their body pumping out antibodies against the virus, and such cells could persist for a lifetime, according to a… [+2381 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PTI", "title": "Don't panic by colour of fungus, look for causes, risks: Experts advise as mucormycosis cases rise - Yahoo India News", "description": "New Delhi, May 25 (PTI) Amid rising mucormycosis cases among Covid patients and those who have recovered from it, epidemiologists Tuesday advised people to...", "url": "https://in.news.yahoo.com/dont-panic-colour-fungus-look-093715684.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2021-05-25T09:37:15Z", "content": "New Delhi, May 25 (PTI) Amid rising mucormycosis cases among Covid patients and those who have recovered from it, epidemiologists Tuesday advised people to not get panicked by the colour of the fungu… [+4935 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Monitoring 2 signs easily measured at home can cut COVID death risk - Zee News", "description": "Simply monitoring respiration rate and blood-oxygen saturation at home can cut the risk of death due to COVID-19, finds a study.", "url": "https://zeenews.india.com/health/monitoring-2-signs-easily-measured-at-home-can-cut-covid-death-risk-2364249", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/05/25/938691-covid-19-new-variant.png", "publishedAt": "2021-05-25T09:24:24Z", "content": "New York: Simply monitoring respiration rate and blood-oxygen saturation at home can cut the risk of death due to COVID-19, finds a study.\r\nAccording to the current guidance from the US Centers for D… [+2081 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Press (re)play to remember: How the brain strengthens memories during sleep - Medical Xpress", "description": "While we sleep, the brain produces particular activation patterns. When two of these patterns—slow oscillations and sleep spindles—gear into each other, previous experiences are reactivated. The stronger the reactivation, the clearer will be our recall of pas…", "url": "https://medicalxpress.com/news/2021-05-replay-brain-memories.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/10-brain.jpg", "publishedAt": "2021-05-25T09:02:20Z", "content": "While we sleep, the brain produces particular activation patterns. When two of these patternsslow oscillations and sleep spindlesgear into each other, previous experiences are reactivated. The strong… [+2955 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": null, "title": "COVID-19 Vaccination: What happens if you miss your 2nd dose? Is it safe to mix two vaccines? Experts answer - Jagran English", "description": "COVID 19 Vaccination  In such a situation many people are worried about what will happen if their second dose is delayed or is replaced by another vaccine", "url": "https://english.jagran.com/lifestyle/covid19-vaccination-what-happens-if-you-miss-your-2nd-dose-is-it-safe-to-mix-two-vaccines-experts-answer-10027092", "urlToImage": "https://imgeng.jagran.com/images/2021/may/vaccine1621931818832.jpg", "publishedAt": "2021-05-25T08:27:06Z", "content": "New Delhi | Jagran Lifestyle Desk: The shortage of vaccines in different states of India has brought the vaccination drive to a halt, leaving many people without getting the vaccine of their choice. … [+1808 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "First case of patient infected with black, white and yellow fungus reported from UP's Ghaziabad - Deccan Herald", "description": "After cases of black and white fungus, both post-Covid complications, have been reported from several states, a first such case of yellow fungus was detected in Uttar Pradesh's Ghaziabad district on Monday, informed Dr. BP Tyagi, an ENT (Ear-Nose-Throat) spec…", "url": "https://www.deccanherald.com/video/national/first-case-of-patient-infected-with-black-white-and-yellow-fungus-reported-from-up-s-ghaziabad-989725.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2021/05/25/may25v5-989725-1621922570.jpg", "publishedAt": "2021-05-25T06:02:50Z", "content": "After cases of black and white fungus, both post-Covid complications, have been reported from several states, a first such case of yellow fungus was detected in Uttar Pradesh's Ghaziabad district on … [+769 chars]"}, {"source": {"id": null, "name": "Interviewtimes.net"}, "author": null, "title": "Yellow Fungus Reported, Not To Categorise The Fungal Infection Based On Colour Says AIIMS Chief - Interview Times", "description": "All India Institute of Medical Sciences (AIIMS) Delhi director Randeep Guleria urged the people to refrain from categorising the fungal infections based on", "url": "https://interviewtimes.net/yellow-fungus-reported-not-to-categorise-the-fungal-infection-based-on-colour-says-aiims-chief/", "urlToImage": "https://interviewtimes.net/wp-content/uploads/2021/05/Guleria-1.jpg", "publishedAt": "2021-05-25T05:50:55Z", "content": "After cases of black and white fungus or mucormycosis which has been worrying over the past weeks in India, recently a yellow fungus disease has been reported from Ghaziabad.\r\nAfter been found the se… [+1321 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "COVID 19: How zinc may help protect against coronavirus - The Indian Express", "description": "“In the current situation, zinc emerges as an important element of choice for the management of Covid-19 symptoms along with anti-infective and other antiparasitic drug,” according to Dr Scott Read, senior lecturer, School of Medicine at Western Sydney Univer…", "url": "https://indianexpress.com/article/lifestyle/health/covid-19-zinc-supplementation-right-dosage-pandemic-7322842/", "urlToImage": "https://images.indianexpress.com/2021/05/zinc_1200_getty.jpg", "publishedAt": "2021-05-25T05:14:16Z", "content": "The second wave of covid-19 infections has proven to be even more contagious and fatal than the first one. This has even resulted in an excess burden on the healthcare system, coupled with a shortage… [+2802 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Immune system has long-term defenses after mild Covid; children may be key carriers of virus variants - India Today", "description": "The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the illness caused by the virus.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/immune-system-has-long-term-defenses-after-mild-covid-children-may-be-key-carriers-of-virus-variants-1806615-2021-05-25", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/virus-647x363.jpeg?hNxOjf1GZ6MGnp5p55R26y91.CJYZvFQ", "publishedAt": "2021-05-25T05:00:29Z", "content": "The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the illness caused by the virus.\r\nImmune system … [+3862 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "India's vaccine-related decisions based on science, says NTAGI chairperson - Hindustan Times", "description": "The National Expert Group on Vaccine Administration for Covid-19 (NEGVAC) had recommended that the vaccination should be deferred by three months after clinical recovery of the illness. | Latest News India", "url": "https://www.hindustantimes.com/india-news/indias-vaccine-related-decisions-based-on-science-says-ntagi-chairperson-101621908292466.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/25/1600x900/AFP_9AN2B4_1621902374304_1621913314902.jpg", "publishedAt": "2021-05-25T03:47:37Z", "content": "National Technical Advisory Group on Immunisation (NTAGI) chairperson Dr NK Arora on Monday justified the government's decision to defer vaccination by three months after clinical recovery from the c… [+1886 chars]"}, {"source": {"id": null, "name": "Swarajya"}, "author": "Swarajya Staff", "title": "VC Tariq Mansoor Blames Vaccine Hesitancy For High Covid Related Deaths At Aligarh Muslim University - Swarajya", "description": null, "url": "https://swarajyamag.com/insta/vc-tariq-mansoor-blames-vaccine-hesitancy-for-high-covid-related-deaths-at-aligarh-muslim-university", "urlToImage": "https://gumlet.assettype.com/swarajya%2F2021-05%2F2a8636c7-496e-4665-a3d7-2422b6ebb5e6%2FBED4E6F9_27C6_4B60_BD13_D11D9D022EBF.webp?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-25T01:52:00Z", "content": "After at least 40 serving and retired teachers have died in recent weeks due to Covid or Covid-like symptoms, the Vice Chancellor of Aligarh Muslim University (AMU) Tariq Mansoor said vaccine hesitan… [+1375 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "U.S. reports lowest number of new COVID-19 cases in nearly a year - Reuters", "description": "The United States last week reported the lowest number of new COVID-19 cases in nearly a year, with new infections dropping 26% from the previous seven days to just under 180,000, according to a Reuters analysis of state and county data.", "url": "https://www.reuters.com/world/us/us-reports-lowest-number-new-covid-19-cases-nearly-year-2021-05-24/", "urlToImage": "https://www.reuters.com/resizer/B_lV9SmpF_uuWlpZ-9wsvgpoXYM=/1200x628/smart/cloudfront-us-east-2.images.arcpublishing.com/reuters/4DMONDGTLBKRXFSNON6NCELB7M.jpg", "publishedAt": "2021-05-24T23:15:00Z", "content": "The United States last week reported the lowest number of new COVID-19 cases in nearly a year, with new infections dropping 26% from the previous seven days to just under 180,000, according to a Reut… [+1747 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "6-month multidisciplinary follow-up and outcomes of patients with paediatric inflammatory multisystem syndrome (PIMS-TS) at a UK tertiary paediatric hospital: a retrospective cohort study - The Lancet", "description": "Despite initial severe illness, few organ-specific sequelae were observed at 6 months.\nOngoing concerns requiring physical re-conditioning and mental health support remained,\nand physiotherapy assessments revealed persisting poor exercise tolerance. Longer-te…", "url": "https://www.thelancet.com/journals/lanchi/article/PIIS2352-4642(21)00138-3/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/04646a82-d0ab-404d-b205-5ef8f128fbea/gr1.jpg", "publishedAt": "2021-05-24T22:35:30Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2021 Elsevier In… [+157 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Sarah Boseley", "title": "Most children with post-Covid disease recover within six months, study finds - The Guardian", "description": "Small study looks at complications affecting tiny minority of children, which had caused major concern", "url": "https://amp.theguardian.com/world/2021/may/24/most-children-with-post-covid-disease-recover-within-six-months-study-finds", "urlToImage": null, "publishedAt": "2021-05-24T21:30:00Z", "content": "CoronavirusSmall study looks at complications affecting tiny minority of children, which had caused major concern\r\nMon 24 May 2021 22.30 BST\r\nChildren at a leading London hospital who were admitted w… [+4008 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Nancy Lapid", "title": "Immune system has long-term defenses after mild COVID-19; children may be key carriers of virus variants - Reuters", "description": "The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the illness caused by the virus.", "url": "https://www.reuters.com/lifestyle/science/immune-system-has-long-term-defenses-after-mild-covid-19-children-may-be-key-2021-05-24/", "urlToImage": "https://www.reuters.com/resizer/DMG7V-jj280WGJXHXZCqz7iO-9M=/1200x628/smart/cloudfront-us-east-2.images.arcpublishing.com/reuters/KEWNZCYVVZKYLLYK2JILDRD2F4.jpg", "publishedAt": "2021-05-24T19:38:00Z", "content": "A woman holds a small bottle labelled with a \"Coronavirus COVID-19 Vaccine\" sticker and a medical syringe in this illustration taken October 30, 2020. REUTERS/Dado Ruvic/File PhotoThe following is a … [+4150 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Concern In Karnataka As 1.4 Lakh Children Get Covid In Second Wave - NDTV", "description": "Around 1.4 lakh children were infected with Covid in Karnataka in the period between March-end and mid-May. Around 40,000 of the affected children were below the age of 10 years. The rest were between the ages of 10 years and 19 years.", "url": "https://www.ndtv.com/karnataka-news/concern-in-karnataka-as-1-4-lakh-children-get-covid-in-second-wave-2448603", "urlToImage": "https://c.ndtvimg.com/2020-11/i1ied698_delhi-coronavirus-test-pti-_625x300_11_November_20.jpg", "publishedAt": "2021-05-24T16:10:39Z", "content": "India's Paediatric Association has expressed doubts about the third wave affecting children (File)\r\nBengaluru: Around 1.4 lakh children were infected with Covid in Karnataka in the period between Mar… [+2970 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "5 COVID-19 Vaccine Myths, Debunked - Mental Floss", "description": "Is the COVID-19 vaccine safe? What do COVID-19 vaccine side effects really mean? Here’s the truth about some prevalent misinformation.", "url": "https://www.mentalfloss.com/article/646841/covid-19-vaccine-myths-debunked", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1349,w_2400,x_0,y_182/v1621611542/shape/mentalfloss/646841-gettyimages-1290590624.jpg?itok=lB6EljKJ", "publishedAt": "2021-05-24T16:03:16Z", "content": "The rush to develop, authorize, and administer an effective COVID-19 vaccine has left many people skeptical about its safetyand reluctant to get vaccinated. And there's plenty of misinformation (and … [+4284 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Why is Covid killing so many pregnant women in India? - Deccan Herald", "description": "By Alia Allana, The doctors at the Government Institute of Medical Sciences, also known as the G.I.M.S., a public hospital in Noida, a suburb of Delhi, recently told me that during the first wave of Covid-19 last year, most pregnant women had moderate symptom…", "url": "https://www.deccanherald.com/national/why-is-covid-killing-so-many-pregnant-women-in-india-989514.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/05/24/istock-1136606735-1593794690-1-989514-1621872601.jpg", "publishedAt": "2021-05-24T15:07:09Z", "content": "By Alia Allana,\r\nThe doctors at the Government Institute of Medical Sciences, also known as the G.I.M.S., a public hospital in Noida, a suburb of Delhi, recently told me that during the first wave of… [+9218 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Amy Dockser Marcus", "title": "Gene Therapy, High-Tech Goggles Restore Some Vision to Blind People - The Wall Street Journal", "description": "New treatment using optogenetics has restored limited vision to people blinded by hereditary retinal disease", "url": "https://www.wsj.com/articles/gene-therapy-high-tech-goggles-restore-some-vision-to-blind-people-11621868401", "urlToImage": "https://images.wsj.net/im-342516/social", "publishedAt": "2021-05-24T15:00:00Z", "content": "Scientists are making dramatic strides toward a goal that once seemed almost unimaginable: Restoring limited vision to people affected by a previously irreversible form of blindness caused by an inhe… [+1579 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "3.6% of Hospitalised Covid-19 Patients Had Bacterial, Fungal Infections During 1 - News18", "description": "As India continues to see a rise in black fungus cases, an ICMR study revealed that at least 3.", "url": "https://www.news18.com/news/india/3-6-of-hospitalised-covid-19-patients-had-bacterial-fungal-infections-during-1st-wave-icmr-3772193.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1620313319_untitled-design-44.png", "publishedAt": "2021-05-24T13:57:16Z", "content": "As India continues to see a rise in black fungus cases, an ICMR study revealed that at least 3.6% of hospitalised Covid-19 patients were affected with secondary bacterial and fungal infections during… [+4198 chars]"}, {"source": {"id": null, "name": "Gaonconnection.com"}, "author": null, "title": "Explained: First case of 'yellow fungus' reported from Ghaziabad — why fungal infections are on the rise amidst COVID19 - Gaonconnection | Your Connection with Rural India - Gaon Connection English", "description": "Experts have attributed the recent cases of black fungus and white fungus infections in India as an aftermath of COVID19 infection and an extremely compromised immune system. Is the same applicable for yellow fungus? More details here.", "url": "https://en.gaonconnection.com/yellow-fungus-black-white-ghaziabad-covid19-immune-system-steroids-risks-coronavirus-oxygen-steroids/", "urlToImage": "https://en.gaonconnection.com/wp-content/uploads/2021/05/Yellow-fungus.jpg", "publishedAt": "2021-05-24T13:30:50Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "COVID-19: Heres Why We Get Vaccine Shots in the Arm - News18", "description": "While India is facing the second wave of Covid-19, the government is trying its best to vaccinate the population as soon as people.", "url": "https://www.news18.com/news/lifestyle/covid-19-heres-why-we-get-vaccine-shots-in-the-arm-3771701.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1621855982_shutterstock_1767084407.jpg", "publishedAt": "2021-05-24T11:36:12Z", "content": "While India is facing the second wave of Covid-19, the government is trying its best to vaccinate the population as soon as people. Covid-19 vaccines are administered to the upper arm. If you are won… [+1650 chars]"}, {"source": {"id": null, "name": "NYOOOZ"}, "author": "NYOOOZ", "title": "White Fungus: What causes the infection and who are at risk of contracting it | Patna NYOOOZ - NYOOOZ", "description": "<p>Amid a rise in Black Fungus infections among&nbsp;COVID-19&nbsp;patients or survivors, four cases of White Fungus infection have been reported from Bihar&rsquo;s Patna.&nbsp;According to news agency, one case has also been reported from Madhya Pradesh`s Ja…", "url": "https://www.nyoooz.com/news/patna/1579190/white-fungus-what-causes-the-infection-and-who-are-at-risk-of-contracting-it/", "urlToImage": "https://www.nyoooz.com/uploads/nyoooz-images/nurse4.jpg", "publishedAt": "2021-05-24T09:30:13Z", "content": "Amid a rise in Black Fungus infections among COVID-19 patients or survivors, four cases of White Fungus infection have been reported from Bihar’s Patna. According to news agency, one case has also be… [+2008 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "No link between milk and increased cholesterol according to new study of 2 million people - Medical Xpress", "description": "Regular consumption of milk is not associated with increased levels of cholesterol, according to new research.", "url": "https://medicalxpress.com/news/2021-05-link-cholesterol-million-people.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/2-milk.jpg", "publishedAt": "2021-05-24T07:15:50Z", "content": "Regular consumption of milk is not associated with increased levels of cholesterol, according to new research.\r\nA study published in the International Journal of Obesity looked at three large populat… [+3100 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Researchers find new multi drug-resistant bacteria in scat of vine snake - The Hindu", "description": "Ravindra Chaudhari, one of the researchers, said the microorganisms present in scats of animals can very easily come in contact with human beings through water flow during rainy season and also through air", "url": "https://www.thehindu.com/sci-tech/science/researchers-find-new-multi-drug-resistant-bacteria-in-scat-of-vine-snake/article34631142.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/oegtpj/article34631144.ece/ALTERNATES/LANDSCAPE_615/25ISTBSS-VineSnGRK6AGD4K3jpgjpg", "publishedAt": "2021-05-24T06:01:19Z", "content": "(Subscribe to Science For All, our weekly newsletter, where we aim to take the jargon out of science and put the fun in. Click here.)\r\nA group of researchers from Pune and Chandigarh has discovered n… [+2565 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "COVID-19 mortality associated with 2 signs easily measured at home - EurekAlert", "description": "A study of 1,095 patients hospitalized with COVID-19 found that two easily measured signs of health - respiration rate and blood-oxygen saturation - predict higher mortality. This context is lacking in current CDC guidance, which tells people with COVID-19 to…", "url": "https://eurekalert.org/pub_releases/2021-05/uows-cma052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-24T05:32:22Z", "content": "A study of 1,095 patients hospitalized with COVID-19 discovered that two easily measurable signs of health - respiration rate and blood-oxygen saturation - are distinctly predictive of higher mortali… [+4746 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "India’s Covid-19 management has a prescription problem - India Today", "description": "Amid a rise in infections in Covid patients, researchers and medical practitioners have questioned if the over-prescription of drugs, whose usage is not supported by evidence, is responsible for these ailments.", "url": "https://www.indiatoday.in/india/story/india-covid-19-management-prescription-problem-1806167-2021-05-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/2021-05-01T113352Z_1012230216__0-647x363.png?SmLOLtfDUCk8eeHtE_w_i_6eeB224iat", "publishedAt": "2021-05-24T04:52:54Z", "content": "As the cases of Covid treatment-linked diseases like mucormycosis witness a steep rise, questions have been raised about combinations of repurposed and experimental medicines recommended by health pr… [+10509 chars]"}, {"source": {"id": null, "name": "Swarajya"}, "author": "Swarajya Staff", "title": "Prefer Dealing With Centre Directly Instead Of States, Private Players For Covid-19 Jabs: Pfizer, Moderna - Swarajya", "description": null, "url": "https://swarajyamag.com/insta/prefer-dealing-with-centre-directly-instead-of-states-private-players-for-covid-19-jabs-pfizer-moderna", "urlToImage": "https://gumlet.assettype.com/swarajya%2F2020-11%2Fcb6f9702-87c2-40a9-80b4-12c7c71235a1%2FEm8cb7hW4AAeWUI.jfif?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-24T03:23:00Z", "content": "Global drug majors such as Moderna and Pfizer have reiterated that they will be dealing only with the central government on the issue of supplying their Covid-19 vaccine doses.\r\nAccordingly, Moderna … [+1091 chars]"}]}