{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Dnaindia.com"},"author":"DNA Web Team","title":"Centre releases information on use of necessary medicines for COVID-19 - DNA India","description":"DNA India has  transcribed the message in the video released by MoHFW for readers:","url":"https://www.dnaindia.com/india/report-centre-releases-information-on-use-of-necessary-medicines-for-covid-19-2821537","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/04/18/902569-med-guide.jpg","publishedAt":"2020-04-18T10:40:24Z","content":null},{"source":{"id":null,"name":"Telanganatoday.com"},"author":"Telangana Today","title":"COVID-19 striking more children than expected: Study - Telangana Today","description":"New York: Contrary to what governments and a school of scientists claim (including Tesla and SpaceX CEO Elon Musk), the number of children infected with the coronavirus is far more extensive than what is currently reported -- a hidden detail that could vastly…","url":"https://telanganatoday.com/covid-19-striking-more-children-than-expected-study","urlToImage":"https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg","publishedAt":"2020-04-18T09:47:00Z","content":"New York: Contrary to what governments and a school of scientists claim (including Tesla and SpaceX CEO Elon Musk), the number of children infected with the coronavirus is far more extensive than what is currently reported — a hidden detail that could vastly … [+3227 chars]"},{"source":{"id":null,"name":"Thewire.in"},"author":null,"title":"Why India’s Stated Policy on Hydroxychloroquine Makes No Sense - The Wire","description":"The ICMR's reasoning for why it is recommending hydroxychloroquine as prophylaxis to healthcare workers is just unscientific.","url":"https://m.thewire.in/article/government/why-indias-stated-policy-on-hydroxychloroquine-makes-no-sense","urlToImage":"https://cdn.thewire.in/wp-content/uploads/2020/04/18144100/reuters-800x400.jpg","publishedAt":"2020-04-18T09:40:48Z","content":"In a recent video published by ANI, the chief epidemiologist of the Indian Council of Medical Research (ICMR), Raman Gangakhedkar, made a couple of odd statements about hydroxychloroquine. He said that because there was so little evidence of the drug’s effica… [+10162 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Coronavirus: How long does it take to recover? - BBC News","description":"Recovery from Covid-19 can be a lengthy process, depending on how seriously people get the virus.","url":"https://www.bbc.co.uk/news/health-52301633","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/C594/production/_111808505_7e495af9-90bd-4870-8b7c-c224197959ce.jpg","publishedAt":"2020-04-18T08:44:02Z","content":"Image copyrightGetty Images\r\nCovid-19 only emerged at the end of 2019, but already there are signs it may take a long time for some patients to get back to full health. \r\nRecovery time will depend on how sick you become in the first place. Some people will sh… [+5142 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"PTI","title":"UK sets up new Vaccine Taskforce as coronavirus death toll hits 14,576 - Livemint","description":"It is aimed at coordinating efforts to discover a vaccine, funnel resources and support to industry and research institutions.UK scientists are working as fast as they can to find a vaccine that fights coronavirus","url":"https://www.livemint.com/news/world/uk-sets-up-new-vaccine-taskforce-as-coronavirus-death-toll-hits-14-576-11587198329961.html","urlToImage":"https://images.livemint.com/img/2020/04/18/600x338/AFP_1QN983_1587199222275_1587199237279.jpg","publishedAt":"2020-04-18T08:42:06Z","content":"London: The UK has set up a taskforce to urgently find a coronavirus vaccine and prepare the industry to manufacture it at scale once it is developed, as 847 fresh deaths were reported due to the COVID-19, taking the number of fatalities in the country to 14,… [+3640 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"IANS","title":"NASA steps in to help develop COVID-19 solutions - Livemint","description":"One of their first efforts was to build a prototype oxygen hood that has now proven to work for the doctors at the hospital, NASA said","url":"https://www.livemint.com/news/world/nasa-steps-in-to-help-develop-covid-19-solutions-11587196762979.html","urlToImage":"https://images.livemint.com/img/2020/04/18/600x338/2019-08-15T211328Z_1_LYNXNPEF7E22G_RTROPTP_3_SPACE-EXPLORATION-NASA-MOON_1565985812460_1587198002193.JPG","publishedAt":"2020-04-18T08:27:02Z","content":"Washington: In a bid to find solutions that can address shortage of critical medical equipment like ventilators in tackling the COVID-19 crisis, the US space agency has joined forces with a task force in California to build medical devices to help patients in… [+1827 chars]"},{"source":{"id":null,"name":"Business-standard.com"},"author":"BS Web Team","title":"Coronavirus: What is convalescent plasma therapy? Things you should know - Business Standard","description":"Convalescent plasma is an experimental procedure for coronavirus patients","url":"https://www.business-standard.com/article/health/coronavirus-treatment-what-is-convalescent-plasma-therapy-explained-on-covid-19-cure-120041800340_1.html","urlToImage":"https://bsmedia.business-standard.com/_media/bs/img/article/2020-04/15/full/1586922252-2897.jpg","publishedAt":"2020-04-18T08:17:38Z","content":"With nearly 2.2 million cases already and over 150,000 deaths to coronavirus infections globally, the world seems to have become very helpless in the face of the Covid-19 pandemic. Scientists are scrambling for vaccines, drugs and other ways that could be use… [+4242 chars]"},{"source":{"id":null,"name":"Sbs.com.au"},"author":null,"title":"Death of 42-year-old in Australia shows coronavirus is not an 'old person's disease', say health authorities - SBS News","description":"The death of a man in his 40s in Australia shows COVID-19 is not an old person's disease, the Deputy Chief Medical Officer Paul Kelly said.","url":"https://www.sbs.com.au/news/death-of-42-year-old-in-australia-shows-coronavirus-is-not-an-old-person-s-disease-say-health-authorities","urlToImage":"https://sl.sbs.com.au/public/image/file/7873464b-788b-4e98-8f29-c4d05ce0ba24/crop/16x9","publishedAt":"2020-04-18T08:11:13Z","content":"The death of a 42-year old male in Australia reinforces that coronavirus is not an old person's disease, Deputy Chief Medical Officer Paul Kelly has warned.\r\nThe man was a crew member of the Artania cruise ship, which was finally leaving Fremantle, Western Au… [+3916 chars]"},{"source":{"id":null,"name":"Itv.com"},"author":null,"title":"Three million packs of paracetamol from India to replenish British supermarkets shelves - ITV News","description":"After stockpilers emptied paracetamol  from shelves of left British supermarket and retailers, Britain has bought around 3,000,000 packs of paracetamol from India.\n\nThe Government ordered the huge amount from India, where the drugs are made, who have approved…","url":"https://www.itv.com/news/2020-04-18/with-fresh-stock-of-3m-packs-of-paracetamol-from-india-shelves-in-british-supermarkets-would-be-replenished/","urlToImage":"https://news.images.itv.com/image/file/2188978/img.jpg","publishedAt":"2020-04-18T07:31:00Z","content":"After stockpilers emptied paracetamol from shelves of left British supermarket and retailers, Britain has bought around 3,000,000 packs of paracetamol from India.\r\nThe Government ordered the huge amount from India, where the drugs are made, who have approved … [+1291 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"Coronavirus pandemic: WHO unsure if antibodies protect against Covid-19 - India Today","description":"A WHO's top emergencies expert said that the health organisation is not sure whether the presence of antibodies in blood gives full protection against reinfection with the new coronavirus.","url":"https://www.indiatoday.in/science/story/coronavirus-pandemic-who-unsure-antibodies-protect-against-covid-19-1668331-2020-04-18","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/APdrug_2-647x363.jpeg?.RL645wiZ52QuPF1ZOERMeJSy7C1UGzZ","publishedAt":"2020-04-18T07:16:06Z","content":"The World Health Organisation (WHO) is not sure whether the presence of antibodies in blood gives full protection against reinfection with the new coronavirus, Mike Ryan, the WHO's top emergencies expert, told a briefing on Friday.\r\nMike Ryan also said that e… [+917 chars]"},{"source":{"id":null,"name":"Daijiworld.com"},"author":null,"title":"How Hong Kong managed COVID-19 without complete lockdown - Daijiworld.com","description":"","url":"http://www.daijiworld.com/news/newsDisplay.aspx?newsID=698096","urlToImage":"http://daijiworld.com/images/daijiSquareLogo.png","publishedAt":"2020-04-18T07:11:45Z","content":"Hong Kong, Apr 18 (IANS): With widespread testing, contact tracing and population behavioural changes Hong Kong appears to have managed to contain the first wave of COVID-19 without resorting to drastic measures like complete lockdown which now threaten to da… [+4219 chars]"},{"source":{"id":null,"name":"Skynews.com.au"},"author":null,"title":"University of Oxford could have coronavirus vaccine ready 'by spring' - Sky News Australia","description":"Euronews reporter Trent Murray says the University of Oxford could have a coronavirus vaccine ready early next year. \n\nThe university expected it could have one million doses of the vaccine ready to distribute by spring in the UK. \n\n“The government’s very opt…","url":"https://www.skynews.com.au/details/_6150404112001","urlToImage":"https://connect-images.viago.io/w_480,c_scale,e_sharpen:80,q_95/74b59ff6ddd457fd349e141c55c7380304593b47164af4086a5751dc467df63a","publishedAt":"2020-04-18T06:29:06Z","content":null},{"source":{"id":null,"name":"Mathrubhumi.com"},"author":"Mathrubhumi","title":"COVID-19 recovered Malappuram native dies under observation - Mathrubhumi English","description":"Malappuram: A Malappuram native, who was under observation after recovering from COVID-19, died here on Saturday. Veerankutty (85) passed away on Saturday early morning at 4 am while he was awaiting the final COVID-19 test result. The last test result came ou…","url":"https://english.mathrubhumi.com/news/kerala/covid-19-recovered-malappuram-native-dies-under-observation-1.4698016","urlToImage":"https://english.mathrubhumi.com/polopoly_fs/1.4698003.1587178320!/httpImage/image.jpg_gen/derivatives/landscape_1080_600/image.jpg","publishedAt":"2020-04-18T06:18:02Z","content":"Malappuram: A Malappuram native, who was under observation after recovering from COVID-19, died here on Saturday. Veerankutty (85) passed away on Saturday early morning at 4 am while he was awaiting the final COVID-19 test result. The last test result came ou… [+980 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"Number of People With Covid-19 Could be 50 to 85 Times Higher Than Official Figures: Stanford Study - News18","description":"To attain herd immunity, 50 per cent or more people in a population would need to have contracted the virus, and be cured of it, the study said.","url":"https://www.news18.com/news/world/number-of-people-with-covid-19-could-be-50-to-85-times-higher-than-official-figures-stanford-study-2582641.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/03/coronavirus-outbreak.jpg","publishedAt":"2020-04-18T05:58:52Z","content":"A study from Stanford University has found that the number of people infected with the novel coronavirus maybe significantly higher than what was originally anticipated.\r\nResearchers analysed samples of 3,300 residents of Californias Santa Clara county and di… [+3123 chars]"},{"source":{"id":null,"name":"Asiatimes.com"},"author":"Issam Ahmed","title":"How Covid-19 may affect the brain - Asia Times","description":"A pattern is emerging among Covid-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are …","url":"http://asiatimes.com/2020/04/how-covid-19-may-affect-the-brain/","urlToImage":"https://i1.wp.com/asiatimes.com/wp-content/uploads/2020/04/000_1PV8IC.jpg?fit=1200%2C724&ssl=1","publishedAt":"2020-04-18T05:56:00Z","content":"A pattern is emerging among Covid-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are or what year it is.\r\nAt times this is linked to low oxygen lev… [+4774 chars]"},{"source":{"id":null,"name":"Thehealthsite.com"},"author":"Jahnavi Sarma","title":"COVID-19: It can lead to kidney and liver damage too - TheHealthSite","description":"We know that COVID-19 can cause lung damage. But now experts say that the new variant of coronavirus can also affect other organs in your body.","url":"https://www.thehealthsite.com/news/covid-19-it-can-lead-to-kidney-and-liver-damage-too-740068/","urlToImage":"https://st1.thehealthsite.com/wp-content/uploads/2020/04/coronavirus-organs-655x353.jpg","publishedAt":"2020-04-18T05:45:00Z","content":"With the COVID-19 pandemic raging unabated across the world, let us revisit the symptoms of this deadly contagion. This virus directly affects the lungs. If you get this infection, you will have inflammation in the small sacs present in your lungs. That is wh… [+2770 chars]"},{"source":{"id":null,"name":"Bbc.com"},"author":"https://www.facebook.com/bbcnews","title":"Coronavirus: Concern over protective kit guidance change - BBC News","description":"There are warnings patients could be at risk if NHS staff reuse equipment or fail to wear full gowns.","url":"https://www.bbc.com/news/uk-52335561","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/1496E/production/_111843348_ppe.jpg","publishedAt":"2020-04-18T04:58:20Z","content":"Concerns have been raised that updated government guidance on personal protective equipment (PPE) could put hospital staff and patients at risk.\r\nHealthcare workers have been advised to reuse gowns or wear different kit, such as plastic aprons with coveralls,… [+5376 chars]"},{"source":{"id":null,"name":"Daijiworld.com"},"author":null,"title":"Blood test may help doctors catch pancreatic cancer early - Daijiworld.com","description":"","url":"https://www.daijiworld.com/news/newsDisplay.aspx?newsID=698049","urlToImage":"http://www.tvdaijiworld.com/images6/asha_17420_bldtst.jpg","publishedAt":"2020-04-18T04:45:08Z","content":"New York, Apr 18 (IANS): Researchers have revealed that a blood test may be able to help doctors detect the most common form of pancreatic cancer in its early stages. The test could also accurately stage a patient's disease and guide doctors to appropriate tr… [+2016 chars]"},{"source":{"id":null,"name":"Thestatesman.com"},"author":"SNS Web","title":"New York woman meets her baby she gave birth to in COVID-19 coma for first time - The Statesman","description":"36-year-old Yanira Soriano, was eight months pregnant when she was tested coronavirus positive. Her husband who had a less serious case was able to remain at home, around the same time.","url":"https://www.thestatesman.com/coronavirus/new-york-woman-meets-her-baby-she-gave-birth-to-in-covid-19-coma-for-first-time-1502878254.html","urlToImage":"https://www.thestatesman.com/wp-content/uploads/2020/04/baby.jpg","publishedAt":"2020-04-18T04:23:00Z","content":"Amid the gloom and fear that the Coronavirus pandemic has created globally,  a few happy moments are also being witnessed as well sometimes giving hope and something to cheer about . A woman in New York has met for the first time the baby she gave birth to in… [+2559 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"Coronavirus in India: Covid-19 patient who tested negative dies in Kerala - India Today","description":"An 85-year-old person, who had tested positive for Covid-19 and later tested negative twice, died due to heart attack early Saturday in Kerala. Health Minister KK Shailaja confirmed that the patient did not die of Covid-19 but other ailments.","url":"https://www.indiatoday.in/india/story/coronavirus-india-elderly-covid-19-patient-tested-negative-dies-kerala-1668277-2020-04-18","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/PTI25-03-2020_000136B-min-1guj_6-647x363.jpeg?.CcFM6ip4Ac_Ok4XBwUJ3MZb4UUyGazF","publishedAt":"2020-04-18T04:14:08Z","content":"An 85-year-old Covid-19 patient, who had later tested negative for the novel coronavirus, died due to heart attack early Saturday in Kerala.\r\nSaturday noon, Kerala Health Minister KK Shailaja confirmed that the patient tested negative for the third time as we… [+1966 chars]"}]}