{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"COVID-19 in Britain: The death toll and the media deference | The Listening Post (Full) - Al Jazeera English","description":"On The Listening Post this week: From \"herd immunity\" to lack of testing, Britain's coronavirus response has needed more media scrutiny. Plus, Israeli survei...","url":"https://www.youtube.com/watch?v=sWSHS6OxLQM","urlToImage":"https://i.ytimg.com/vi/sWSHS6OxLQM/maxresdefault.jpg","publishedAt":"2020-04-18T11:37:56Z","content":"On The Listening Post this week: From \"herd immunity\" to lack of testing, Britain's coronavirus response has needed more media scrutiny. Plus, Israeli surveillance under cover of COVID-19.\r\nCOVID-19 in Britain: The death toll and the media deference\r\nAs the c… [+2545 chars]"},{"source":{"id":null,"name":"Dnaindia.com"},"author":"DNA Web Team","title":"Centre releases information on use of necessary medicines for COVID-19 - DNA India","description":"DNA India has  transcribed the message in the video released by MoHFW for readers:","url":"https://www.dnaindia.com/india/report-centre-releases-information-on-use-of-necessary-medicines-for-covid-19-2821537","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/04/18/902569-med-guide.jpg","publishedAt":"2020-04-18T10:40:24Z","content":null},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"The Hindu Net Desk","title":"Watch | Convalescent plasma therapy for COVID-19 patients - The Hindu","description":"A video on convalescent plasma therapy and its feasibility in COVID-19 patients","url":"https://www.thehindu.com/sci-tech/science/plasma-therapy-for-covid-19-patients/article31373992.ece","urlToImage":"https://www.thehindu.com/sci-tech/science/dr1561/article31374098.ece/ALTERNATES/LANDSCAPE_615/plasma-therapy-device-reutersjpg","publishedAt":"2020-04-18T09:55:14Z","content":"The health community across the world is looking at plasma or antibody therapy to battle COVID-19. Convalescent plasma has been listed as a therapeutic method by Chinas National Health Commission.\r\nIn India, many states have sought and received the approval o… [+641 chars]"},{"source":{"id":null,"name":"Thewire.in"},"author":null,"title":"Why India’s Stated Policy on Hydroxychloroquine Makes No Sense - The Wire","description":"The ICMR's reasoning for why it is recommending hydroxychloroquine as prophylaxis to healthcare workers is just unscientific.","url":"https://m.thewire.in/article/government/why-indias-stated-policy-on-hydroxychloroquine-makes-no-sense","urlToImage":"https://cdn.thewire.in/wp-content/uploads/2020/04/18144100/reuters-800x400.jpg","publishedAt":"2020-04-18T09:40:48Z","content":"In a recent video published by ANI, the chief epidemiologist of the Indian Council of Medical Research (ICMR), Raman Gangakhedkar, made a couple of odd statements about hydroxychloroquine. He said that because there was so little evidence of the drug’s effica… [+10162 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"PTI","title":"Ditch jet dryers: Paper towels more effective in removing coronavirus after washing hand - Economic Times","description":"Viral dispersal to clothing was 5-fold higher with hand dryers compared to paper towels.","url":"https://economictimes.indiatimes.com/magazines/panache/ditch-jet-dryers-paper-towels-more-effective-in-removing-coronavirus-after-washing-hand/articleshow/75200138.cms","urlToImage":"https://img.etimg.com/thumb/msid-75200313,width-1070,height-580,imgsize-474366,overlay-etpanache/photo.jpg","publishedAt":"2020-04-18T09:37:03Z","content":"LONDON: Using paper towels to dry hands is substantially more effective than jet dryers for removing viruses, including the novel coronavirus that causes COVID-19, according to a study. Hand drying is important to minimise the spread of dangerous microbes sin… [+6538 chars]"},{"source":{"id":null,"name":"Easternmirrornagaland.com"},"author":null,"title":"Covid-19 striking more children than expected, states study - Eastern Mirror","description":"Contrary to governments and some scientists' claims, the number of children infected with the coronavirus is more extensive than currently being reported.","url":"https://www.easternmirrornagaland.com/covid-19-striking-more-children-than-expected-study/","urlToImage":"https://www.easternmirrornagaland.com/wp-content/uploads/2018/04/baby-3289174_960_720.jpg","publishedAt":"2020-04-18T09:08:56Z","content":"New York, April 18 (IANS): Contrary to what governments and a school of scientists claim (including Tesla and SpaceX CEO Elon Musk), the number of children infected with the coronavirus is far more extensive than what is currently reported — a hidden detail t… [+3244 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Coronavirus: How long does it take to recover? - BBC News","description":"Recovery from Covid-19 can be a lengthy process, depending on how seriously people get the virus.","url":"https://www.bbc.co.uk/news/health-52301633","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/C594/production/_111808505_7e495af9-90bd-4870-8b7c-c224197959ce.jpg","publishedAt":"2020-04-18T08:44:02Z","content":"Image copyrightGetty Images\r\nCovid-19 only emerged at the end of 2019, but already there are signs it may take a long time for some patients to get back to full health. \r\nRecovery time will depend on how sick you become in the first place. Some people will sh… [+5142 chars]"},{"source":{"id":null,"name":"Telanganatoday.com"},"author":"Telangana Today","title":"Confusion, seizure, strokes: How COVID-19 may affect the brain - Telangana Today","description":"Washington D.C: A pattern is emerging among COVID-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are or what year it is. At times this is linked to…","url":"https://telanganatoday.com/confusion-seizure-strokes-how-covid-19-may-affect-the-brain","urlToImage":"https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg","publishedAt":"2020-04-18T08:09:00Z","content":"Washington D.C: A pattern is emerging among COVID-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are or what year it is.\r\nAt times this is linked t… [+4572 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"On-off social distancing may be needed until 2022: Harvard study - The intermittent approach - Economic Times","description":"A one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said. Their study comes as the US en…","url":"https://economictimes.indiatimes.com/news/politics-and-nation/on-off-social-distancing-may-be-needed-until-2022-harvard-study/the-intermittent-approach/slideshow/75218096.cms","urlToImage":"https://img.etimg.com/thumb/msid-75218096,width-1070,height-580,overlay-economictimes/photo.jpg","publishedAt":"2020-04-18T07:58:00Z","content":"18 Apr 2020, 01:28 PM IST\r\nA one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said. The… [+2314 chars]"},{"source":{"id":null,"name":"Eastmojo.com"},"author":"Team EastMojo","title":"40% of COVID-19 positive patients to be sent home in Mumbai - EastMojo","description":"40% of COVID-19 positive patients to be sent home in Mumbai","url":"https://www.eastmojo.com/coronavirus-updates/2020/04/18/40-of-covid-19-positive-patients-to-be-sent-home-in-mumbai","urlToImage":"https://gumlet.assettype.com/eastmojo%2F2020-04%2Ff25bdab1-daf9-431e-b2bc-bf35308d2776%2Fcovid_19_5000022_960_720.jpg?rect=0%2C0%2C960%2C504&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2020-04-18T07:57:43Z","content":"Mumbai: The state-appointed COVID-19 Task Force issued guidelines for positive patients and accordingly, 40% of patients in Mumbai can be shifted from hospitals to COVID care centres or their homes. According to the guidelines, asymptomatic patients without c… [+1036 chars]"},{"source":{"id":null,"name":"Nationalheraldindia.com"},"author":"IANS","title":"COVID-19 striking more children than expected: Study - National Herald","description":"Number of children infected with the coronavirus is far more extensive than what is currently reported a hidden detail that could vastly underestimate the demand on health care systems","url":"https://www.nationalheraldindia.com/international/covid-19-striking-more-children-than-expected-study","urlToImage":"https://gumlet.assettype.com/nationalherald%2F2020-03%2F3572375b-3f6b-4ed8-82e1-09325b0cdec2%2F05031_ap05_03_2020_000032b.jpg?rect=0%2C0%2C5760%2C3024&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2020-04-18T07:52:42Z","content":"\"Although the risk of severe illness from COVID-19 is lower in pediatric cases than adults, hospitals should be prepared and have the proper equipment and staffing levels to deal with a potential influx of younger patients,\" said author Jason Salemi, associat… [+896 chars]"},{"source":{"id":null,"name":"Itv.com"},"author":null,"title":"Three million packs of paracetamol from India to replenish British supermarkets shelves - ITV News","description":"After stockpilers emptied paracetamol  from shelves of left British supermarket and retailers, Britain has bought around 3,000,000 packs of paracetamol from India.\n\nThe Government ordered the huge amount from India, where the drugs are made, who have approved…","url":"https://www.itv.com/news/2020-04-18/with-fresh-stock-of-3m-packs-of-paracetamol-from-india-shelves-in-british-supermarkets-would-be-replenished/","urlToImage":"https://news.images.itv.com/image/file/2188978/img.jpg","publishedAt":"2020-04-18T07:31:00Z","content":"After stockpilers emptied paracetamol from shelves of left British supermarket and retailers, Britain has bought around 3,000,000 packs of paracetamol from India.\r\nThe Government ordered the huge amount from India, where the drugs are made, who have approved … [+1291 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"70 Covid-19 vaccines are in development around the world - TRT World","description":"As countries around the world start easing their lockdown restrictions, we're being warned the coronavirus threat will not be over until a vaccine is develop...","url":"https://www.youtube.com/watch?v=59g5jQRoqHo","urlToImage":"https://i.ytimg.com/vi/59g5jQRoqHo/hqdefault.jpg","publishedAt":"2020-04-18T07:16:28Z","content":"As countries around the world start easing their lockdown restrictions, we're being warned the coronavirus threat will not be over until a vaccine is developed. The World Health Organization says it will be at least a year before a vaccine is ready. Sarah Mor… [+352 chars]"},{"source":{"id":null,"name":"Socialnews.xyz"},"author":null,"title":"How Hong Kong managed COVID-19 without complete lockdown - SocialNews.XYZ","description":"Hong Kong, April 18 (SocialNews.XYZ) With widespread testing, contact tracing and population behavioural changes Hong Kong appears to have managed to contain the first wave of COVID-19 without resorting to drastic measures like complete lockdown... - Social N…","url":"https://www.socialnews.xyz/2020/04/18/how-hong-kong-managed-covid-19-without-complete-lockdown/","urlToImage":"https://i2.wp.com/www.socialnews.xyz/wp-content/uploads/2020/03/13/9e6d82357cf28954089b96efc3d4ebe1.jpg?fit=1280%2C720&quality=90&zoom=1&ssl=1","publishedAt":"2020-04-18T06:52:15Z","content":"Hong Kong, April 18 (SocialNews.XYZ) With widespread testing, contact tracing and population behavioural changes Hong Kong appears to have managed to contain the first wave of COVID-19 without resorting to drastic measures like complete lockdown which now thr… [+4244 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"What Makes Corona Virus So Different From Cancer And All Other Viruses In The Human History - India Today","description":"Upon asking, Siddhartha Mukherjee answers to what makes COVID 19 different form the other viruses that is in mankind history. He compares Coronavirus with SA...","url":"https://www.youtube.com/watch?v=su3v-oZqGfM","urlToImage":"https://i.ytimg.com/vi/su3v-oZqGfM/maxresdefault.jpg","publishedAt":"2020-04-18T06:49:15Z","content":null},{"source":{"id":null,"name":"Ummid.com"},"author":null,"title":"Number of coronavirus infected children far more than expected - ummid.com","description":"Pediatric coronavirus is highly complex, as many hospitals are prohibiting visitors in order to implement social distancing and quarantine protocols","url":"https://ummid.com/news/2020/april/18.04.2020/coronavirus-children-deaths.html","urlToImage":"https://ummid.com/news/2020/april/18.04.2020/corona-in-children.jpg","publishedAt":"2020-04-18T06:47:23Z","content":"[Image for representation.]\r\nNew York: Contrary to what governments and a school of scientists claim (including Tesla and SpaceX CEO Elon Musk), the number of children infected with the coronavirus is far more extensive than what is currently reported -- a hi… [+3391 chars]"},{"source":{"id":null,"name":"Skynews.com.au"},"author":null,"title":"University of Oxford could have coronavirus vaccine ready 'by spring' - Sky News Australia","description":"Euronews reporter Trent Murray says the University of Oxford could have a coronavirus vaccine ready early next year. \n\nThe university expected it could have one million doses of the vaccine ready to distribute by spring in the UK. \n\n“The government’s very opt…","url":"https://www.skynews.com.au/details/_6150404112001","urlToImage":"https://connect-images.viago.io/w_480,c_scale,e_sharpen:80,q_95/74b59ff6ddd457fd349e141c55c7380304593b47164af4086a5751dc467df63a","publishedAt":"2020-04-18T06:29:06Z","content":null},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Staff","title":"Britain launches coronavirus vaccine taskforce - Reuters India","description":"Britain launched a new coronavirus taskforce on Friday to support efforts to make a vaccine available to the public as quickly as possible.","url":"https://in.reuters.com/article/health-coronavirus-britain-vaccine-idINKBN21Z2QU","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200418&t=2&i=1515569200&w=1200&r=LYNXMPEG3G1VD","publishedAt":"2020-04-18T06:28:17Z","content":"LONDON (Reuters) - Britain launched a new coronavirus taskforce on Friday to support efforts to make a vaccine available to the public as quickly as possible. \r\nThe government said 21 new research projects would get funding from a 14 million pound investment … [+2358 chars]"},{"source":{"id":null,"name":"Mathrubhumi.com"},"author":"Mathrubhumi","title":"COVID-19 recovered Malappuram native dies under observation - Mathrubhumi English","description":"Malappuram: A Malappuram native, who was under observation after recovering from COVID-19, died here on Saturday. Veerankutty (85) passed away on Saturday early morning at 4 am while he was awaiting the final COVID-19 test result. The last test result came ou…","url":"https://english.mathrubhumi.com/news/kerala/covid-19-recovered-malappuram-native-dies-under-observation-1.4698016","urlToImage":"https://english.mathrubhumi.com/polopoly_fs/1.4698003.1587178320!/httpImage/image.jpg_gen/derivatives/landscape_1080_600/image.jpg","publishedAt":"2020-04-18T06:18:02Z","content":"Malappuram: A Malappuram native, who was under observation after recovering from COVID-19, died here on Saturday. Veerankutty (85) passed away on Saturday early morning at 4 am while he was awaiting the final COVID-19 test result. The last test result came ou… [+980 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"Number of People With Covid-19 Could be 50 to 85 Times Higher Than Official Figures: Stanford Study - News18","description":"To attain herd immunity, 50 per cent or more people in a population would need to have contracted the virus, and be cured of it, the study said.","url":"https://www.news18.com/news/world/number-of-people-with-covid-19-could-be-50-to-85-times-higher-than-official-figures-stanford-study-2582641.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/03/coronavirus-outbreak.jpg","publishedAt":"2020-04-18T05:58:52Z","content":"A study from Stanford University has found that the number of people infected with the novel coronavirus maybe significantly higher than what was originally anticipated.\r\nResearchers analysed samples of 3,300 residents of Californias Santa Clara county and di… [+3123 chars]"}]}