{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Clubic"}, "author": "Nathan Le Gohlisse", "title": "Bientôt des SSD de plus de 100 To grâce à la nouvelle NAND 176 couches de Micron - Clubic", "description": "L'Américain Micron vient de présenter sa nouvelle génération de puces mémoire 3D NAND à 176 couches. Cette dernière devrait permettre des latences largement réduites en lecture et en écriture, tout en ouvrant une porte vers des SSD nettement plus généreux en …", "url": "https://www.clubic.com/disque-dur-memoire/disques-durs-ssd/actualite-20603-bientot-des-ssd-de-plus-de-100-to-grace-a-la-nouvelle-nand-176-couches-de-micron.html", "urlToImage": "https://pic.clubic.com/v1/images/1830489/raw?width=900&height=600&fit=max&hash=561ebd5235ced6f7e9e5c3902c73b7100f174803", "publishedAt": "2020-11-10T14:55:00Z", "content": "Micron explique aussi avoir réussi à mettre au point un die 30% plus petit que ce que proposent ses concurrents, capable d'atteindre le seuil de 1 600 MT/s (1,6 gigatransferts par seconde) en débit s… [+661 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "L'État français renforce son action contre les pirates informatiques - Le Figaro", "description": "Selon Guillaume Poupard, gardien de la sécurité informatique française, le gouvernement accentue son action contre les cybercriminalités.", "url": "https://www.lefigaro.fr/secteur/high-tech/l-etat-francais-renforce-son-action-contre-les-pirates-informatiques-20201110", "urlToImage": "https://i.f1g.fr/media/cms/629x354_crop/2020/11/10/2dbaf8e6b9811f008c7fd0b42a70f97d52d0d481aba53294fbe6c062d907b2e0.jpeg", "publishedAt": "2020-11-10T14:34:00Z", "content": "Police, justice, renseignement, militaires... Les services de l'État agissent de plus en plus directement contre les pirates informatiques. Toutefois, les mesures de protection restent le meilleur ga… [+3525 chars]"}, {"source": {"id": null, "name": "jeuxvideo.com"}, "author": "la_redaction", "title": "La manette ESWAP X PRO CONTROLLER sous licence Xbox est disponible en précommande - jeuxvideo.com", "description": "Thrustmaster s'adresse aux joueurs PC et Xbox en quête d'une manette précise et modulable avec la ESWAP X PRO CONTROLLER. La sortie est prévue le 10 décembre prochain, et les précommandes sont déjà lancées. Les précommandes de la manette Thrustmaster ESWAP X …", "url": "https://www.jeuxvideo.com/news/1319608/la-manette-eswap-x-pro-sous-licence-xbox-est-disponible-en-precommande.htm", "urlToImage": "https://image.jeuxvideo.com/medias-md/160502/1605016580-9993-card.jpg", "publishedAt": "2020-11-10T14:10:21Z", "content": "Thrustmaster s'adresse aux joueurs PC et Xbox en quête d'une manette précise et modulable avec la ESWAP X PRO CONTROLLER. La sortie est prévue le 10 décembre prochain, et les précommandes sont déjà l… [+935 chars]"}, {"source": {"id": null, "name": "Les Numériques"}, "author": "Louis Royer", "title": "Leica Q2 Monochrom : un compact 24x36 qui ne fait que du noir et blanc - Les Numériques", "description": "Après un premier Q2 doté d'un capteur 24x36 de 47 mégapixels, Leica décline son boîtier en version monochrome. Cette pratique n'est pas une première pour le fabricant allemand, qui destine son appareil à des amateurs très éclairés.", "url": "https://www.lesnumeriques.com/compact-bridge/leica-q2-monochrom-un-compact-24x36-qui-ne-fait-que-du-noir-et-blanc-n156593.html", "urlToImage": "https://dyw7ncnq1en5l.cloudfront.net/optim/news/15/156593/bfcd9338-nda-leica-q2-monochrom-un-compact-24x36-qui-ne-fait-que-du-noir-et-blanc__908_512__807-613-7474-4372.jpeg", "publishedAt": "2020-11-10T14:00:00Z", "content": "Après un premier Q2 doté d'un capteur 24x36 de 47 mégapixels, Leica décline son boîtier en version monochrome. Cette pratique n'est pas une première pour le fabricant allemand, qui destine son appare… [+3617 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Nathan Le Gohlisse", "title": "Aya Neo, la nouvelle \"console\" portable chinoise propulsée sous Ryzen 4000 fait tourner les têtes - Clubic", "description": "Disponible en précommande en Chine, l'Aya Neo est une console portable qui emprunte beaucoup à la Switch pour son design et au GPD Win Max en matière de concept. Son principal atout ? Un processeur AMD Ryzen « Renoir » !", "url": "https://www.clubic.com/pro/entreprise/amd/actualite-20596-aya-neo-la-nouvelle-console-portable-chinoise-propulsee-sous-ryzen-4000-fait-tourner-les-tetes.html", "urlToImage": "https://pic.clubic.com/v1/images/1839255/raw?width=900&height=600&fit=max&hash=757680e2753aa8ba7394afdcb1fc01e797abea87", "publishedAt": "2020-11-10T13:15:00Z", "content": "Ce processeur est du reste épaulé par 16 Go de LPDDR4X à 4 266 MHz et l'on peut d'appuyer sur 512 Go ou 1 To de stockage au format M.3 2280 (via des SSD SN550 de Western Digital selon Tom's Hardware)… [+975 chars]"}, {"source": {"id": null, "name": "7x7.press"}, "author": "Mickael Maksim", "title": "Pourquoi la blockchain est-elle le socle de la future économie ? - 7x7", "description": "La blockchain est une technologie de stockage et de transmission de données novatrice, basée sur un système de registre immuable, transparent et sans contrôle, qui a émergé avec la naissance du Bitcoin en 2008. Bousculant les codes économiques et les réglemen…", "url": "https://www.7x7.press/pourquoi-la-blockchain-est-elle-le-socle-de-la-future-economie", "urlToImage": "https://res.cloudinary.com/odn92/image/upload/c_fill,f_auto,fl_progressive,h_630,w_1200/opu1wc7fc3hmxybgwf6j", "publishedAt": "2020-11-10T12:33:45Z", "content": "Internet joue un rôle capital dans lessor de léconomie moderne à travers son potentiel social et commercial. D'après l'institut Médiamétrie, 7 Français sur 10 se sont connectés à internet en 2019 et … [+2301 chars]"}, {"source": {"id": null, "name": "Boursorama"}, "author": null, "title": "Huawei envisage de céder ses smartphones Honor pour 12,9 milliards d'euros - Boursorama", "description": "par Julie Zhu\n\n\n  HONG KONG (Reuters) - Huawei Technologies envisage de céder sa division de smartphones Honor à un consortium emmené par le distributeur Digital China et les autorités de Shenzhen dans le cadre d'une opération évaluée à 100 milliards de yuans…", "url": "https://www.boursorama.com/actualite-economique/actualites/huawei-envisage-de-ceder-ses-smartphones-honor-pour-12-9-milliards-d-euros-41a3c54c39641dd40a6a9cbdc735c61d", "urlToImage": "https://s.brsimg.com/static-000/cache/i/content/images/7/b/3/7b3589a7f2ab226b96c7b99cb409f969-1200x800.jpg", "publishedAt": "2020-11-10T12:25:07Z", "content": "HUAWEI ENVISAGE DE CÉDER SES SMARTPHONES HONOR POUR 12,9 MILLIARDS D'EUROS\r\npar Julie Zhu\r\nHONG KONG (Reuters) - Huawei Technologies envisage de céder sa division de smartphones Honor à un consortium… [+2649 chars]"}, {"source": {"id": null, "name": "jeuxvideo.com"}, "author": "Clementoss", "title": "After the Fall : le FPS coop en réalité virtuelle est reporté à début 2021 - jeuxvideo.com", "description": "Ralenti par la crise sanitaire, le studio Vertigo Games (Arizona Sunshine) a besoin de temps supplémentaire pour peaufiner son prochain jeu en réalité virtuelle, After the Fall. Le titre est désormais prévu pour le début d'année 2021 sur Steam, Oculus Store e…", "url": "https://www.jeuxvideo.com/news/1319530/after-the-fall-le-fps-coop-en-realite-virtuelle-est-reporte-a-debut-2021.htm", "urlToImage": "https://image.jeuxvideo.com/medias-md/160501/1605005789-9554-card.png", "publishedAt": "2020-11-10T11:06:40Z", "content": "Ralenti par la crise sanitaire, le studio Vertigo Games (Arizona Sunshine) a besoin de temps supplémentaire pour peaufiner son prochain jeu en réalité virtuelle, After the Fall.\r\nLe titre est désorma… [+624 chars]"}, {"source": {"id": null, "name": "Caradisiac.com"}, "author": "Caradisiac.com", "title": "Nvidia, ce géant de l'informatique qui envahit l'automobile - Caradisiac.com", "description": "Pour l'instant, le géant américain Nvidia ne compte que 5 constructeurs automobiles dans son portfolio de clients. Mais cela progresse vite : Hyundai et Kia ont signé un accord avec le spécialiste de l'informatique et des solutions logicielles pour l'achat de…", "url": "https://www.caradisiac.com/nvidia-ce-geant-de-l-informatique-qui-envahit-l-automobile-186339.htm", "urlToImage": "https://images.caradisiac.com/logos/3/2/9/1/263291/S7-nvidia-ce-geant-de-l-informatique-qui-envahit-l-automobile-186339.jpg", "publishedAt": "2020-11-10T11:00:00Z", "content": "En cinq ans, Nvidia est parvenu à s'affranchir du monde de l'informatique pur pour séduire les constructeurs automobiles. Un monstre aux 10 milliards de dollars de chiffre d'affaires, fondé en 1993 p… [+1844 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Alexandre Piquard", "title": "Cloud : alliance inédite entre l'américain Google et le français OVH - Le Monde", "description": "Le géant californien et le champion hexagonal des données et services hébergés en ligne ont annoncé, mardi 10 novembre, « un partenariat stratégique », en plein débat sur la souveraineté numérique.", "url": "https://www.lemonde.fr/economie/article/2020/11/10/cloud-alliance-inedite-entre-l-americain-google-et-le-francais-ovh_6059221_3234.html", "urlToImage": "https://img.lemde.fr/2020/11/10/293/0/5675/2834/1440/720/60/0/72481ae_693339372-rtx6fk4c.JPG", "publishedAt": "2020-11-10T10:48:32Z", "content": "Le patron dOVH, Michel Paulin, à Paris, en octobre 2018. Charles Platiau / REUTERS\r\nCest lalliance de deux entreprises quon place souvent aux antipodes du « cloud », ce gigantesque et délicat marché … [+3550 chars]"}, {"source": {"id": null, "name": "Blogdumoderateur.com"}, "author": "Alexandra Patard", "title": "Google France lance un service en ligne pour aider les petits commerçants et artisans - BDM", "description": "Des conseils, des formations courtes et un accompagnement personnalisé sont proposés aux petites entreprises souhaitant développer leur présence en ligne.", "url": "https://www.blogdumoderateur.com/google-france-service-aide-commercants-artisans/", "urlToImage": "https://f.hellowork.com/blogdumoderateur/2020/11/google-ffac-ma-vitrine-en-ligne-1200x628.jpeg", "publishedAt": "2020-11-10T10:43:00Z", "content": "Noël approche, il est encore temps de développer votre activité en ligne. © shintartanya - stock.adobe.com\r\nDans le contexte de crise sanitaire et économique actuel, et à lapproche des fêtes de fin d… [+3373 chars]"}, {"source": {"id": null, "name": "Univers Freebox"}, "author": null, "title": "Les Français sont majoritairement pour la 5G, mais des inquiétudes subsistent - Univers Freebox", "description": "Selon un sondage, 75 % des Français montrent un intérêt certain pour la 5G et se disent prêts à payer pour en profiter. Il demeure toutefois des inquiétudes autour de cette nouvelle technologie. Un grand “oui” à la 5G, et un “mais” à la fois. Voilà ce que rév…", "url": "https://www.universfreebox.com/article/59183/les-francais-emballes-par-la-5g-mais-des-inquietudes-subsistent", "urlToImage": "https://www.universfreebox.com/wp-content/uploads/2020/11/5G155.jpg", "publishedAt": "2020-11-10T10:34:00Z", "content": "Selon un sondage, 75 % des Français montrent un intérêt certain pour la 5G et se disent prêts à payer pour en profiter. Il demeure toutefois des inquiétudes autour de cette nouvelle technologie.\r\nUn … [+2430 chars]"}, {"source": {"id": null, "name": "Amisdelaterre.org"}, "author": null, "title": "Stoppons l'expansion d'Amazon - Amis de la Terre France", "description": "A l’heure où le re-confinement contraint les commerces non-alimentaires à fermer leurs portes, les grandes plateformes de e-commerce comme Amazon menacent plus que jamais les commerces de proximité. A l'occasion du Black Friday, nous lançons une grande mobili…", "url": "https://www.amisdelaterre.org/stoppons-expansion-amazon-black-friday/", "urlToImage": "https://www.amisdelaterre.org/wp-content/uploads/2019/12/78321425-1913656438781238-7002869336322867200-o-1200x942.jpg", "publishedAt": "2020-11-10T10:19:33Z", "content": "Amazon s’implante massivement en France à la faveur de la crise sanitaire\r\nAmazon prévoit douvrir 20 nouveaux projets dentrepôts Amazon en France dici à lannée prochaine. Sils voyaient le jour, on co… [+3122 chars]"}, {"source": {"id": null, "name": "MacGeneration"}, "author": null, "title": "Google et Facebook bloqueraient leurs apps iOS sur les Mac Apple Silicon - MacGeneration", "description": "L’une des nouveautés des Mac Apple Silicon qui devraient être présentés officiellement dans quelques heures sera la possibilité de faire tourner les apps iOS. Puisque ces Mac reposent sur les mêmes puces que les iPhone et iPad, on trouvera dans le Mac App Sto…", "url": "https://www.macg.co/logiciels/2020/11/google-et-facebook-bloqueraient-leurs-apps-ios-sur-les-mac-apple-silicon-117633", "urlToImage": "https://cdn.mgig.fr/2020/11/mga-ac60965e-w375-w1500-w750_accroche.jpg", "publishedAt": "2020-11-10T09:56:15Z", "content": "Lune des nouveautés des Mac Apple Silicon qui devraient être présentés officiellement dans quelques heures sera la possibilité de faire tourner les apps iOS. Puisque ces Mac reposent sur les mêmes pu… [+2349 chars]"}, {"source": {"id": null, "name": "Univers Freebox"}, "author": null, "title": "Free, Orange, SFR, Bouygues : dans quelle grande ville votre opérateur est-il le plus performant ? - Univers Freebox", "description": "nPerf lève le voile aujourd’hui sur son baromètre des performances mobiles consacré aux 15 plus grandes agglomérations de France. Dans quelle grande ville mon opérateur propose les meilleurs débits ? Pour répondre à cette question, nPerf a regroupé plus de 33…", "url": "https://www.universfreebox.com/article/59182/free-orange-sfr-bouygues-dans-quelle-grande-ville-votre-operateur-est-il-le-plus-performant", "urlToImage": "https://www.universfreebox.com/wp-content/uploads/2020/11/OPERATERUS14.jpeg", "publishedAt": "2020-11-10T09:52:00Z", "content": "nPerf lève le voile aujourdhui sur son baromètre des performances mobiles consacré aux 15 plus grandes agglomérations de France. \r\nDans quelle grande ville mon opérateur propose les meilleurs débits … [+4096 chars]"}, {"source": {"id": null, "name": "Xboxygen"}, "author": "SauroneMX338", "title": "Fonds d'écran Xbox, animation, couleur, thème… comment personnaliser sa Xbox Series X|S - Xboxygen", "description": "La sortie des Xbox Series X et Xbox Series S marque aussi l’arrivée d’une nouvelle interface utilisateur. Si vous êtes comme nous, vous devez sans doute apprécier (...)", "url": "http://www.xboxygen.com/News/35035-Fonds-d-ecran-Xbox-animation-couleur-theme-comment-personnaliser-sa-Xbox-Series-X-S", "urlToImage": "http://www.xboxygen.com/IMG/motoff2479.jpg", "publishedAt": "2020-11-10T09:51:10Z", "content": "La sortie des Xbox Series X et Xbox Series S marque aussi larrivée dune nouvelle interface utilisateur. Si vous êtes comme nous, vous devez sans doute apprécier customiser au maximum votre expérience… [+5236 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Romain Ribout", "title": "Voici un forfait mobile avec 20 Go de 4G pour moins de 2 euros par mois - Frandroid", "description": "C'est étonnant, mais cela arrive de temps en temps qu'un forfait mobile se démarque des autres. C'est aujourd'hui le cas de la nouvelle offre sans engagement chez Auchan télécom qui propose 20 Go de données 4G pour seulement 1,99 euro par mois.", "url": "https://www.frandroid.com/bons-plans/bons-plans-telecom/797370_voici-un-forfait-mobile-avec-20-go-de-4g-pour-moins-de-2-euros-par-mois", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/05/forfait-header-2.jpg", "publishedAt": "2020-11-10T09:44:00Z", "content": "C'est étonnant, mais cela arrive de temps en temps qu'un forfait mobile se démarque des autres. C'est aujourd'hui le cas de la nouvelle offre sans engagement chez Auchan télécom qui propose 20 Go de … [+2745 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Guillaume Belfiore", "title": "La France pousse l'UE à affaiblir le chiffrement des messageries - Clubic", "description": "Le chiffrement des données sera-t-il bientôt sous contrôle en Europe ? Après les récents attentats survenus dans divers pays dont la France, le conseil des ministres de l'Union européenne serait sur le point d'adopter cette mesure.", "url": "https://www.clubic.com/messagerie-instantanee/actualite-20557-la-france-pousse-l-ue-a-affaiblir-le-chiffrement-des-messageries.html", "urlToImage": "https://pic.clubic.com/v1/images/1705186/raw?width=900&height=600&fit=max&hash=759169494d3dd595b4df4ec722b2ffe6c6071194", "publishedAt": "2020-11-10T09:36:00Z", "content": "Le chiffrement des communications poserait un problème dans la collecte de preuves pour démanteler des réseaux terroristes. Les fruits de ces réflexions n'ont pas été publiés sur le site de la Commis… [+1335 chars]"}, {"source": {"id": null, "name": "Hitek.fr"}, "author": null, "title": "Voici la toute nouvelle montre connectée Xiaomi Mibro Air avec une réduction pour sa sortie - Hitek.fr", "description": "La montre connectée Xiaomi Mibro Air est le dernier modèle de chez Xiaomi Mibro et elle est déjà à un très bon prix.", "url": "https://hitek.fr/actualite/nouvelle-montre-connectee-xiaomi-mibro-air-code-promo_25402", "urlToImage": "https://static.hitek.fr/img/actualite/ill_m/520498139/mibro7.jpg", "publishedAt": "2020-11-10T08:40:06Z", "content": "Mibro est une société chinoise qui appartient à Xiaomi et cette dernière propose des accessoires qui s'orientent vers la santé. Aujourd'hui, elle vient d'annoncer et de dévoiler sa nouvelle montre co… [+2337 chars]"}, {"source": {"id": null, "name": "Europe 1"}, "author": null, "title": "Amazon ne renoncera pas au Black Friday, \"très attendu par les Français\" - Europe 1", "description": "Le géant américain de la vente en ligne Amazon attise la colère des commerçants français, ulcérés de voir son activité augmenter alors qu'eux doivent fermer boutique. Son directeur général France a expliqué mardi au micro d'Europe 1 que s'il n'entendait renon…", "url": "https://www.europe1.fr/economie/black-friday-amazon-ne-renoncera-pas-au-black-friday-tres-attendu-par-les-francais-4004572", "urlToImage": "https://cdn-europe1.lanmedia.fr/var/europe1/storage/images/europe1/economie/black-friday-amazon-ne-renoncera-pas-au-black-friday-tres-attendu-par-les-francais-4004572/56277331-1-fre-FR/Black-Friday-Amazon-ne-renoncera-pas-au-Black-Friday-tres-attendu-par-les-Francais.jpg", "publishedAt": "2020-11-10T08:30:00Z", "content": "INTERVIEWFrédéric Duval est prêt \"à discuter de tout\" avec les commerçants. \"Je leur tends la main\", assure le directeur général d'Amazon France, invité mardi d'Europe 1. Le géant américain de la ven… [+1938 chars]"}, {"source": {"id": null, "name": "Cowcotland.com"}, "author": "Sébastien Vandeborre", "title": "Ca s'en va et ça revient (plus tard), plus de RTX 3070 ou RTX 3080 en stock ! - Cowcotland", "description": "Hier, nous indiquions que des RTX 3070 et RTX 3080 étaient en stock dans les boutiques en ligne du groupe LDLC. Plusieurs réfé..., actualité 74059", "url": "https://www.cowcotland.com/news/74059/ca-s-en-va-et-ca-revient-plus-tard-plus-de-rtx-3070-ou-rtx-3080-en-stock.html", "urlToImage": "/images/news/2020/11/nvidia-rtx3070-f.jpg", "publishedAt": "2020-11-10T07:25:34Z", "content": "Hier, nous indiquions que des RTX 3070 et RTX 3080 étaient en stock dans les boutiques en ligne du groupe LDLC. Plusieurs références très différentes qui laissent penser que les marques commencent to… [+885 chars]"}, {"source": {"id": null, "name": "Presse-citron"}, "author": "Hadrien Augusto", "title": "Le stylo Bic se prépare à un important virage écologique et digital - Presse-citron", "description": "La société Bic se prépare à une petite révolution. Après le stylo jetable, place au cahier réutilisable.", "url": "https://www.presse-citron.net/le-stylo-bic-se-prepare-a-un-important-virage-ecologique-et-digital/", "urlToImage": "https://www.presse-citron.net/wordpress_prod/wp-content/uploads/2020/11/stylo-bic-digital-transformation.jpg", "publishedAt": "2020-11-10T07:02:09Z", "content": "La société française Bic, fondée en 1945, se prépare à un rachat de taille. Rocketbook, une startup basée à Boston, sera bientôt sous légide de la marque française et lopération pourrait survenir dic… [+3422 chars]"}, {"source": {"id": null, "name": "La Tribune.fr"}, "author": null, "title": "Énergie solaire : pourquoi la colère gronde dans la filière - La Tribune", "description": "Le gouvernement a publié un amendement afin de réviser des contrats passés il y a plus de dix ans entre l'Etat et les producteurs d'énergie photovoltaïque. En quête d'économies, il estime que certains de ces producteurs bénéficient aujourd'hui d'une rentabili…", "url": "https://www.latribune.fr/entreprises-finance/industrie/energie-environnement/energie-solaire-pourquoi-la-colere-gronde-dans-la-filiere-861938.html", "urlToImage": "https://static.latribune.fr/full_width/1194569/photovoltaique.jpg", "publishedAt": "2020-11-10T07:00:00Z", "content": "D'abord, ils ont presque cru à une blague tellement l'information était difficile à avaler. Le 16 septembre dernier, les professionnels du photovoltaïque découvrent dans la presse le projet du gouver… [+1769 chars]"}, {"source": {"id": null, "name": "Domo-blog.fr"}, "author": "https://www.facebook.com/pages/domo-blogfr/488336597943283/", "title": "Raspberry Pi 400 : La fondation Raspberry continue d’innover avec une version très originale - domo-blog", "description": "On ne les arrête plus, en un an la fondation Raspberry Pi aura sorti pas moins de 4 versions du Raspberry pi 4. Le plus puissant, polyvalent et connu des nano ordinateurs, après des versions 2 et 4Go puis plus récemment une version 8Go, c’est maintenant une v…", "url": "https://www.domo-blog.fr/raspberry-pi-400-la-fondation-raspberry-continue-dinnover-avec-une-version-tres-originale/", "urlToImage": "https://www.domo-blog.fr/wp-content/uploads/2020/11/raspberrypi-400-rpi-clavier-all-in-one.jpg", "publishedAt": "2020-11-10T06:04:07Z", "content": "On ne les arrête plus, en un an la fondation Raspberry Pi aura sorti pas moins de 4 versions du Raspberry pi 4. Le plus puissant, polyvalent et connu des nano ordinateurs, après des versions 2 et 4Go… [+1958 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Armelle Bohineust", "title": "L'énergie renouvelable, première source d'électricité en 2025 - Le Figaro", "description": "Malgré l'épidémie, les installations d'énergie verte verte feront un bond cette année et en 2021. Elles deviendront la première source d'électricité en 2025, devant le charbon, prévoit l'Agence internationale de l'énergie.", "url": "https://www.lefigaro.fr/conjoncture/hausse-record-de-l-energie-renouvelable-20201110", "urlToImage": "https://i.f1g.fr/media/cms/629x354_crop/2020/11/09/73d690c6e1e29c92da5ce1ca99dd4b9a8e91ab1fd3614bcc8a34ea777260f36b.jpeg", "publishedAt": "2020-11-10T06:00:00Z", "content": "L'électricité verte se porte bien. Contrairement aux autres sources d'énergie, en particulier le pétrole, le gaz et le charbon, en baisse à cause de l'épidémie de Covid-19, les énergies renouvelables… [+1928 chars]"}, {"source": {"id": null, "name": "Cowcotland.com"}, "author": "Sébastien Vandeborre", "title": "SAPPHIRE officialise ses RX 6800 et RX 6800 XT en NITRO+ et PULSE - Cowcotland", "description": "Après plusieurs teasers, les voici enfin ! Les prochaines cartes NITRO+ et PULSE de SAPPHIRE, logiquement à vase de RX 6800 et..., actualité 74056", "url": "https://www.cowcotland.com/news/74056/sapphire-officialise-ses-rx-6800-et-rx-6800-xt-en-nitro+-et-pulse.html", "urlToImage": "/images/news/2020/11/sapphire-f-4.jpg", "publishedAt": "2020-11-10T06:00:00Z", "content": "Après plusieurs teasers, les voici enfin ! Les prochaines cartes NITRO+ et PULSE de SAPPHIRE, logiquement à vase de RX 6800 et RX 6800 XT. Des cartes qui devraient plaire aux amateurs de la marque, a… [+1341 chars]"}, {"source": {"id": null, "name": "01net.com"}, "author": "01net", "title": "OnePlus 8T : le test complet - 01net.com", "description": "Avec son 8T, OnePlus revient à ses origines. Après avoir augmenté ses tarifs au risque de perdre ses fans de la première heure, le constructeur chinois tente de nouveau de casser les prix du haut de gamme. Difficile de ne pas être séduit au début… même si l’o…", "url": "https://www.01net.com/tests/test-du-oneplus-8t-le-champion-du-rapport-qualite-prix-s-endort-il-sur-ses-lauriers-6551.html", "urlToImage": "https://img.bfmtv.com/images/fb6/1292be0bd0b1e91cde2ba905143ab.jpg", "publishedAt": "2020-11-10T05:59:00Z", "content": null}, {"source": {"id": null, "name": "Maison et Domotique"}, "author": "pages/Maison-et-Domotique/186181664736460", "title": "Avantages d'un robot tondeuse par rapport à une tondeuse traditionnelle - Maison et Domotique", "description": "Un robot tondeuse permet d'entretenir automatiquement votre pelouse: plus besoin de tondre, le robot se charge de tout, au meilleur moment, sans aucune intervention...", "url": "https://www.maison-et-domotique.com/122513-avantages-robot-tondeuse/", "urlToImage": "https://www.maison-et-domotique.com/wp-content/uploads/2020/10/husqvarna-automower-4.jpg", "publishedAt": "2020-11-10T05:37:00Z", "content": "Pour avoir un bel extérieur, avec un beau gazon, il est nécessaire de posséder une bonne tondeuse à gazon. Mais quelque soit la tondeuse à gazon, cela reste une tâche à effectuer régulièrement, qui p… [+7490 chars]"}, {"source": {"id": null, "name": "La Provence"}, "author": "La Provence (avec AFP)", "title": "McDonald's lance une ligne de produits végétariens sous le nom de \"McPlant\" - La Provence", "description": "Pour mieux répondre à la demande des consommateurs, le géant des fast-foods McDonald's prévoit de lancer sa propre ligne de produits végétariens sous le nom de McPlant, tout en misant sur le poulet et les ventes à emporter.Le groupe a déjà testé un burger dot…", "url": "https://www.laprovence.com/actu/en-direct/6174921/mcdonalds-lance-une-ligne-de-produits-vegetariens-sous-le-nom-de-mcplant.html", "urlToImage": "https://images.laprovence.com/v1/focus=240x138/cover=993x520/image:media/2019/08/22/1566476700_le-maire-du-iie-arrondissement-jacques-boutault-eelv-soutenu-par-l-hotel-de-ville-s-oppose-a-l-implantation-d-un-restaurant-mcdonald-s-a-montorgueil_5369261.jpg", "publishedAt": "2020-11-09T21:14:48Z", "content": "Pour mieux répondre à la demande des consommateurs, le géant des fast-foods McDonald's prévoit de lancer sa propre ligne de produits végétariens sous le nom de McPlant, tout en misant sur le poulet e… [+2190 chars]"}, {"source": {"id": null, "name": "iGeneration"}, "author": null, "title": "Orange : des appels 4G désactivés subitement - iGeneration", "description": "De multiples témoignages d'abonnés Orange et Sosh signalent une notification sur leur iPhone annonçant que les appels 4G ont été désactivés. Pour certains la notification est arrivée ce matin, pour d'autres c'était le cas déjà hier et ça ne semble pas toucher…", "url": "https://www.igen.fr/telecoms/2020/11/orange-des-appels-4g-desactives-subitement-118821", "urlToImage": "https://cdn.mgig.fr/2020/11/mga-0a86e774-w375-w1500-w750_accroche.jpg", "publishedAt": "2020-11-09T20:15:00Z", "content": "De multiples témoignages d'abonnés Orange et Sosh signalent une notification sur leur iPhone annonçant que les appels 4G ont été désactivés.\r\nPour certains la notification est arrivée ce matin, pour … [+540 chars]"}, {"source": {"id": null, "name": "Marianne.net"}, "author": "Violaine Des Courières", "title": "Projet \"Pluton\" : Sanofi va se désengager d'une partie de sa production de médicaments - Marianne", "description": "Sanofi projette d’externaliser six usines européennes, dont deux françaises, dans une entité autonome. Ce projet - surnommé \"Pluton\" - pose des questions sociales, alors même que le Groupe présente un chiffre d’affaires en hausse de 5,7 % et des perspectives …", "url": "https://www.marianne.net/economie/entreprises/projet-pluton-sanofi-va-se-desengager-dune-partie-de-sa-production-de-medicaments", "urlToImage": "https://resize.marianne.net/r/1540,924/img/var/LQ4017789C/498222/043_dpa-pa_200922-99-666488_dpai.jpg", "publishedAt": "2020-11-09T19:41:00Z", "content": "\"Pluton\". Cest le nom du projet dexternalisation de six usines européennes de Sanofi dans une entité autonome, placée en bourse à lhorizon 2022. En France, deux sites, soit 1.200 salariés, sont conce… [+4748 chars]"}, {"source": {"id": null, "name": "Journalducoin.com"}, "author": "Morgan Phuc", "title": "Cette crypto-banque prêtait du Bitcoin… elle fait faillite, et tout n’est pas très clair - Journal du Coin", "description": "Une société crypto de plus laisse ses clients en attente de leurs fonds. La plateforme de prêts en cryptomonnaies Cred se déclare en faillite.", "url": "https://journalducoin.com/actualites/crypto-banque-cred-faillite-pas-tres-clair/", "urlToImage": "https://journalducoin.com/wp-content/uploads/2020/11/homme-decu-ruine.jpg", "publishedAt": "2020-11-09T19:00:37Z", "content": "Un coup dur pour Cred – Cred est une société crypto proposant à ses clients de prêter et d’emprunter des cryptomonnaies. Après avoir suspendu les retraits et dépôts le 28 octobre, elle annonce être e… [+2710 chars]"}, {"source": {"id": null, "name": "Journalducoin.com"}, "author": "Rémy R.", "title": "Ils font main basse sur 9 milliards de $ en cryptomonnaies… et ce n’est que le début ! - Journal du Coin", "description": "Ce géant de l'investissement se jette sur les cryptomonnaies... et plus le temps passe, plus il en détient. Jusqu'où ira-t-il ?", "url": "https://journalducoin.com/actualites/main-basse-9-milliards-dollars-cryptomonnaies-debut/", "urlToImage": "https://journalducoin.com/wp-content/uploads/2020/10/tsunami-argent-dollar-1920x1080.jpg", "publishedAt": "2020-11-09T18:06:16Z", "content": "Une exponentielle dinstitutionnels ? – La fièvre du bitcoin (BTC) et des cryptos semblent de plus en plus contagieuse au sein des investisseurs du fonds Grayscale Investments. En effet, les records d… [+2498 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Humanoid Content", "title": "Samsung : de la 4K à la 8K, les meilleurs TV QLED sont en promotion - Frandroid", "description": "Jusqu'au 15 novembre, Samsung propose des remises sur ses meilleurs téléviseurs QLED. Vous pouvez ainsi profiter de barres de son offertes, ainsi que des remboursements pouvant atteindre les 15 % du prix final.", "url": "https://www.frandroid.com/marques/samsung/794456_samsung-de-la-4k-a-la-8k-les-meilleurs-tv-qled-sont-en-promotion", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/11/samsung-qled-q800t-8k.jpeg", "publishedAt": "2020-11-09T17:40:00Z", "content": "Jusqu'au 15 novembre, Samsung propose des remises sur ses meilleurs téléviseurs QLED. Vous pouvez ainsi profiter de barres de son offertes, ainsi que des remboursements pouvant atteindre les 15 % du … [+5362 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Romain Ribout", "title": "Xiaomi Mi TV Stick : le tueur de Chromecast est en promotion sur Cdiscount - Frandroid", "description": "Le Xiaomi Mi TV Stick est un dongle HDMI qui vient concurrencer le Chromecast de Google ou encore le Fire TV Stick d'Amazon. Il se négocie en ce moment à 29 euros sur Cdiscount, contre 39 euros habituellement.", "url": "https://www.frandroid.com/bons-plans/797259_xiaomi-mi-tv-stick-le-tueur-de-chromecast-est-en-promotion-sur-cdiscount", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/11/xiaomi-mi-tv-stick-fond-noir.jpg", "publishedAt": "2020-11-09T17:25:00Z", "content": "Le Xiaomi Mi TV Stick est un dongle HDMI qui vient concurrencer le Chromecast de Google ou encore le Fire TV Stick d'Amazon. Il se négocie en ce moment à 29 euros sur Cdiscount, contre 39 euros habit… [+2530 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Ulrich Rozier", "title": "Les tests de l’iPhone 12 mini sont là : l’autonomie est-elle mini ? - Frandroid", "description": "Parmi les quatre nouveaux iPhone, il y a l'iPhone 12 mini. Même si sa taille aurait été dans les standards il y a quelques années, il est considéré désormais comme un petit smartphone. Nous avons épluché les principaux tests américains en attendant de pouvoir…", "url": "https://www.frandroid.com/marques/apple/797244_les-tests-de-liphone-12-mini-sont-la-lautonomie-est-elle-mini", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/11/iphone-12-mini-12-pro-max-scaled.jpg", "publishedAt": "2020-11-09T17:24:00Z", "content": "Parmi les quatre nouveaux iPhone, il y a l'iPhone 12 mini. Même si sa taille aurait été dans les standards il y a quelques années, il est considéré désormais comme un petit smartphone. Nous avons épl… [+4944 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Marc Mitrani", "title": "Test Huawei Freebuds Pro : au niveau des meilleurs ? - Clubic", "description": "Lorsqu’on pense à Huawei, le matériel audio ne vient pas immédiatement à l’esprit. Et pourtant, le constructeur commercialise depuis quelques années des gammes d’écouteurs avec plus ou moins de bonheur.", "url": "https://www.clubic.com/pro/entreprises/huawei/test-20159-test-des-freebuds-pro-de-huawei-au-niveau-des-meilleurs-.html", "urlToImage": "https://pic.clubic.com/v1/images/1838408/raw?width=900&height=600&fit=max&hash=9a37ad880291added650b9a78cdc9c4765c518a5", "publishedAt": "2020-11-09T17:10:00Z", "content": "Lorsquon pense à Huawei, le matériel audio ne vient pas immédiatement à lesprit. Et pourtant, le constructeur commercialise depuis quelques années des gammes découteurs avec plus ou moins de bonheur.… [+9584 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Clubic Bons Plans", "title": "Le TOP des offres Single Day : le OnePlus 8T à seulement 425€ chez AliExpress - Clubic", "description": "Le OnePlus 8T est tout récent, mais fait déjà l'objet d'un bon plan intéressant quelques heures seulement avant le Single Day 2020. C'est le parfait moment pour remplir votre panier avant le Jour J tant attendu.", "url": "https://www.clubic.com/bons-plans/aliexpress/bons-plans-20431-le-top-des-offres-single-day-le-oneplus-8t-a-seulement-425-chez-aliexpress.html", "urlToImage": "https://pic.clubic.com/v1/images/1832906/raw?width=900&height=600&fit=max&hash=220ede0698b389e52419413f0ba22e7115bcea5e", "publishedAt": "2020-11-09T16:40:00Z", "content": "OnePlus nous a proposé un nouveau smartphone au rapport qualité-prix impressionnant cet automne avec le OnePlus 8T. Le smartphone est équipé d'un écran AMOLED de 6,55 pouces avec définition FHD+ 2400… [+673 chars]"}, {"source": {"id": null, "name": "Les Numériques"}, "author": "Bastien Lion", "title": "Bon plan – RX10 Mark IV, compact ZV-1, hybride A7 III et de nombreux objectifs en promo chez Sony - Les Numériques", "description": "Plusieurs sites d'e-commerce proposent de belles remises sur le catalogue photo de Sony. Au programme, des réductions pouvant monter à 200 € sur une sélection de bridges, compacts experts, hybrides plein format et optiques.", "url": "https://www.lesnumeriques.com/compact-bridge/bon-plan-rx10-mark-iv-compact-zv-1-hybride-a7-iii-et-de-nombreux-objectifs-en-promo-chez-sony-n156755.html", "urlToImage": "https://dyw7ncnq1en5l.cloudfront.net/optim/news/15/156755/ba813f35-bon-plan-rx10-mark-iv-compact-zv-1-hybride-a7-iii-et-de-nombreux-objectifs-en-promo-chez-sony__908_512__998-28-2286-754.jpeg", "publishedAt": "2020-11-09T16:19:00Z", "content": "Plusieurs sites d'e-commerce proposent de belles remises sur le catalogue photo de Sony. Au programme, des réductions pouvant monter à 200  sur une sélection de bridges, compacts experts, hybrides pl… [+1192 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Thibaut Popelier", "title": "Cdiscount propose la tablette tactile Samsung Galaxy Tab A à prix choc - Clubic", "description": "C'est une petite tablette tactile très sympathique qui vient tout juste d'arriver dans notre rubrique aux bons plans. En effet, la Samsung Galaxy Tab A 8'' est à 159,12€.", "url": "https://www.clubic.com/bons-plans/cdiscount-promos/bons-plans-20452-la-tablette-tactile-samsung-galaxy-tab-a-est-de-retour-a-un-excellent-prix.html", "urlToImage": "https://pic.clubic.com/v1/images/1835284/raw?width=900&height=600&fit=max&hash=9079670be253584f3be05e468dc587fa0496aa84", "publishedAt": "2020-11-09T16:15:51Z", "content": "Cdiscount est une fois de plus à la manuvre de ce bon plan. Le site bordelais spécialisé dans la vente en ligne continue de livrer gratuitement à domicile durant le confinement. Vous pouvez même opte… [+839 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Rémi Bouvet", "title": "Windows 10 : prudence avec le nouveau système de pilotes en cours de déploiement - Clubic", "description": "Depuis le 5 novembre, le nouveau système de mise à jour des pilotes de Windows 10 donne plus de contrôle aux utilisateurs.", "url": "https://www.clubic.com/pro/entreprises/microsoft/actualite-20506-windows-10-prudence-avec-le-nouveau-systeme-de-pilotes-en-cours-de-deploiement.html", "urlToImage": "https://pic.clubic.com/v1/images/1839158/raw?width=900&height=600&fit=max&hash=cab08774288547a8aacb4526ddd65a06e24cdeec", "publishedAt": "2020-11-09T16:10:00Z", "content": "Depuis le 5 novembre, le nouveau système de mise à jour des pilotes de Windows 10 donne plus de contrôle aux utilisateurs. \r\nNéanmoins, sous Windows 10 version 2004 et 20H2, cela peut paradoxalement … [+2731 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Romain Ribout", "title": "Le Xiaomi Redmi Note 9S (6+128 Go) est 110 € moins cher via une vente flash - Frandroid", "description": "Pour le Single Day, le Xiaomi Redmi Note 9S profite de l'occasion pour faire chuter son prix de 279 à seulement 170 euros via à une vente flash sur Gearbest. Il s'agit de la version avec 128 Go de stockage et 6 Go de RAM.", "url": "https://www.frandroid.com/bons-plans/bons-plans-smartphone/797212_le-xiaomi-redmi-note-9s-6128-go-est-110-e-moins-cher-via-une-vente-flash", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/11/xiaomi-remdi-note-9s-gris.jpg", "publishedAt": "2020-11-09T16:02:00Z", "content": "Pour le Single Day, le Xiaomi Redmi Note 9S profite de l'occasion pour faire chuter son prix de 279 à seulement 170 euros via à une vente flash sur Gearbest. Il s'agit de la version avec 128 Go de st… [+2911 chars]"}, {"source": {"id": null, "name": "Freenews.fr"}, "author": "https://m.facebook.com/isabelle.deromaslebocq", "title": "Free Mobile : l'Esim, on en est où ? - Freenews", "description": "Force est de constater que les annonces faites chez Free sont parfois suivies de surprises parfois douloureuses ou de petites déceptions de la part des abonnés. Alors certes, les sujets de brouille peuvent tenir du détail mais tout de même ; chacun s’attendra…", "url": "https://www.freenews.fr/freenews-edition-nationale-299/free-mobile-lesim-on-en-est-ou", "urlToImage": "https://www.freenews.fr/wp-content/uploads/2015/01/Carte-SIM-Free-Mobile-e1438185470542.jpg", "publishedAt": "2020-11-09T15:06:00Z", "content": "Force est de constater que les annonces faites chez Free sont parfois suivies de surprises parfois douloureuses ou de petites déceptions de la part des abonnés. \r\nAlors certes, les sujets de brouille… [+1046 chars]"}, {"source": {"id": null, "name": "01net.com"}, "author": "01net", "title": "GPD dévoile le Win 3, son PC gaming portable futuriste avec écran coulissant - 01net.com", "description": "S’inspirant largement du Vaio UX, le futur Win 3, de GPD, est un PC portable ultra compact intégrant des contrôleurs de jeu façon Nintendo Switch. Un ovni PC/console comme seul GPD sait les développer.", "url": "https://www.01net.com/actualites/gpd-devoile-le-win-3-son-pc-gaming-portable-futuriste-avec-ecran-coulissant-2004046.html", "urlToImage": "https://www.01net.com/i/0/0/bb1/9caabeb67a2ce573068f2f70828c7.jpg", "publishedAt": "2020-11-09T15:04:00Z", "content": null}, {"source": {"id": null, "name": "Le Point"}, "author": "Michel Revol", "title": "Confinement : « Le télétravail nuit à la productivité » - Le Point", "description": "« Le Point » donne la parole à des actifs qui racontent les bouleversements provoqués par le télétravail. Le témoignage d'un chef d'entreprise.", "url": "https://www.lepoint.fr/economie/confinement-le-teletravail-nuit-a-la-productivite-09-11-2020-2400161_28.php", "urlToImage": "https://www.lepoint.fr/images/2020/11/09/20948498lpw-20948947-article-jpg_7473534_540x282.jpg", "publishedAt": "2020-11-09T14:00:00Z", "content": "Pour de nombreux Français, le confinement a été le synonyme d'une nouvelle vie de bureau à la maison. Depuis le reconfinement qui a commencé le 30 octobre, le télétravail devient à nouveau la norme p… [+4166 chars]"}, {"source": {"id": null, "name": "Journal du geek"}, "author": "Jerome Durel", "title": "[11.11] Du Xiaomi Redmi 9A au Note 9 Pro, toute la gamme Redmi 9 est en promo dès 75€ - Journal du geek", "description": "Gearbest propose aujourd'hui des réduction sur toute la gamme Redmi 9 de Xiaomi à partir de 75€, dont le Note 9 Pro à moins de 200 euros.", "url": "https://www.journaldugeek.com/bon-plan/xiaomi-promo-serie-redmi-9/", "urlToImage": "https://www.journaldugeek.com/content/uploads/2020/05/capture-decran-2020-05-26-a-14-54-22-735x480.png", "publishedAt": "2020-11-09T13:45:00Z", "content": "Accueil » Bons plans » [11.11] Du Xiaomi Redmi 9A au Note 9 Pro, toute la gamme Redmi 9 est en promo dès 75Gearbest propose actuellement des réduction sur toute la gamme Redmi 9 de Xiaomi, dont le No… [+3165 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Maxime Laglasse", "title": "Thales va utiliser la blockchain pour ses centres de production et de maintenance - Clubic", "description": "Dans une logique d’optimisation de la production et de maintenance, Thales annonce utiliser la blockchain pour ses centres en Espagne. Cela lui permet notamment de se conformer aux standards de suivi de production demandés par l’OTAN.", "url": "https://www.clubic.com/antivirus-securite-informatique/cryptage-cryptographie/crypto-monnaie/actualite-20440-thales-va-utiliser-la-blockchain-pour-ses-centres-de-production-et-de-maintenance.html", "urlToImage": "https://pic.clubic.com/v1/images/1745221/raw?width=900&height=600&fit=max&hash=0c048f6f824ba969a8126eadceec8eaa39a81535", "publishedAt": "2020-11-09T13:25:00Z", "content": "Depuis 2016, Thales et la société de conseil Accenture ont annoncé lors dune conférence au Royaume-Uni sintéresser à la blockchain. Pour y parvenir, cest la startup Chronicled qui avait été choisie a… [+567 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Romain Ribout", "title": "Cdiscount propose la batterie externe sans fil de Samsung à moins de 10 € - Frandroid", "description": "La batterie externe de Samsung avec 10 000 mAh de capacité et, qui plus est, compatible avec la charge sans fil fait son come-back à seulement 9,99 euros, cette fois-ci chez l'enseigne Cdiscount.", "url": "https://www.frandroid.com/bons-plans/797142_cdiscount-propose-la-batterie-externe-sans-fil-de-samsung-a-moins-de-10-e", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/03/batterie-sans-fil-externe-samsung-10-000-mah-grise.jpg", "publishedAt": "2020-11-09T13:20:00Z", "content": "La batterie externe de Samsung avec 10 000 mAh de capacité et, qui plus est, compatible avec la charge sans fil fait son come-back à seulement 9,99 euros, cette fois-ci chez l'enseigne Cdiscount. \r\nL… [+2146 chars]"}, {"source": {"id": null, "name": "MonPetitForfait"}, "author": null, "title": "Bouygues : l’iPhone 12 dès 1€ + 8€/mois avec un forfait 90 Go - MonPetitForfait", "description": "Grâce à la reprise de l'iPhone XR et la souscription d'un forfait avec engagement de 24 mois, l'iPhone 12 tombe à 1€ à l'achat chez Bouygues.", "url": "https://www.monpetitforfait.com/telephonie-mobile/bouygues-telecom-2/191475-iphone-12-bouygues-telecom", "urlToImage": "https://www.monpetitforfait.com/wp-content/uploads/2020/11/iPhone-12-chez-Bouygues-Telecom.jpg", "publishedAt": "2020-11-09T12:45:00Z", "content": "Bouygues Telecom fait partie des opérateurs historiques qui proposent des forfaits subventionnés, permettant d'obtenir des réductions dantesques sur certains smartphones dernier cri.L'opérateur ne fa… [+4819 chars]"}, {"source": {"id": null, "name": "Futura"}, "author": "Marc Zaffagni", "title": "Hyperloop : premier essai réussi avec des passagers à bord pour Virgin Hyperloop - Futura", "description": "Deux personnes ont pour la première fois circulé à bord d’une capsule Hyperloop. Une étape clé dans le développement du train subsonique qui promet de révolutionner les transports.", "url": "https://www.futura-sciences.com/tech/actualites/hyperloop-hyperloop-premier-essai-reussi-passagers-bord-virgin-hyperloop-84082/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/2/f/3/2f34cb5b40_50169746_virgin-hyperloop-2020.jpg", "publishedAt": "2020-11-09T12:30:00Z", "content": "Deux personnes ont pour la première fois circulé à bord d'une capsule Hyperloop. Une étape clé dans le développement du train subsonique qui promet de révolutionner les transports.\r\nAprès des années … [+1881 chars]"}, {"source": {"id": null, "name": "L'Usine Nouvelle"}, "author": "Myrtille Delamarche", "title": "Ces sept pays plombent la décarbonation de l'électricité européenne - L'Usine Energie - L'Usine Nouvelle", "description": "Sept pays recourant largement au charbon et au gaz naturel pour la g&eacute;n&eacute;ration d&rsquo;&eacute;lectricit&eacute; mettent en p&eacute;ril l&rsquo;objectif 2030 de r&eacute;duction des &eacute;missions de gaz &agrave; effet de serre de l&rsquo;Unio…", "url": "https://www.usinenouvelle.com/article/ces-sept-pays-plombent-la-decarbonation-de-l-electricite-europeenne.N1025774", "urlToImage": "https://www.usinenouvelle.com/mediatheque/4/8/6/000688684_image_600x315.jpg", "publishedAt": "2020-11-09T12:04:00Z", "content": "En 2030, les émissions carbone de l’Europe devraient avoir baissé de 55% par rapport à 1990, si l’Union (UE 27) veut atteindre les objectifs proposés par la Commission européenne. Le Parlement europé… [+195 chars]"}, {"source": {"id": null, "name": "Presse-citron"}, "author": "Arthur Vera", "title": "Dès 2021, des millions de sites web ne seront plus accessibles depuis certains smartphones Android - Presse-citron", "description": "Une mise à jour s'impose afin de continuer à surfer librement sur Internet.", "url": "https://www.presse-citron.net/des-2021-des-millions-de-sites-web-ne-seront-plus-accessibles-depuis-certains-smartphones-android/", "urlToImage": "https://www.presse-citron.net/wordpress_prod/wp-content/uploads/2020/06/android-11.jpg", "publishedAt": "2020-11-09T11:50:55Z", "content": "Plusieurs sites web ne seront plus accessibles à partir de 2021, si vous utilisez encore un smartphone sous Android 7.1.1. À l’heure d’Android 11, il est grand temps de faire du changement en optant … [+1776 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Thibaut Popelier", "title": "Exclu web : la tablette Huawei MediaPad M5 Lite est en promo chez Electro-dépôt - Clubic", "description": "Habituée à notre section réservée aux bons plans, la tablette tactile Huawei MediaPad M5 Lite est de retour avec une nouvelle promotion. En effet, elle est disponible dès maintenant contre 189,97€.", "url": "https://www.clubic.com/bons-plans/bons-plans-promos-huawei/bons-plans-20414-exclu-web-la-tablette-huawei-mediapad-m5-lite-est-en-promo-chez-electro-depot.html", "urlToImage": "https://pic.clubic.com/v1/images/1838715/raw?width=900&height=600&fit=max&hash=6be3893295c1b0c364e8934ab596e5d527186094", "publishedAt": "2020-11-09T11:05:00Z", "content": "Cette réduction affichée chez Electro Dépôt est une exclusivité internet. La livraison à domicile peut être effectuée gratuitement selon votre ville de résidence. Des stocks sont également disponible… [+876 chars]"}, {"source": {"id": null, "name": "Univers Freebox"}, "author": null, "title": "SFR prêt à céder plusieurs dizaines de réseaux de Covage pour sécuriser son acquisition - Univers Freebox", "description": "Altice veut sécuriser le rachat de Covage. Le groupe de Patrick Drahi tente ainsi d’apporter des garanties en matière de concurrence sur le marché professionnel. Il se montre prêt à céder une partie des activités. Céder une partie des activités de Covage, voi…", "url": "https://www.universfreebox.com/article/59167/altice-pret-a-ceder-une-partie-des-reseaux-de-covage-pour-securiser-son-acquisition-de-l-operateur", "urlToImage": "https://www.universfreebox.com/wp-content/uploads/2020/11/altice3.jpg", "publishedAt": "2020-11-09T10:52:00Z", "content": "Altice veut sécuriser le rachat de Covage. Le groupe de Patrick Drahi tente ainsi dapporter des garanties en matière de concurrence sur le marché professionnel. Il se montre prêt à céder une partie d… [+2821 chars]"}, {"source": {"id": null, "name": "Lemondeinformatique.fr"}, "author": null, "title": "Le ransomware RansomEXX s'attaque maintenant aux systèmes Linux - LeMondeInformatique", "description": "Particuli�rement actif depuis quelques mois, le ransomware RansomEXX a connu une �volution de son code permettant de compromettre d�sormais des...", "url": "https://www.lemondeinformatique.fr/actualites/lire-le-ransomware-ransomexx-s-attaque-maintenant-aux-systemes-linux-80969.html", "urlToImage": "https://images.itnewsinfo.com/lmi/articles/grande/000000075240.jpg", "publishedAt": "2020-11-09T10:39:03Z", "content": "Particulirement actif depuis quelques mois, le ransomware RansomEXX a connu une volution de son code permettant de compromettre dsormais des systmes Linux.Les systèmes Windows ne sont pas les seules … [+2193 chars]"}, {"source": {"id": null, "name": "Univers Freebox"}, "author": null, "title": "Orange s’empare d’un nouvel opérateur en Europe et se renforce - Univers Freebox", "description": "Leader sur le mobile en Roumanie, Orange annonce ce matin l’acquisition de 54% du numéro 2 du fixe dans le pays, Telekom Romania Communications.  Devenir “le premier acteur convergent en Roumanie”, tel est l’objectif affiché par Orange. Pour y parvenir, le gr…", "url": "https://www.universfreebox.com/article/59166/orange-s-empare-d-un-nouvel-operateur-en-europe-et-se-renforce", "urlToImage": "https://www.universfreebox.com/wp-content/uploads/2020/11/EfObbstXkAEYppX.jpeg", "publishedAt": "2020-11-09T10:31:00Z", "content": "Leader sur le mobile en Roumanie, Orange annonce ce matin lacquisition de 54% du numéro 2 du fixe dans le pays, Telekom Romania Communications. \r\nDevenir “le premier acteur convergent en Roumanie”, t… [+1446 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Pierre Crochart", "title": "Xiaomi dévoile un étonnant objectif téléscopique pour smartphone, beaucoup plus lumineux - Clubic", "description": "Au cours d’une conférence dédiée aux développeurs s’étant tenue ce week-end, Xiaomi a présenté un nouveau téléobjectif destiné à être intégré sur ses futurs smartphones. Sa particularité ? Il est beaucoup plus lumineux que ceux de la concurrence.", "url": "https://www.clubic.com/pro/entreprises/xiaomi/actualite-20403-xiaomi-devoile-un-etonnant-objectif-telescopique-pour-smartphone-beaucoup-plus-lumineux.html", "urlToImage": "https://pic.clubic.com/v1/images/1839068/raw?width=900&height=600&fit=max&hash=6e25d44dfde2e0bd641d3288c1f11ecaf5e5d139", "publishedAt": "2020-11-09T09:57:00Z", "content": "Lun des principaux problèmes des téléobjectifs intégrés à nos smartphones est leur faible ouverture. La plupart du temps fixée autour de /3.4, elle ne permet pas au capteur (déjà de très petite taill… [+510 chars]"}, {"source": {"id": null, "name": "Caradisiac.com"}, "author": "Caradisiac.com", "title": "Volkswagen ne veut pas se retrouver dans la situation de Nokia - Caradisiac.com", "description": "Ne pas tomber dans la situation dramatique d'une marque qui est spécialisée dans l'assemblage de produits industriels, mais qui s'est laissée dépasser par l'avancée logicielle : voilà le combat d'Herbert Diess, le patron du groupe Volkswagen, qui ne veut pas …", "url": "https://www.caradisiac.com/volkswagen-ne-veut-pas-se-retrouver-dans-la-situation-de-nokia-186313.htm", "urlToImage": "https://images.caradisiac.com/logos/3/2/7/6/263276/S7-volkswagen-ne-veut-pas-se-retrouver-dans-la-situation-de-nokia-186313.jpg", "publishedAt": "2020-11-09T09:54:00Z", "content": "Avec l'arrivée de la voiture électrique, le risque, pour les constructeurs \"historiques\", est d'être rapidement dépassés par les évènements et de n'être plus que des spécialistes de la production, qu… [+1164 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Manuel Castejon", "title": "OnePlus Watch : la montre ne tournerait pas sous Wear OS - Frandroid", "description": "Un leaker affirme que la future montre connectée de OnePlus ne tournerait pas sous Wear OS… Et ce n’est pas si mal.", "url": "https://www.frandroid.com/marques/oneplus/797053_oneplus-watch-la-montre-ne-tournerait-pas-sous-wear-os", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/08/oneplus-watch.jpg", "publishedAt": "2020-11-09T09:46:00Z", "content": "Un leaker affirme que la future montre connectée de OnePlus ne tournerait pas sous Wear OS Et ce nest pas si mal.\r\nOubliez ce cadre rectangulaire, et laissez votre imagination se focaliser sur un des… [+2300 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Mathieu Grumiaux", "title": "Apple suspend la fabrication d'iPhone avec Pegatron pour violation du droit du travail en Chine - Clubic", "description": "Le sous-traitant aurait enfreint les règles d’un programme destiné à encadrer le temps de travail des étudiants.", "url": "https://www.clubic.com/pro/entreprises/apple/actualite-20384-apple-suspend-la-fabrication-d-iphone-avec-pegatron-pour-violation-du-droit-du-travail-en-chine.html", "urlToImage": "https://pic.clubic.com/v1/images/1709374/raw?width=900&height=600&fit=max&hash=6083844d155b98152575f84c4789fc32f9b5a10d", "publishedAt": "2020-11-09T09:40:00Z", "content": "Pegatron n'a pas tardé à réagir et a annoncé avoir retiré les étudiants de ses lignes de production. Ils sont invités à retourner dans leur famille et une compensation financière leur sera accordée. … [+730 chars]"}, {"source": {"id": null, "name": "Les Numériques"}, "author": "Erick Fontaine", "title": "Bosch dévoile un écran connecté partagé pour les motos - Les Numériques", "description": "Bosch a développé un écran XXL où apparaissent non seulement les informations liées à la moto, mais aussi celles des applications dédiées sur son smartphone, et ce grâce à la solution logicielle mySPIN. Le tout se commande depuis le guidon.", "url": "https://www.lesnumeriques.com/moto/bosch-devoile-un-ecran-connecte-partage-pour-les-motos-n156721.html", "urlToImage": "https://dyw7ncnq1en5l.cloudfront.net/optim/news/15/156721/f1fb30bc-bosch-devoile-un-ecran-partage-connecte-pour-les-motos__908_512__0-125-908-637.jpeg", "publishedAt": "2020-11-09T09:24:00Z", "content": "Bosch a développé un écran XXL où apparaissent non seulement les informations liées à la moto, mais aussi celles des applications dédiées sur son smartphone, et ce grâce à la solution logicielle mySP… [+2568 chars]"}, {"source": {"id": null, "name": "Hitek.fr"}, "author": null, "title": "Un bon prix pour cet écran gaming incurvé de 27 pouces WQHD 144 Hz de chez Fox Spirit - Hitek.fr", "description": "Fox Spirit nous fait profiter d'une nouvelle offre sur un écran gaming incurvé de 27 pouces.", "url": "https://hitek.fr/actualite/fox-spirit-pgm270-bon-plan-ecran-gaming-incurve_25374", "urlToImage": "https://static.hitek.fr/img/actualite/ill_m/943531896/ld00056875741.jpg", "publishedAt": "2020-11-09T09:14:50Z", "content": "Si vous voulez jouer dans les meilleures conditions possibles, voici un écran gaming incurvé qui ne vous fera pas défaut. Il s'agit du Fox Spirit PGM270 et en ce moment avec un code promo vous aurez … [+1544 chars]"}, {"source": {"id": null, "name": "Automobile-propre.com"}, "author": "Soufyane Benhammouda", "title": "La Tesla autonome à l’épreuve sur la rue la plus tortueuse du monde - Automobile Propre", "description": "Le prometteur système de conduite autonome de Tesla est actuellement testé par une poignée de clients, qui n’hésitent pas à pousser l’exercice jusque dans la rue la plus tortueuse du monde.", "url": "https://www.automobile-propre.com/breves/la-tesla-autonome-a-lepreuve-sur-la-rue-la-plus-tortueuse-du-monde/", "urlToImage": "https://www.automobile-propre.com/wp-content/uploads/2020/11/tesla-fsd-lombard-street.jpeg", "publishedAt": "2020-11-09T09:05:26Z", "content": "Le prometteur système de conduite autonome de Tesla est actuellement testé par une poignée de clients, qui nhésitent pas à pousser lexercice jusque dans la rue la plus tortueuse du monde.\r\nConforméme… [+1460 chars]"}, {"source": {"id": null, "name": "L'Obs"}, "author": "<a href='https://www.nouvelobs.com/journaliste/310/corinne-bouchouchi.html'>Corinne Bouchouchi</a>", "title": "Une semaine avec le dernier fleuron de Huawei… sans les services Google - L'Obs", "description": "L’acheter ou pas ? Le smartphone Mate 40 Pro, annoncé par la firme chinoise Huawei comme le plus puissant du marché débarque en France le 12 novembre. Hélas, ce concentré de technologie est toujours privé des « Google Mobile Services ». #On a testé", "url": "https://www.nouvelobs.com/high-tech/20201109.OBS35867/une-semaine-avec-le-dernier-fleuron-de-huawei-sans-les-services-google.html", "urlToImage": "https://focus.nouvelobs.com/2020/11/08/719/0/4032/2012/1200/630/60/0/5ec2fff_578646160-img-9976.jpg", "publishedAt": "2020-11-09T09:01:44Z", "content": "Lundi : « Aie confiance »\r\nPas de show londonien ou de rassemblement à Munich comme pour ses prédécesseurs. Confinement oblige, je récupère chez moi et par coursier la boîte noire et argent contenant… [+11048 chars]"}, {"source": {"id": null, "name": "Clubic"}, "author": "Guillaume Belfiore", "title": "Les détails techniques du OnePlus 9 se dévoilent déjà - Clubic", "description": "Davantage d'informations circulent sur le prochain fer de lance du constructeur OnePlus. Le OnePlus 9 serait décliné en trois versions et cinq variantes. Il accueillerait par ailleurs le tout prochain SoC de Qualcomm.", "url": "https://www.clubic.com/pro/entreprises/oneplus/actualite-20377-les-details-techniques-du-oneplus-9-se-devoilent-deja.html", "urlToImage": "https://pic.clubic.com/v1/images/1834449/raw?width=900&height=600&fit=max&hash=adb85dd21c2c82665336eebd00441c8377f67ab8", "publishedAt": "2020-11-09T09:00:00Z", "content": "Le dernier SoC en date chez Qualcomm est le Snapdragon 865 Plus sorti cet été. Toutefois, le mois dernier, le fondeur a envoyé des invitations pour un événement virtuel qui se tiendra le 1er décembre… [+722 chars]"}, {"source": {"id": null, "name": "Frandroid"}, "author": "Omar Belkaab", "title": "Samsung Galaxy S21 : une sortie plus tôt pour faire mal à Huawei - Frandroid", "description": "Habitué aux lancements en fin février ou début mars, Samsung compterait sortir ses Galaxy S21 en janvier 2021. Cette initiative aurait pour objectif de mettre la pression sur la concurrence et tout particulièrement sur Huawei.", "url": "https://www.frandroid.com/marques/samsung/797036_samsung-galaxy-s21-une-sortie-plus-tot-pour-faire-mal-a-huawei", "urlToImage": "https://images.frandroid.com/wp-content/uploads/2020/10/121589067_793310284815641_3819943935843277212_n.jpg", "publishedAt": "2020-11-09T08:33:00Z", "content": "Habitué aux lancements en fin février ou début mars, Samsung compterait sortir ses Galaxy S21 en janvier 2021. Cette initiative aurait pour objectif de mettre la pression sur la concurrence et tout p… [+2143 chars]"}, {"source": {"id": null, "name": "Cowcotland.com"}, "author": "Aurélien LAGNY", "title": "Les GeForce RTX 3000 de NVIDIA devraient maintenant avoir une bien meilleure disponibilité - Cowcotland", "description": "Il y a quelques minutes, nous vous avons annoncés que quelques RTX 3000 étaient enfin disponibles à la vente. Certes pas au ta..., actualité 74046", "url": "https://www.cowcotland.com/news/74046/les-geforce-rtx-3000-de-nvidia-devraient-maintenant-avoir-une-bien-meilleure-disponibilite.html", "urlToImage": "/images/news/2020/11/geforce-rtx-3000-nvidia-disponibilite-meilleure-f.jpg", "publishedAt": "2020-11-09T08:31:43Z", "content": "Il y a quelques minutes, nous vous avons annoncés que quelques RTX 3000 étaient enfin disponibles à la vente. Certes pas au tarif que nous voudrions, mais la disponibilité semble s'améliorer et si la… [+1059 chars]"}, {"source": {"id": null, "name": "ZDNet France"}, "author": "Catalin Cimpanu", "title": "Des hackers chinois font tomber Windows 10, iOS 14 ou Chrome lors d'un concours - ZDNet France", "description": "Nombre de logiciels incontournables viennent de se faire pirater lors de la Tianfu Cup, le plus grand concours de hacking en Chine... Parmi lesquels Windows 10, Chrome, iOS 14, Safari ou Firefox.", "url": "https://www.zdnet.fr/actualites/des-hackers-chinois-font-tomber-windows-10-ios-14-ou-chrome-lors-d-un-concours-39912679.htm", "urlToImage": "https://d1fmx1rbmqrxrr.cloudfront.net/zdnet/i/edit/ne/2019/Pierre%20temp/Hacking%20Contest%20Chine.jpg", "publishedAt": "2020-11-09T06:59:00Z", "content": "Nul n'est intouchable. C'est ce qu'ont confirmé des hackers chinois, qui ont piraté de nombreux logiciels parmi les meilleurs du moment en utilisant des exploits nouveaux et inédits lors de l'édition… [+1955 chars]"}, {"source": {"id": null, "name": "Europe 1"}, "author": "Nicolas Barré", "title": "Fermeture de Fessenheim : tout le monde y perd ! - Europe1", "description": "L’État va donner 377 millions d’euros à EDF pour fermer Fessenheim mais doit relancer des centrales à charbon pour compenser la perte en électricité. Une situation absurde car tout le monde est perdant dans l'histoire. Nicolas Barré fait le point sur une ques…", "url": "https://www.europe1.fr/emissions/L-edito-eco2/fermeture-de-fessenheim-tout-le-monde-y-perd-4004316", "urlToImage": "https://cdn-europe1.lanmedia.fr/var/europe1/storage/images/europe1/emissions/l-edito-eco2/fermeture-de-fessenheim-tout-le-monde-y-perd-4004316/56272088-1-fre-FR/Fermeture-de-Fessenheim-tout-le-monde-y-perd.jpg", "publishedAt": "2020-11-09T06:22:51Z", "content": "C'est l'épilogue d'une longue histoire : l'État va verser 377 millions d'euros pour indemniser EDF au titre de la fermeture des deux réacteurs de la centrale nucléaire de Fessenheim.\r\nL'Assemblée nat… [+2577 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": null, "title": "Tesla : Un conducteur de Model 3 acquitté dans un litige routier grâce à la dashcam Tesla - Tom's Guide", "description": "Ce weekend, dans le Nebraska, un possesseur de Tesla Model 3 a été victime d’une agression routière. Le propriétaire de la Tesla a pu prouver sa bonne foi grâce aux caméras de la Tesla, et malgré les accusations de l’autre conducteur.", "url": "https://www.tomsguide.fr/tesla-un-conducteur-de-model-3-acquitte-dans-un-litige-routier-grace-a-la-dashcam-tesla/", "urlToImage": "https://cdn.tomsguide.fr/content/uploads/sites/2/2020/11/20201109-tesla-model-3-camra-accident-prouve-innocence.jpg", "publishedAt": "2020-11-09T03:22:00Z", "content": "Ce weekend, dans le Nebraska, un possesseur de Tesla Model 3 a été victime dune agression routière. Le propriétaire de la Tesla a pu prouver sa bonne foi grâce aux caméras de la Tesla, et malgré les … [+2787 chars]"}]}