{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "ComicBook.com"}, "author": "Logan Moore", "title": "Resident Evil Village Contains Hidden Secret in Final Cutscene That May Tease Resident Evil 9 - ComicBook.com", "description": "Spoiler Warning: Plot details related to the entirety of Resident Evil Village are contained within this article. If you don't want to know what happens within the game's story, don't read past this point. --If you have finished Resident Evil Village at this …", "url": "https://comicbook.com/gaming/news/resident-evil-village-ending-ethan-winters-resident-evil-9/", "urlToImage": "https://media.comicbook.com/2021/01/resident-evil-village-1253577-1280x0.jpeg", "publishedAt": "2021-05-16T02:15:00Z", "content": "Spoiler Warning: Plot details related to the entirety of Resident Evil Village are contained within this article. If you don't want to know what happens within the game's story, don't read past this … [+2624 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Logan Moore", "title": "New Red PS5 Controller Costs Extra - ComicBook.com", "description": "Earlier this week, PlayStation announced that it would be releasing two new PlayStation 5 DualSense controllers in different color schemes. The announcement was one that was met with joy and excitement from a number of fans who have been asking for different …", "url": "https://comicbook.com/gaming/news/ps5-red-controller-dualsense-costs-more/", "urlToImage": "https://media.comicbook.com/2021/05/ps5-dualsense-red-1268479-1280x0.jpeg", "publishedAt": "2021-05-16T01:48:00Z", "content": "Earlier this week, PlayStation announced that it would be releasing two new PlayStation 5 DualSense controllers in different color schemes. The announcement was one that was met with joy and exciteme… [+2024 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mariella-moon", "title": "'Final Fantasy XIV Online' Endwalker expansion arrives on November 23rd - Engadget", "description": "Endwalker, Final Fantasy XIV Online's fourth expansion pack, is coming out on November 23rd..", "url": "https://www.engadget.com/final-fantasy-xiv-online-endwalker-november-23rd-214301453.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/02d47fe0-b53f-11eb-97f9-4bbad23546a6", "publishedAt": "2021-05-15T21:45:00Z", "content": "Endwalker, Final Fantasy XIV Online's fourth expansion pack, is coming out on November 23rd. Square Enix has revealed its release date at Digital Fan Festival 2021, where director Naoki Yoshida has a… [+1495 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Charlotte Griffiths", "title": "TALK OF THE TOWN: Broody Princess Beatrice sets her eye on a £3million family home in the Cotswolds - Daily Mail", "description": "TALK OF THE TOWN: Amid a flurry of rumours that ten months after their wedding Princess Beatrice and Edo Mapelli Mozzi are feeling broody, I hear they are on the lookout for a sizeable family home.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-9582595/TALK-TOWN-Broody-Princess-Beatrice-sets-eye-3million-family-home-Cotswolds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/15/22/43032188-0-image-a-18_1621114165867.jpg", "publishedAt": "2021-05-15T21:42:09Z", "content": "Amid a flurry of rumours that ten months after their wedding Princess Beatrice and Edo Mapelli Mozzi are feeling broody, I hear they are on the lookout for a sizeable family home in or around the Cot… [+2819 chars]"}, {"source": {"id": null, "name": "PhoneArena"}, "author": "Anam Hamid", "title": "Samsung possibly working to ditch Android for a new OS - PhoneArena", "description": "It recently came to light that Samsung is working with Google on its new Fuchsia OS and it now appears that it plans to launch a device with the new platform.", "url": "https://www.phonearena.com/news/samsung-may-adopt-google-fuchsia-os_id132137", "urlToImage": "https://m-cdn.phonearena.com/images/article/132137-wide-two_1200/Samsung-possibly-working-to-ditch-Android-for-a-new-OS.jpg", "publishedAt": "2021-05-15T21:41:48Z", "content": null}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "James Archer", "title": "AirPods 3 launch tipped for this week with Apple Music HiFi - Tom's Guide", "description": "New AirPods 3 leak claims imminent release date — should you believe it?", "url": "https://www.tomsguide.com/news/airpods-3-launch-tipped-for-this-week-with-apple-music-hifi", "urlToImage": "https://cdn.mos.cms.futurecdn.net/b7EvRKw2gtPZJ3QD8Q6huH-1200-80.jpg", "publishedAt": "2021-05-15T21:37:28Z", "content": "Its always a good idea to approach leaks with a critical eye, but the latest AirPods 3\r\n release launch date rumor is hard to believe.\r\nAs reported by AppleTrack\r\n and originally tipped by YouTuber L… [+1906 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Tyler Fischer", "title": "New Assassin's Creed Tease Divides Fans - ComicBook.com", "description": "The modern Assassin's Creed games -- Origins, Odyssey, and Valhalla -- are quite different from the original Assassin's Creed games. Where the original games were stealth-focused, linear, and far from open world, the new entries are more action-focused, open-…", "url": "https://comicbook.com/gaming/news/assassins-creed-valhalla-new-rpg-game/", "urlToImage": "https://media.comicbook.com/2021/03/assassins-creed-1260340-1280x0.jpeg", "publishedAt": "2021-05-15T21:37:00Z", "content": "The modern Assassin's Creed games -- Origins, Odyssey, and Valhalla -- are quite different from the original Assassin's Creed games. Where the original games were stealth-focused, linear, and far fro… [+2067 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Tyler Fischer", "title": "GTA 5 Fan Goes Viral After Discovering Game Location in Real Life - ComicBook.com", "description": "While many Grand Theft Auto fans have been sent into panic mode over a new GTA 6 tweet, other GTA fans are losing their mind over on Reddit. For the development of GTA 5, Rockstar Games surveyed the greater Los Angeles area to create a believable map. As a re…", "url": "https://comicbook.com/gaming/news/gta-5-grand-theft-auto-v-trevor-location-reddit/", "urlToImage": "https://media.comicbook.com/2021/05/trevor-1268461-1280x0.jpeg", "publishedAt": "2021-05-15T21:35:00Z", "content": "While many Grand Theft Auto fans have been sent into panic mode over a new GTA 6 tweet, other GTA fans are losing their mind over on Reddit. For the development of GTA 5, Rockstar Games surveyed the … [+1662 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Ciprian Florea", "title": "1969 Ford Mustang Mach 1 Sees First Daylight in Decades, Has Numbers-Matching V8 - autoevolution", "description": "Long-term storage is a good way to preserve a classic car. But this works best if the vehicle is being kept in a moisture-free garage with a stable temperature. This 1969 Ford Mustang Mach 1 spent a few decades in not-so-perfect indoor storage, but it looks s…", "url": "https://www.autoevolution.com/news/1969-ford-mustang-mach-1-sees-first-daylight-in-decades-has-numbers-matching-v8-161270.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/1969-ford-mustang-mach-1-sees-first-daylight-in-decades-has-numbers-matching-v8-161270-7.jpg", "publishedAt": "2021-05-15T21:00:00Z", "content": "Before it went into indoor storage for a few decades, this Mach 1 was driven for around 76,000 miles (122,310 km). And it shows. There are quite a few dents in the body, mostly visible on the passeng… [+2319 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Tyler Fischer", "title": "Pokemon Sword and Shield Player Has the Most Unexpected Shiny Encounter - ComicBook.com", "description": "Pokemon Sword and Shield players will know that catching shiny Pokemon is not easy. In fact, many players on Nintendo Switch and Nintendo Switch Lite will never catch a shiny Pokemon. That said, while the odds are against players, there are many hardcore play…", "url": "https://comicbook.com/gaming/news/pokemon-sword-shield-reddit-tyrogue/", "urlToImage": "https://media.comicbook.com/2021/05/pokemon-sword-shield-hop-1267285-1280x0.jpeg", "publishedAt": "2021-05-15T20:35:00Z", "content": "Pokemon Sword and Shield players will know that catching shiny Pokemon is not easy. In fact, many players on Nintendo Switch and Nintendo Switch Lite will never catch a shiny Pokemon. That said, whil… [+1680 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Bogdan Popa", "title": "Google Confirms Highly Anticipated Android Auto Fix in Recent Update - autoevolution", "description": "While Android Auto is supposed to make voice calls a lot more straightforward by letting you manage everything using commands, some users learned the hard way that the whole thing isn’t necessarily as easy as it sounds.", "url": "https://www.autoevolution.com/news/google-confirms-highly-anticipated-android-auto-fix-in-recent-update-161267.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/google-confirms-highly-anticipated-android-auto-fix-in-recent-update-161267-7.jpg", "publishedAt": "2021-05-15T20:08:00Z", "content": "A glitch that’s been around for quite a while, for example, is causing voice calls to no longer work properly on Android Auto in such a way that the person at the other end of the line isn’t hearing … [+1369 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Edward Moyer", "title": "Twitter to call subscription service Twitter Blue, charge $2.99 a month, report says - CNET", "description": "The tiered service will also let you make collections of fave tweets, so you can find them when you want to, says tipster Jane Manchun Wong.", "url": "https://www.cnet.com/news/twitter-to-call-subscription-service-twitter-blue-charge-2-99-a-month-report-says/", "urlToImage": "https://www.cnet.com/a/img/qJGppmfCmfIrvd7ArbSHFeLyNho=/1200x630/2021/02/11/44aca5e8-0978-455c-aede-e7456f85c41c/twitter-logo-2614.jpg", "publishedAt": "2021-05-15T19:58:00Z", "content": "James Martin/CNET\r\nA forthcoming subscription service from Twitter will be called Twitter Blue and cost $2.99 a month, tipster Jane Manchun Wong tweeted on Saturday. In early May, the social site spo… [+889 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Kim Lyons", "title": "Go read this look at how Clubhouse’s blocking system is problematic - The Verge", "description": "Most social media platforms provide a way for users to restrict who can interact with them, usually by blocking the other person. But Clubhouse takes a different approach, one that can be weaponized to silence certain people and conversations on a wider scale.", "url": "https://www.theverge.com/2021/5/15/22437934/go-read-this-clubhouse-blocking-system-black-badge", "urlToImage": "https://cdn.vox-cdn.com/thumbor/DQHdSqtt4yU2aR6JiqPQy-17F1k=/0x278:3888x2314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22517046/1232816107.jpg", "publishedAt": "2021-05-15T19:47:51Z", "content": "The platform has a different system than its social media cousins\r\nPhoto Illustration by Pavlo Gonchar/SOPA Images/LightRocket via Getty Images\r\nAnyone whos spent more than five minutes on social med… [+2550 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Adam Bankhurst", "title": "Hades Has Been Rated For PS4 by Korean Rating Committee - IGN - IGN", "description": "Hades has been rated for PS4 by Korea's Game Rating and Administration Committee, hinting that Supergiant Games' rougue-like will soon be making its way to other platforms besides PC and Nintendo Switch.", "url": "https://www.ign.com/articles/hades-has-been-rated-for-ps4-by-korean-rating-committee", "urlToImage": "https://assets1.ignimgs.com/2018/12/12/hades-1280-1544656728364.jpg?width=1280", "publishedAt": "2021-05-15T19:46:06Z", "content": "Hades has been rated for PS4 by Korea's Game Rating and Administration Committee, hinting that Supergiant Games' rougue-like will soon be making its way to other platforms besides PC and Nintendo Swi… [+1156 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Rare orange-eyed owl spotted for the first time in more than 125 years - Fox News", "description": "For the first time since its discovery more than 125 years ago, scientists have documented the Bornean subspecies of the Rajah Scops-Owl (Otus brookii brookii) in the montane forest of Malaysia's Mount Kinabalu.", "url": "https://www.foxnews.com/science/rare-orange-eyed-owl-spotted-first-time-125-years", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/05/Bornean-Owl.jpg", "publishedAt": "2021-05-15T18:54:25Z", "content": "For the first time since its discovery more than 125 years ago, scientists have documented the Bornean subspecies of the Rajah Scops-Owl in the montane forest of Malaysia's Mount Kinabalu.\r\nResearche… [+4020 chars]"}, {"source": {"id": null, "name": "Android Police"}, "author": null, "title": "Microsoft's folding Surface Duo is cheaper than the Pixel 5 today - Android Police", "description": "As folding phones gained momentum last year, Microsoft released its own take. The Duo is not a good phone for a number of reasons: it's big and awkward,", "url": "https://www.androidpolice.com/2021/05/15/microsofts-folding-surface-duo-is-cheaper-than-the-pixel-5-today/", "urlToImage": "https://www.androidpolice.com/wp-content/uploads/2020/09/03/surface-duo-review-6.jpg", "publishedAt": "2021-05-15T18:28:00Z", "content": "As folding phones gained momentum last year, Microsoft released its own take. The Duo is not a good phone for a number of reasons: it's big and awkward, it's got an unusual form factor that's not par… [+738 chars]"}, {"source": {"id": null, "name": "Video Games Chronicle"}, "author": "Andy Robinson", "title": "Here’s the first look at The Division Heartland via 20 mins of leaked footage - Video Games Chronicle", "description": "F2P game will include a 45-player PvEvP mode…", "url": "https://www.videogameschronicle.com/news/heres-the-first-look-at-the-division-heartland-via-20-mins-of-leaked-footage/", "urlToImage": "https://www.videogameschronicle.com/files/2021/05/Division_update_header.jpg", "publishedAt": "2021-05-15T18:21:28Z", "content": "More than 20 minutes of The Division Heartland gameplay has leaked via a closed test.\r\nHeartland is the free-to-play Division spin-off announced earlier this month, described by publisher Ubisoft as … [+2310 chars]"}, {"source": {"id": null, "name": "Fstoppers"}, "author": "https://www.facebook.com/wasim.ahmad", "title": "Why the Canon EOS R Might Be the Best Choice for RF Shooters - Fstoppers", "description": "When Canon launched the RF mount with the EOS R, your choices were limited to that one camera if you wanted to buy into Canon's stellar new lens system. While it's a bit long in the tooth, it's definitely still a viable camera, and possibly the best camera to…", "url": "https://fstoppers.com/gear/why-canon-eos-r-might-be-best-choice-rf-shooters-563094", "urlToImage": "https://cdn.fstoppers.com/styles/large-16-9/s3/lead/2021/05/d03252ab48d1bfcc902b6c5bf021734a.jpg", "publishedAt": "2021-05-15T18:02:34Z", "content": "When Canon launched the RF mount with the EOS R, your choices were limited to that one camera if you wanted to buy into Canon's stellar new lens system. While it's a bit long in the tooth, it's defin… [+3283 chars]"}, {"source": {"id": null, "name": "Kotaku"}, "author": "Zack Zwiezen", "title": "Fans Have Translated All Of The Native American Dialogue In Assassin's Creed Valhalla - Kotaku", "description": "Fans working with experts have translated all of the Kanien’kehá:ka dialogue that appears in the Vinland section of Assassin’s Creed Valhalla.", "url": "https://kotaku.com/fans-have-translated-all-of-the-native-american-dialogu-1846903065", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/25f245998c612d1b7ff503be63594be9.jpg", "publishedAt": "2021-05-15T18:00:00Z", "content": "Fans working with experts have translated all of the Kanienkehá:ka dialogue that appears in the Vinland section of Assassins Creed Valhalla.\r\nAround the halfway point or so of the massive Assassins C… [+1489 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "https://www.facebook.com/subirk/", "title": "Cloudflare wants to save 500 years per day of humans trying to solve CAPTCHA by killing it - Neowin", "description": "Cloudflare says humans waste about 32 seconds per instance totalling 500 years per day on CAPTCHAs. The company is launching an experiment to get rid of CAPTCHAs completely and end this \"madness\".", "url": "https://www.neowin.net/news/cloudflare-wants-to-save-500-years-per-day-of-humans-trying-to-solve-captcha-by-killing-it/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2021/05/1621092533_image3-4_story.jpg", "publishedAt": "2021-05-15T16:50:01Z", "content": "Cloudflare the American web infrastructure and website security company that provides content delivery network services, DDoS mitigation, Internet security, and distributed domain name server service… [+2746 chars]"}, {"source": {"id": null, "name": "Dexerto"}, "author": null, "title": "How many players have been banned from Warzone? Total ban numbers revealed by devs - Dexerto", "description": "Raven have confirmed the banning of over 30,000 Call of Duty: Warzone accounts, adding to ban waves carried out in previous months.", "url": "https://www.dexerto.com/call-of-duty/how-many-players-have-been-banned-from-warzone-total-ban-numbers-revealed-by-devs-1574530/", "urlToImage": "https://www.dexerto.com/wp-content/uploads/2021/05/15/Warzone-Hackers-Raven-Activision.jpg", "publishedAt": "2021-05-15T16:41:29Z", "content": "Call of Duty: Warzone developers Raven Software have provided CoD fans another update on cheaters in the battle royale, confirming another ban wave as well as the total number of accounts banned. \r\nW… [+2034 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Antarctic Ice Sheet Retreat Could Trigger Chain Reaction – Possibly Came Close to Collapse in the Past - SciTechDaily", "description": "The Antarctic ice sheet was even more unstable in the past than previously thought, and at times possibly came close to collapse, new research suggests. The findings raise concerns that, in a warmer climate, exposing the land underneath the ice sheet as it re…", "url": "https://scitechdaily.com/antarctic-ice-sheet-retreat-could-trigger-chain-reaction-possibly-came-close-to-collapse-in-the-past/", "urlToImage": "https://scitechdaily.com/images/Antarctic-Winds.jpg", "publishedAt": "2021-05-15T16:02:43Z", "content": "Today, Antarctic winds usually blow from the continent out to the sea. Credit: Svein Østerhu\r\nThe Antarctic ice sheet was even more unstable in the past than previously thought, and at times possibly… [+4749 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ramish Zafar", "title": "Lucid Motors CEO Says He Set Up SpaceX Team That Helped Design Model X, Quashes Rumors Of Apple Deal - Wccftech", "description": "Lucid Motors' chief executive officer Mr. Peter Rawlinson has shared more details about his time at Tesla Inc and rumors surrounding his company's discussions with Cupertino tech giant Apple Inc. The executive's comments came in the light of Tesla chief Mr. E…", "url": "https://wccftech.com/lucid-chief-says-he-set-up-spacex-team-that-helped-design-model-x-quashes-rumors-of-apple-deal/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2021/05/LUCID-MOTORS-CHIEF-PETER-RAWLINSON-740x398.png", "publishedAt": "2021-05-15T15:41:06Z", "content": "Lucid Motors' chief executive officer Mr. Peter Rawlinson has shared more details about his time at Tesla Inc and rumors surrounding his company's discussions with Cupertino tech giant Apple Inc. The… [+4027 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Watch Dogs: Legion's upcoming 4.5 update adds 60fps performance mode on PS5 and Xbox Series X - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2021-05-15-watch-dogs-legions-upcoming-4-5-update-adds-60fps-performance-mode-on-ps5-and-xbox-series-x", "urlToImage": "https://d2skuhm0vrry40.cloudfront.net/2021/articles/2021-05-15-16-21/watch-dogs-legions-upcoming-4-5-update-adds-60fps-performance-mode-on-ps5-and-xbox-series-x-1621092102238.jpg/EG11/resize/1200x-1/watch-dogs-legions-upcoming-4-5-update-adds-60fps-performance-mode-on-ps5-and-xbox-series-x-1621092102238.jpg", "publishedAt": "2021-05-15T15:22:00Z", "content": "Watch Dogs: Legion's upcoming 4.5 patch adds a 60fps performance mode on PlayStation 5 and Xbox Series X, Ubisoft has announced.\r\nTitle update 4.0 went live last week, and in a blog post, Ubisoft rev… [+1410 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Gordon Kelly", "title": "Serious Warning Issued For Millions Of Apple iPhone Users - Forbes", "description": "Every Apple iPhone and iPad owner needs to know about this shocking new App Store revelation...", "url": "https://www.forbes.com/sites/gordonkelly/2021/05/15/apple-iphone-ipad-warning-app-store-security-new-fleeceware-scams/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5f960f4dfffddf07fd19dfe0%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D1297%26cropY1%3D0%26cropY2%3D822", "publishedAt": "2021-05-15T15:11:01Z", "content": "Apple continues to break financial records but - following shock revelation after revelation after revelation after revelation - concerns are mounting about one major source of that income: the Apple… [+3137 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Verge Staff", "title": "How far have you gone for internet access? - The Verge", "description": "Having access to reliable, fast internet is something that many people take for granted. We’ve shared our stories on getting high-speed internet in the past, and we’re asking you to provide stories of your own.", "url": "https://www.theverge.com/2021/5/15/22434809/internet-broadband-high-speed-access-verge-stories-infrastructure", "urlToImage": "https://cdn.vox-cdn.com/thumbor/IE5t9LxFxe-TQjZyUIPhUMs69ts=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22173423/VRG_ILLO_4341_American_Ethernet.jpg", "publishedAt": "2021-05-15T15:00:00Z", "content": "Read our stories, then tell us yours\r\nIllustration by Grayson Blackmon / The Verge\r\nThe Verges Infrastructure Week focused partly on how dire the broadband problem currently is for Americans. On Mond… [+8530 chars]"}, {"source": {"id": null, "name": "Push Square"}, "author": "Push Square", "title": "Sony on Upcoming PS5 Games: Wait Until You See What's Coming from Our Third-Party Partners - Push Square", "description": "Lots to look forward to", "url": "https://www.pushsquare.com/news/2021/05/sony_on_upcoming_ps5_games_wait_until_you_see_whats_coming_from_our_third-party_partners", "urlToImage": "https://images.pushsquare.com/f0f6a272c52e3/1280x720.jpg", "publishedAt": "2021-05-15T13:15:00Z", "content": "While its unquestionably got off to a strong start with titles like Marvels Spider-Man: Miles Morales, Returnal, and Resident Evil Village, itd be fair to say that the PlayStation 5 is still very muc… [+802 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Kim Lyons", "title": "Apple reportedly will continue to require masks in its US retail stores - The Verge", "description": "Despite new guidance from the Centers for Disease Control and Prevention, Apple will keep its mandatory mask policy in place at its US retail stores for the time being, as it evaluates health and safety requirements.", "url": "https://www.theverge.com/2021/5/15/22437593/apple-masks-retail-stores-covid-cdc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ftBANxs9nIo4Jsx2pIO_bbCX62E=/0x286:4000x2380/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22516562/1232558252.jpg", "publishedAt": "2021-05-15T13:04:04Z", "content": "Per the CDC, fully-vaccinated people no longer need to wear masks in most settings\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nApple will keep… [+1724 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "MacRumors Staff", "title": "Top Stories: M1 iMac Benchmarks, iPhone Battery Life Tips, Colorful MacBook Air? - MacRumors", "description": "Anticipation is building for the new iMac and iPad Pro models, which have started shipping out ahead of a launch around May 21. Benchmarks for the...", "url": "https://www.macrumors.com/2021/05/15/top-stories-m1-imac-benchmarks/", "urlToImage": "https://images.macrumors.com/t/mud_brnzmArarGq5l_ph-XzS-ng=/1920x/https://images.macrumors.com/article-new/2021/05/Top-Stories-60-Feature.jpg", "publishedAt": "2021-05-15T13:00:01Z", "content": "Anticipation is building for the new iMac and iPad Pro models, which have started shipping out ahead of a launch around May 21. Benchmarks for the new machines are starting to come in, and the M1 chi… [+6976 chars]"}, {"source": {"id": null, "name": "Push Square"}, "author": "Push Square", "title": "Returnal's Save System Still Being Investigated, New Content in the Works - Push Square", "description": "Housemarque still not sure on best approach to save issues", "url": "https://www.pushsquare.com/news/2021/05/returnals_save_system_still_being_investigated_new_content_in_the_works", "urlToImage": "https://images.pushsquare.com/0514e824cc490/1280x720.jpg", "publishedAt": "2021-05-15T13:00:00Z", "content": "Returnal is one of the best PlayStation 5 games you can buy right now, but it has had one major criticism levelled at it: its save system or lack thereof. Currently, the only way to retain your progr… [+1070 chars]"}, {"source": {"id": null, "name": "HipHopDX"}, "author": "Dana Scott", "title": "NBA Players Give J. Cole's 'The Off-Season' Glowing Reviews - HipHopDX", "description": "The hoopers gave J. Cole's latest album plentiful positive reviews on Twitter upon its release May 14.", "url": "https://hiphopdx.com/news/id.62143/title.j-coles-new-album-sparks-heavy-nba-reactions-from-damian-lillard-ja-morant-more", "urlToImage": "https://static.hiphopdx.com/2021/05/j-cole-ja-morant-dame-liilard-lyrics-e1621047155239-1200x675.jpeg", "publishedAt": "2021-05-15T13:00:00Z", "content": "Everyone who listens to J. Cole’s music knows he loves the NBA.\r\nMany players from the world’s most popular basketball league reciprocated their adoration for the ex-Forest Hill Drive resident’s late… [+3016 chars]"}, {"source": {"id": null, "name": "Video Games Chronicle"}, "author": "Andy Robinson", "title": "Bethesda’s Starfield ‘is exclusive to Xbox and PC’, it’s claimed - Video Games Chronicle", "description": "Reporter suggests the sci-fi RPG will appear at E3 and release in 2022…", "url": "https://www.videogameschronicle.com/news/bethesdas-starfield-is-a-confirmed-exclusive-for-xbox-and-pc-its-claimed/", "urlToImage": "https://www.videogameschronicle.com/files/2020/09/starfield-game.jpg", "publishedAt": "2021-05-15T12:31:36Z", "content": "Bethesdas sci-fi RPG Starfield will be exclusive to Xbox and PC and thus won’t release for PlayStation 5, its been claimed.\r\nThats according to GamesBeat journalist Jeff Grubb, who wrote on Friday: S… [+2776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Talking on Zoom could help older people stave off dementia - CNN ", "description": "Talking on video-conference services like Zoom during the coronavirus pandemic has helped older people stave off the effects of dementia, a new study has suggested.", "url": "https://www.cnn.com/2021/05/15/health/elderly-zoom-dementia-pandemic-scli-scn-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200722172432-elderly-facetime-stock-super-tease.jpg", "publishedAt": "2021-05-15T12:27:00Z", "content": null}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "This Week in Apps: Apple talks App Store fraud, responds to antitrust complaints; Facebook growth is slipping - TechCrunch", "description": "Welcome back to This Week in Apps, the weekly TechCrunch series that recaps the latest in mobile OS news, mobile applications and the overall app economy. The app industry continues to grow, with a record 218 billion downloads and $143 billion in global consu…", "url": "http://techcrunch.com/2021/05/15/this-week-in-apps-apple-talks-app-store-fraud-responds-to-antitrust-complaints-facebook-growth-is-slipping/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/10/this-week-in-apps-splash-2.png?w=753", "publishedAt": "2021-05-15T12:16:42Z", "content": "Welcome back to This Week in Apps, the weekly TechCrunch series that recaps the latest in mobile OS news, mobile applications and the overall app economy.\r\nThe app industry continues to grow, with a … [+21439 chars]"}, {"source": {"id": null, "name": "Bleeding Cool News"}, "author": "Theo Dwyer", "title": "Tasks & Rewards For Swablu Community Day In Pokémon GO - Bleeding Cool News", "description": "Today is Swablu Community Day in Pokémon GO. The festivities begin at 11am local time today, May 15th, and players who purchase an in-shop ticket will have access to the Cotton-Winged Bird Special Research. As the event has begun in earlier timezones, we now …", "url": "https://bleedingcool.com/games/tasks-rewards-for-swablu-community-day-in-pokemon-go/", "urlToImage": "https://bleedingcool.com/wp-content/uploads/2021/05/EitJnbZXkAAvp2T-1-copy-87-6-1200x628.jpg", "publishedAt": "2021-05-15T12:12:09Z", "content": "Today is Swablu Community Day in Pokémon GO. The festivities begin at 11am local time today, May 15th, and players who purchase an in-shop ticket will have access to the Cotton-Winged Bird Special Re… [+2038 chars]"}, {"source": {"id": null, "name": "Android Central"}, "author": "Jerry Hildenbrand", "title": "Apple needs to give Android users a way to detect local AirTags to prevent stalking - Android Central", "description": "The AirTags biggest feature is what makes it a nightmare when it comes to security, safety, and privacy — more than a billion iOS users can track one, but none of the billions of Android users can.", "url": "https://www.androidcentral.com/apple-has-make-android-utility-track-airtags-because-they-are-huge-privacy-and-security-risk", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/05/airtag-keychain-macro.jpg", "publishedAt": "2021-05-15T12:00:02Z", "content": "Source: Jerry Hildenbrand / Android Central\r\nThanks to the Epic lawsuit, we know that Apple isn't keen on including Android users when it comes to its own apps and services. Ecosystem lock-in is a re… [+4236 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mat-smith", "title": "The Morning After: We reviewed the Samsung Galaxy Book Pro 360 - Engadget", "description": "Another robot is on Mars, and we reviewed Samsung's new laptop..", "url": "https://www.engadget.com/samsung-review-tma-111521856.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/c568f410-b56b-11eb-bfea-3e6c1caeed0d", "publishedAt": "2021-05-15T11:15:00Z", "content": "Yes, theres another robot on Mars. On Friday Chinas space agency announced a successful landing for its Tianwen-1 mission that launched last summer. It joins NASAs Perseverance and the UAEs Hope as s… [+3086 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Lily Hay Newman", "title": "WhatsApp’s New Privacy Policy Just Kicked In. Here’s What You Need to Know - WIRED", "description": "Instead of a hard cutoff, the messaging app will gradually degrade and eventually cease to function if you don’t accept the changes.", "url": "https://www.wired.com/story/whatsapp-privacy-policy-facebook-data-sharing/", "urlToImage": "https://media.wired.com/photos/609ee1045cc021afbbe8f9dc/191:100/w_1280,c_limit/Sec_whatsapp_1309852589-(1).jpg", "publishedAt": "2021-05-15T11:00:00Z", "content": "At the beginning of the year, WhatsApp took the seemingly mundane step of updating its terms of use and privacy policy, mostly focused on the app's business offerings. The changes sparked a major bac… [+3481 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Here's three minutes of unedited Biomutant gameplay on five platforms - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2021-05-15-heres-three-minutes-of-unedited-biomutant-gameplay-on-five-platforms", "urlToImage": "https://d2skuhm0vrry40.cloudfront.net/2021/articles/2021-05-15-10-09/heres-three-minutes-of-unedited-biomutant-gameplay-on-five-platforms-1621069794631.jpg/EG11/resize/1200x-1/heres-three-minutes-of-unedited-biomutant-gameplay-on-five-platforms-1621069794631.jpg", "publishedAt": "2021-05-15T09:11:00Z", "content": "THQ Nordic has released just over three minutes of unedited Biomutant gameplay on five different platforms.\r\nIn each video we see a slight variation on the same objective, with the player character s… [+1300 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Henry Stockdale", "title": "Famicom Detective Club: the history behind Nintendo's once-forgotten foray into visual novels - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2021-05-15-famicom-detective-club-the-history-behind-nintendos-forgotten-foray-into-visual-novels", "urlToImage": "https://d2skuhm0vrry40.cloudfront.net/2021/articles/2021-05-14-09-21/-1620980495441.jpg/EG11/resize/1200x-1/-1620980495441.jpg", "publishedAt": "2021-05-15T08:53:10Z", "content": "This week saw the re-release of a real Nintendo curio. The Famicon Detective Club games initially seem to have come from a parallel universe - Nintendo games, but also visual novels? The re-releases … [+6936 chars]"}, {"source": {"id": null, "name": "HYPEBEAST"}, "author": "Nicolaus Li", "title": "Tom Cruise and Russia Are Now Racing To Shoot Film in Space - HYPEBEAST", "description": "Another Space Race but with the American actor involved.", "url": "https://hypebeast.com/2021/5/tom-cruise-nasa-spacex-elon-musk-russia-film-in-space-race-info", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2021%2F05%2Ftw-tom-cruise-nasa-spacex-elon-musk-russia-film-in-space-race-info.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2021-05-15T08:03:28Z", "content": "Earlier this week, Russias Roscosmos state space agency announced plans to film a movie in space later this year. Reportedly titled Challenge, the film by filmmaker Klim Shipenko and will star actres… [+1137 chars]"}, {"source": {"id": null, "name": "TrueAchievements"}, "author": "Sean Carey", "title": "Poll: It's been six months since the Xbox Series X|S launched, do you have one yet? - TrueAchievements", "description": "The Xbox Series X and Xbox Series S launched just over six months ago. Do you have one yet? Let us know by voting in this week's TrueAchievements poll.", "url": "https://www.trueachievements.com/poll/45517/poll-its-been-six-months-since-the-xbox-series-xs-launched-do-you-have-one-yet", "urlToImage": "https://www.trueachievements.com/customimages/117434.jpg", "publishedAt": "2021-05-15T08:00:11Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stephen Nellis", "title": "'Chaos Monkeys' author calls Apple's statement on his departure defamatory - Reuters", "description": "An Apple Inc (AAPL.O) engineer who left the company this week after thousands of coworkers signed a petition calling for him to be sacked said on Twitter he was fired \"in a snap decision\" and that Apple made defamatory statements about him.", "url": "https://www.reuters.com/technology/chaos-monkeys-author-calls-apples-statement-his-departure-defamatory-2021-05-15/", "urlToImage": "https://www.reuters.com/resizer/P_8bB8ukWn0eZxbczA29sKov3TQ=/1200x628/smart/cloudfront-us-east-2.images.arcpublishing.com/reuters/MX66WT2DCZNRTDPP26BL7G6I7Q.jpg", "publishedAt": "2021-05-15T00:40:00Z", "content": "An Apple Inc (AAPL.O) engineer who left the company this week after thousands of coworkers signed a petition calling for him to be sacked said on Twitter he was fired \"in a snap decision\" and that Ap… [+1268 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Tyler Fischer", "title": "Are PlayStation Plus Prices Increasing? - ComicBook.com", "description": "Is the price of PlayStation Plus on PS4 and PS5 about to increase? The price of the subscription service has remained steady throughout the PS4 generation, but it looks Sony could increase the price on PS5, which may explain why the quality of free games ever…", "url": "https://comicbook.com/gaming/news/playstation-plus-ps-free-ps4-ps5-price/", "urlToImage": "https://media.comicbook.com/2021/04/playstation-plus-blue-1266199-1280x0.jpeg", "publishedAt": "2021-05-14T20:56:00Z", "content": "Is the price of PlayStation Plus on PS4 and PS5 about to increase? The price of the subscription service has remained steady throughout the PS4 generation, but it looks Sony could increase the price … [+2063 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Mircea Panait", "title": "This “Hybrid V6 Turbo Corvette” Actually Makes Flat-Plane Crankshaft V8 Sounds - autoevolution", "description": "The Fast Lane typically uploads high-quality reviews or walkarounds of pickup trucks and sport utility vehicles, but on this occasion, the boys have given us a perfect example of Betteridge’s law of headlines. To the point, the answer to any headline that end…", "url": "https://www.autoevolution.com/news/this-hybrid-v6-turbo-corvette-actually-makes-flat-plane-crankshaft-v8-sounds-161242.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/this-hybrid-v6-turbo-corvette-actually-makes-flat-plane-crankshaft-v8-sounds-161242-7.jpg", "publishedAt": "2021-05-14T20:48:00Z", "content": "“Could This Be a Chevy Corvette Hybrid With a Turbo V6?” is the title of the following spy video that depicts two C8 mules followed by a Stingray. The leading car, which features a center-tipped exha… [+1919 chars]"}, {"source": {"id": null, "name": "Android Police"}, "author": "https://www.facebook.com/ryne.hager", "title": "One of Instagram's most-requested features has been spotted in development - Android Police", "description": "Based on some details leaked today, Instagram may be working on one of its most requested features: The ability to make posts from your desktop's browser.", "url": "https://www.androidpolice.com/2021/05/14/one-of-instagrams-most-requested-features-has-been-spotted-in-development/", "urlToImage": "https://www.androidpolice.com/wp-content/uploads/2019/11/instagram-bright-hero.png", "publishedAt": "2021-05-14T20:22:00Z", "content": "Based on some details leaked today, Instagram may be working on one of its most requested features: The ability to make posts from your desktop's browser. The new feature is being tested internally a… [+2227 chars]"}, {"source": {"id": null, "name": "Mansion Global"}, "author": "Katherine Clarke and  Candace Taylor", "title": "Tom Cruise’s Colorado Home Fetches Full $39.5 Million Asking Price - Mansion Global", "description": "The sale for the roughly 320-acre property in Telluride closed just two months after hitting the market", "url": "https://www.mansionglobal.com/articles/tom-cruise-s-colorado-home-fetches-full-39-5-million-asking-price-148412", "urlToImage": "https://static.mansionglobal.com/production/media/article-images/b73c07fd3e56c71f5f59053ab7f40258/large_S1-KH595_CRUISE_OR_20210514100705.jpg", "publishedAt": "2021-05-14T20:10:42Z", "content": "The sale of Tom Cruises Telluride, Colo., estate has closed for the propertys full asking price of $39.5 million, just two months after he listed it for sale, according to the listing agents.\r\nListin… [+1476 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Alex Casas", "title": "GALAX Launches The GeForce RTX 3060 & RTX 3060 Ti LHR With The NVIDIA Cryptocurrency Mining Limiter - Wccftech", "description": "Last week, we reported that GALAX Launched GeForce RTX 3080 &amp; RTX 3070 LHR series graphics cards which feature NVIDIA's hash rate limiter. Now, GALAX has launched the GeForce RTX 3060 &amp; 3060 Ti LHR graphics cards. GALAX Is Launching Their LHR Cards Un…", "url": "https://wccftech.com/galax-launches-the-geforce-rtx-3060-rtx-3060-ti-lhr-with-the-nvidia-cryptocurrency-mining-limiter/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2020/10/NVIDIA-GeForce-RTX-30-Series_Official_3-740x416.png", "publishedAt": "2021-05-14T20:00:43Z", "content": "Last week, we reported that GALAX Launched GeForce RTX 3080 &amp; RTX 3070 LHR series graphics cards which feature NVIDIA's hash rate limiter. Now, GALAX has launched the GeForce RTX 3060 &amp; 3060 … [+1975 chars]"}, {"source": {"id": null, "name": "Wareable"}, "author": "James Stables", "title": "Samsung Galaxy Watch 4 will run Wear OS – but glucose tracking is off the menu - Wareable", "description": "Another week and a new batch of rumors around the Samsung Galaxy Watch 4 and the Watch Active 4.  We’re really excited about what could be seismic change in...", "url": "https://www.wareable.com/samsung/samsung-galaxy-watch-4-no-glucose-tracking-8419", "urlToImage": "https://www.wareable.com/media/imager/202105/35494-posts.facebook_lg.jpg", "publishedAt": "2021-05-14T19:28:10Z", "content": "Another week and a new batch of rumors around the Samsung Galaxy Watch 4 and the Watch Active 4.\r\nWere really excited about what could be seismic change in Samsungs smartwatch line-up, and while rumo… [+2058 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "SpaceX plans for 1st orbital Starship flight hint at Texas-to-Hawaii trip - Space.com", "description": "A Starship prototype will launch from South Texas and splash down off Hawaii.", "url": "https://www.space.com/spacex-first-starship-orbital-flight-plans", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jwyTxXHYQkx3kwVWm8DXPK-1200-80.jpg", "publishedAt": "2021-05-14T19:18:20Z", "content": "SpaceX is getting Starship\r\n ready for its first orbital flight.\r\nThe company plans to launch a prototype Starship vehicle from the usual location near Boca Chica, Texas, and do a round-the-world unc… [+2994 chars]"}, {"source": {"id": null, "name": "9to5Mac"}, "author": null, "title": "Apple discontinuing space gray iMac accessories, available only ‘while supplies last’ - 9to5Mac", "description": "Following the discontinuation of the iMac Pro earlier this year, Apple is now winding down sales of the accompanying space gray Magic Keyboard, Magic Trackpad, and Magic Mouse. These accessories were first introduced exclusively for the iMac Pro when it was r…", "url": "https://9to5mac.com/2021/05/14/apple-space-gray-imac-accessories/", "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2018/01/imac-pro-magic-mouse.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2021-05-14T19:17:00Z", "content": "Following the discontinuation of the iMac Pro earlier this year, Apple is now winding down sales of the accompanying space gray Magic Keyboard, Magic Trackpad, and Magic Mouse. These accessories were… [+1705 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Lexy Savvides", "title": "Google I/O 2021: Android 12, Pixel Buds and what else to expect - CNET", "description": "The annual developers conference, which runs May 18 to 20, should be jam-packed with hardware and software updates.", "url": "https://www.cnet.com/news/google-io-2021-android-12-pixel-buds-what-expect/", "urlToImage": "https://www.cnet.com/a/img/IpyHVAuCd4sPwp6OE40U1r8ruWg=/280x196:4000x2667/1200x630/2019/05/08/f0936864-d11d-4fc3-94ee-10c34c32e6c0/google-io-2019-0936.jpg", "publishedAt": "2021-05-14T19:11:00Z", "content": "James Martin/CNET\r\nGoogle I/O kicks off next week, and even though it's a developers conference, it's likely we'll see some major product announcements, including more details on Android 12 and possi… [+4368 chars]"}, {"source": {"id": null, "name": "GoodHousekeeping.com"}, "author": "Shanon Maglente", "title": "Amazon Prime Day Might Be the Best Time to Buy an Apple Watch - Yahoo Lifestyle", "description": "Here's to hoping the Watch Series 6 will go on sale.", "url": "https://www.goodhousekeeping.com/life/money/a36422201/apple-watch-amazon-prime-day-deals-sales-2021/", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/4_t1blyNd6lsdyEuK6LBQg--~B/aD03MjA7dz0xNDQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/good_housekeeping_561/7c83334943818ffd4d3cc007008e54e2", "publishedAt": "2021-05-14T19:05:00Z", "content": "Word on the street is that Amazon Prime Day 2021 is coming up soon. The sales event typically occurs in July, but in an April 2021 news release the brand said Prime Day \"will take place later in the … [+685 chars]"}, {"source": {"id": null, "name": "Nintendo Life"}, "author": "Nintendo Life", "title": "There's An Animal Crossing Glitch That Lets You Sit In The Hot Tub - Nintendo Life", "description": "The Nintendo Switch is now a \"hot tub time!\" machine", "url": "https://www.nintendolife.com/news/2021/05/theres_an_animal_crossing_glitch_that_lets_you_sit_in_the_hot_tub", "urlToImage": "https://images.nintendolife.com/eb973e14ed4e0/1280x720.jpg", "publishedAt": "2021-05-14T19:00:00Z", "content": "YOU CAN NOW SIT IN THE WATER IN ANIMAL CROSSING: NEW HORIZONS. This is not a drill, folks though it is a glitch, and we can't promise that it won't break your game, so be careful if you want to try i… [+861 chars]"}, {"source": {"id": null, "name": "Android Central"}, "author": "Derrek Lee", "title": "Google Assistant spotted with colorful makeover ahead of possible Android 12 theming system - Android Central", "description": "Google Assistant could get some colorful backgrounds with the theming system expected to arrive on the full Android 12 release.", "url": "https://www.androidcentral.com/google-assistant-background-colors-android-12", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/05/google-assistant-background-colors.jpg", "publishedAt": "2021-05-14T18:37:38Z", "content": "Since the first Android 12 developer preview was released for phones like the Google Pixel 5, a form of system-wide theming has been spotted as a colorful new way to customize your smartphone UI. One… [+1937 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rick Rouan", "title": "Fact check: Watered-down diesel can't be used in a gas-powered vehicle - USA TODAY", "description": "A post on Facebook suggests using watering-down diesel fuel to fill your tank if a gas station runs out of gas. That will damage the vehicle.", "url": "https://www.usatoday.com/story/news/factcheck/2021/05/14/fact-check-watered-down-diesel-damage-gas-powered-engine/5076315001/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/05/12/USAT/1c6cea46-71fd-4961-a1dd-ebbfb5cd11b2-Gas_Shortage_Colonial_Pipeline_Cybersecurity_Attack_08.JPG?crop=5716,3215,x0,y384&width=3200&height=1680&fit=bounds", "publishedAt": "2021-05-14T17:37:30Z", "content": "President Joe Biden announced Colonial Pipeline reached full operational capacity a week after it was shutdown following a cyberattack.\r\nUSA TODAY\r\nThe claim: You can put watered-down diesel in a gas… [+4753 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Rory Mellon", "title": "Google Pixel 6 release date, price, Whitechapel chip, specs and leaks - Tom's Guide", "description": "The Google Pixel 6 promises a custom chip along with other upgrades", "url": "https://www.tomsguide.com/news/google-pixel-6", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JBQR3RQWBr6LVHwMABAdtk-1200-80.jpg", "publishedAt": "2021-05-14T16:21:06Z", "content": "The Google Pixel 6 rumors are heating up, from news of a homegrown processor to a huge change in design language. We also expect to see a larger Pixel 6 Pro alongside the regular Pixel 6.\r\nWere unlik… [+12274 chars]"}, {"source": {"id": null, "name": "Motley Fool"}, "author": "Adam Levy", "title": "Spotify's Quickly Following in Netflix's Footsteps - Motley Fool", "description": "Spotify's latest podcast deal echoes a strategy Netflix used last decade.", "url": "https://www.fool.com/investing/2021/05/14/spotifys-quickly-following-in-netflixs-footsteps/", "urlToImage": "https://g.foolcdn.com/editorial/images/626976/spotify-daniel-ek-3.jpg", "publishedAt": "2021-05-14T16:00:00Z", "content": "Spotify(NYSE:SPOT) has drawn comparisons to Netflix on multiple occasions, particularly as the streaming-media company invests in podcast content. Spotify's latest investment is the exclusive rights … [+3906 chars]"}, {"source": {"id": null, "name": "Kotaku"}, "author": "Zack Zwiezen", "title": "Google Says Everything At Stadia Is Fine, As The Water Reaches Their Noses - Kotaku", "description": "The last 12 months or so have been rough times for Google Stadia. Lawsuits, its main first-party development studio shutting down with little warning, issues with indie devs and key folks leaving the company. But according to Google, a company famous for shut…", "url": "https://kotaku.com/google-says-everything-at-stadia-is-fine-as-the-water-1846896205", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8c49f3ab84d76b76a91a16edb2ea26af.jpg", "publishedAt": "2021-05-14T15:50:00Z", "content": "The last 12 months or so have been rough times for Google Stadia. Lawsuits, its main first-party development studio shutting down with little warning, issues with indie devs and key folks leaving the… [+2589 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "One-of-a-kind Corvette that hit 255 mph in 1988 heads to auction - TechSpot", "description": "As the story goes, Corvette tuner Callaway Cars ordered this 1988 Corvette coupe new from a dealership and had it sent to Callaway Engineering in Old Lyme,...", "url": "https://www.techspot.com/news/89686-legendary-callaway-sledgehammer-corvette-up-auction.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2021/05/2021-05-14-image-8.jpg", "publishedAt": "2021-05-14T15:49:00Z", "content": "In a nutshell: One of the most iconic cars in automotive history has recently come up for auction and if youve got deep enough pockets, it could be yours. The one-off SledgeHammer was designed to set… [+1589 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Verge Staff", "title": "The Verge’s Graduation Gift Guide 2021: the best gifts for high school and college grads - The Verge", "description": "For the 2021 graduation gift guide, we’ve put together a list of devices and other products that will make it easier for graduates to start on their new adventure: Macs, Chromebooks, and Windows PCs; earbuds and speakers; and stuff to help with cooking, gamin…", "url": "https://www.theverge.com/22393913/graduation-gift-ideas-grads-college-dorm-high-school-tech-gadgets", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ryaMx9apsPFh8cyjuPy9I6D-88c=/0x41:2050x1114/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22512319/The_Verge_Graduation_Gift_Guide_2021_2.jpg", "publishedAt": "2021-05-14T15:00:00Z", "content": "Logitech G502 gaming mouse\r\nThe Logitech G502 Lightspeed is a great gaming mouse for discerning gamers who dont want to compromise. Its comfortable, feature-packed, and even though its wireless, its … [+6448 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Eric Slivka", "title": "Longtime Apple Designer Christopher Stringer's Latest Project Is a High-Fidelity Speaker With AirPlay 2 - MacRumors", "description": "Christopher Stringer, a key member of Jony Ive's design team who spent 21 years at Apple before departing in 2017, is resurfacing today with his...", "url": "https://www.macrumors.com/2021/05/14/christopher-stringer-syng-cell-alpha-speaker/", "urlToImage": "https://images.macrumors.com/t/SXTvY9QHBMvsgsvx9HIole-kWlw=/1600x/https://images.macrumors.com/article-new/2021/05/syng-cell-alpha-table-feature.jpg", "publishedAt": "2021-05-14T14:30:53Z", "content": "Christopher Stringer, a key member of Jony Ive's design team who spent 21 years at Apple before departing in 2017, is resurfacing today with his new venture Syng, which seeks to make an impact in the… [+848 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Brandon Widder", "title": "Where to preorder the black and red DualSense controllers for the PS5 - The Verge", "description": "The PlayStation 5’s DualSense controller will soon come in two additional colors: midnight black and cosmic red. They’re now available for preorder for $69.99 and $74.99, respectively, and feature a two-tone design.", "url": "https://www.theverge.com/22434943/where-to-buy-ps5-playstation-5-dualsense-controllers-black-red-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ng3Zv50UlZC2qx8wvl_U1wR3s4M=/0x31:1600x869/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22511516/51176194136_6b76edb34d_h.jpeg", "publishedAt": "2021-05-14T13:51:16Z", "content": "Now, if only you could pick up a console\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nThe new DualSense controller comes in two iterations: Mid… [+2561 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Veritone launches new platform to let celebrities and influencers clone their voice with AI - The Verge", "description": "Cloning your voice with AI could be a lucrative business decision for celebrities and influencers. It would allow you to sell content like product endorsements with minimal effort. That’s why Veritone is launching Marvel.AI, a new platform for creating and se…", "url": "https://www.theverge.com/2021/5/14/22432180/voice-clone-deepfake-celebrities-influencers-veritone-ai-platform", "urlToImage": "https://cdn.vox-cdn.com/thumbor/L1kVZLxivzbporaAbeWbuIOrpYA=/0x75:1920x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22514089/Screen_Shot_2021_05_14_at_12.10.28_PM.png", "publishedAt": "2021-05-14T13:00:21Z", "content": "Deepfake voices could be a lucrative business for influencers\r\nVeritones Marvel.AI platform will let celebrities and influencers create AI copies of their voices. \r\nImage: Veritone\r\nRecording adverti… [+6831 chars]"}]}